[
  {
    "title": "Apple Vision Pro available in the U.S. on February 2",
    "link": "https://www.apple.com/newsroom/2024/01/apple-vision-pro-available-in-the-us-on-february-2/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTFSek5xY21FNGJUUmtRVlZPVFJEdkFSalRBU2dCTWdZbFpaTE5NUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-01-08T08:00:00.000Z",
    "time": "Jan 8",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple announces changes to iOS, Safari, and the App Store in the European Union",
    "link": "https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHdlSEJGYW1WQ2RVOHlkRTVyVFJDb0FSaXNBaWdCTWdhVm9wSUpPUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-01-25T08:00:00.000Z",
    "time": "Jan 25",
    "articleType": "regular",
    "content": "For developers, the changes include new options for app distribution and payment processing\nFor users, the changes include new controls and disclosures, and expanded protections to reduce privacy and security risks the DMA creates\nCUPERTINO, CALIFORNIA Apple today announced changes to iOS, Safari, and the App Store impacting developers’ apps in the European Union (EU) to comply with the Digital Markets Act (DMA). The changes include more than 600 new APIs, expanded app analytics, functionality for alternative browser engines, and options for processing app payments and distributing iOS apps. Across every change, Apple is introducing new safeguards that reduce — but don’t eliminate — new risks the DMA poses to EU users. With these steps, Apple will continue to deliver the best, most secure experience possible for EU users.\nThe new options for processing payments and downloading apps on iOS open new avenues for malware, fraud and scams, illicit and harmful content, and other privacy and security threats. That’s why Apple is introducing protections — including Notarization for iOS apps, an authorization for marketplace developers, and disclosures on alternative payments — to reduce risks and deliver the best, most secure experience possible for users in the EU. Even with these safeguards in place, many risks remain.\nDevelopers can learn about these changes on the Apple Developer Support page and can begin testing new capabilities today in the iOS 17.4 beta. The new capabilities will become available to users in the 27 EU countries beginning in March 2024.\n“The changes we’re announcing today comply with the Digital Markets Act’s requirements in the European Union, while helping to protect EU users from the unavoidable increased privacy and security threats this regulation brings. Our priority remains creating the best, most secure possible experience for our users in the EU and around the world,” said Phil Schiller, Apple Fellow. “Developers can now learn about the new tools and terms available for alternative app distribution and alternative payment processing, new capabilities for alternative browser engines and contactless payments, and more. Importantly, developers can choose to remain on the same business terms in place today if they prefer.”\nThe changes for EU apps reflect the European Commission’s designation of iOS, Safari, and the App Store as “core platform services” under the Digital Markets Act. In March, Apple will share new resources to help EU users understand the changes they can expect. That includes guidance to help EU users navigate complexities the DMA’s changes bring — including a less intuitive user experience — and best practices for approaching new risks associated with downloading apps and processing payments outside of the App Store.\nAvailable for developers’ apps around the world, Apple also announced new options for streaming games, along with more than 50 forthcoming reports in areas like engagement, commerce, app usage, and more.\nIn the EU, Apple is making a number of changes to iOS to comply with the DMA. For developers, those changes include new options for distributing apps. The coming changes to iOS in the EU include:\nNew options for distributing iOS apps from alternative app marketplaces — including new APIs and tools that enable developers to offer their iOS apps for download from alternative app marketplaces.\nNew framework and APIs for creating alternative app marketplaces — enabling marketplace developers to install apps and manage updates on behalf of other developers from their dedicated marketplace app.\nNew frameworks and APIs for alternative browser engines — enabling developers to use browser engines, other than WebKit, for browser apps and apps with in-app browsing experiences.\nInteroperability request form — where developers can submit additional requests for interoperability with iPhone and iOS hardware and software features.\nAs announced by the European Commission, Apple is also sharing DMA-compliant changes impacting contactless payments. That includes new APIs enabling developers to use NFC technology in their banking and wallet apps throughout the European Economic Area. And in the EU, Apple is introducing new controls that allow users to select a third-party contactless payment app — or an alternative app marketplace — as their default.\nInevitably, the new options for developers’ EU apps create new risks to Apple users and their devices. Apple can’t eliminate those risks, but within the DMA’s constraints, the company will take steps to reduce them. These safeguards will be in place when users download iOS 17.4 or later, beginning in March, and include:\nNotarization for iOS apps — a baseline review that applies to all apps, regardless of their distribution channel, focused on platform integrity and protecting users. Notarization involves a combination of automated checks and human review.\nApp installation sheets — that use information from the Notarization process to provide at-a-glance descriptions of apps and their functionality before download, including the developer, screenshots, and other essential information.\nAuthorization for marketplace developers — to ensure marketplace developers commit to ongoing requirements that help protect users and developers.\nAdditional malware protections — that prevent iOS apps from launching if they’re found to contain malware after being installed to a user’s device.\nThese protections — including Notarization for iOS apps, and authorization for marketplace developers — help reduce some of the privacy and security risks to iOS users in the EU. That includes threats like malware or malicious code, and risks of installing apps that misrepresent their functionality or the responsible developer.\nHowever, Apple has less ability to address other risks — including apps that contain scams, fraud, and abuse, or that expose users to illicit, objectionable, or harmful content. In addition, apps that use alternative browser engines — other than Apple’s WebKit — may negatively affect the user experience, including impacts to system performance and battery life.\nWithin the DMA’s constraints, Apple is committed to protecting the privacy, security, and quality of the iOS user experience in the EU as much as possible. For instance, App Tracking Transparency will continue to work with apps distributed outside of the App Store — asking a user’s permission before a developer tracks their data across apps or websites. However, the DMA’s requirements mean that App Store features — including Family Purchase Sharing and Ask to Buy — will not be compatible with apps downloaded from outside of the App Store.\nWhen these changes come into effect in March, Apple will share more detailed resources explaining the options available to users — including best practices for protecting their privacy and security.\nToday, iOS users already have the ability to set a third-party web browser — other than Safari — as their default. Reflecting the DMA’s requirements, Apple is also introducing a new choice screen that will surface when users first open Safari in iOS 17.4 or later. That screen will prompt EU users to choose a default browser from a list of options.\nThis change is a result of the DMA’s requirements, and means that EU users will be confronted with a list of default browsers before they have the opportunity to understand the options available to them. The screen also interrupts EU users’ experience the first time they open Safari intending to navigate to a webpage.\nChanges to the App Store\nOn the App Store, Apple is sharing a number of changes for developers with apps in the EU, affecting apps across Apple’s operating systems — including iOS, iPadOS, macOS, watchOS, and tvOS. The changes also include new disclosures informing EU users of the risks associated with using alternatives to the App Store’s secure payment processing.\nFor developers, those changes include:\nNew options for using payment service providers (PSPs) — within a developer’s app to process payments for digital goods and services.\nNew options for processing payments via link-out — where users can complete a transaction for digital goods and services on the developer’s external website. Developers can also inform EU users of promotions, discounts, and other deals available outside of their apps.\nBusiness planning tools — for developers to estimate fees and understand metrics associated with Apple’s new business terms for apps in the EU.\nThe changes also include new steps to protect and inform EU users, including:\nApp Store product page labels — that inform users when an app they’re downloading uses alternative payment processing.\nIn-app disclosure sheets — that let users know when they are no longer transacting with Apple, and when a developer is directing them to transact using an alternative payment processor.\nNew App Review processes — to verify that developers accurately communicate information about transactions that use alternative payment processors.\nExpanded data portability on Apple’s Data & Privacy site — where EU users can retrieve new data about their usage of the App Store and export it to an authorized third party.\nFor apps that use alternative payment processing, Apple will not be able to issue refunds, and will have less ability to support customers encountering issues, scams, or fraud. Helpful App Store features — like Report a Problem, Family Sharing, and Ask to Buy — will also not reflect these transactions. Users may have to share their payment information with additional parties, creating more opportunities for bad actors to steal sensitive financial information. And on the App Store, users’ purchase history and subscription management will only reflect transactions made using the App Store’s In-App Purchase system.\nNew Business Terms for Apps in the EU\nAlso today, Apple is sharing new business terms available for developers’ apps in the European Union. Developers can choose to adopt these new business terms, or stay on Apple’s existing terms. Developers must adopt the new business terms for EU apps to use the new capabilities for alternative distribution or alternative payment processing.\nThe new business terms for apps in the EU are necessary to support the DMA’s requirements for alternative distribution and payment processing. That includes a fee structure that reflects the many ways Apple creates value for developers’ businesses — including distribution and discovery on the App Store, the App Store’s secure payment processing, Apple’s trusted and secure mobile platform, and all the tools and technology to build and share innovative apps with users around the world.\nDevelopers operating under either set of business terms can continue to use the App Store’s secure payment processing and share their apps on the App Store in the EU. And both sets of business terms reflect Apple’s long-standing work to make the app ecosystem the best opportunity for all developers.\nDevelopers operating under the new business terms will have the option to distribute their iOS apps from the App Store and/or alternative app marketplaces. These developers can also choose to use alternative payment processors in their EU apps on the App Store, across Apple’s operating systems.\nThe new business terms for iOS apps in the EU have three elements:\nReduced commission — iOS apps on the App Store will pay a reduced commission of either 10 percent (for the vast majority of developers, and subscriptions following their first year) or 17 percent on transactions for digital goods and services.\nPayment processing fee — iOS apps on the App Store can use the App Store’s payment processing for an additional 3 percent fee. Developers can use a payment service provider within their app or link users to their website to process payments for no additional fee to Apple.\nCore Technology Fee — iOS apps distributed from the App Store and/or an alternative app marketplace will pay €0.50 for each first annual install per year over a 1 million threshold.\nFor apps on iPadOS, macOS, watchOS, and tvOS in the EU, developers who process payments using a PSP or by linking out to their website will get a 3 percent discount on the commission they owe to Apple.",
    "favicon": ""
  },
  {
    "title": "Introducing Apple Intelligence for iPhone, iPad, and Mac",
    "link": "https://www.apple.com/newsroom/2024/06/introducing-apple-intelligence-for-iphone-ipad-and-mac/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNTVWbFZGWDBjMWVFVmlTM3BoVFJDb0FSaXNBaWdCTWdrUllJN3l2Q1dhQ2dJ=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iOS 18 Preview",
    "link": "https://www.apple.com/ios/ios-18-preview/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUhWRGQwWDJJMU5XSkZXVzVmVFJDakFSaTJBaWdCTWdZQllKQ01NUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T18:48:56.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "Yours. Truly.Customize your iPhone in more ways than ever, stay connected with friends and family, and relive your favorite moments. And with Apple Intelligence, the things you do every day become even more magical.\nOn iPhone 15 Pro and iPhone 15 Pro Max, iOS 18 introduces Apple Intelligence, which draws on your personal context to give you intelligence that’s most helpful and relevant for you.\nComing in beta this fall*\nPersonalize your Home Screen layout.\nMore about Rearrange apps and widgets\nMore about Locked and hidden apps\nSwap out your Lock Screen controls.\nMore about Controls on your Lock Screen\nYour entire library. Organized just for you.\nMore about Biggest redesign ever\nMore about All-new ways to play with text\nExpress yourself in more ways than ever.\nMore about Tapback with any emoji or sticker\nStay connected when you’re without Wi-Fi or cellular.1\nMore about Messages via satellite\nHave it all sorted out for you.2\nMore about All your credentials in one place\nWorks across iPhone, iPad, Mac, Apple Vision Pro, and Windows.\nMore about Securely synced across devices and apps\nDownload the lay of the land.5\nMore about Topographic maps and trail networks\nMore about Custom walking and hiking routes\nMore about More responsive AirPods and controllers\nBring iPhone devices together to pay privately.9\nMore about Introducing Tap to Cash\nPay using rewards or pay in installments.10\nMore about Rewards and installments in Apple Pay\nSay yes with a nod, or no with a shake.\nMore about Hands-free Siri Interactions\nMore about Personalized Spatial Audio for gaming\nMake text stand out with color.\nTune in to the whole conversation.\nMore about Enhance Dialogue on iPhone\nAsk Siri to clean the floors.\nMore about Robot vacuum cleaner support\nPair accessories with greater privacy.\nMore about Improved Bluetooth privacy\nEye Tracking makes it possible for people to control iPhone with just their eyes.19 Music Haptics syncs the iPhone Taptic Engine with the rhythm of songs so those who are deaf or hard of hearing can enjoy the Apple Music catalog.20 And Vocal Shortcuts helps people with severe atypical speech record sounds that trigger specific actions on iPhone.\nAccess the all-new Math Notes calculator, a new portrait orientation for the scientific calculator, and other new features like unit conversion and history.\nA redesigned month view makes it easier to get an overview of your month ahead. And you can create, view, edit, and complete reminders from the Reminders app right in Calendar.\nScenes let you organize and present your board section by section. Send a copy of your board to anyone with just a link. An improved diagramming mode makes it easier to form connections on your canvas. And align your board content just the way you like by snapping items to the grid.\nWith enhanced screen sharing capabilities, you can draw on someone’s screen so they can see what they can do on theirs, or control their screen and take actions yourself.\nShare streaming video and recorded media during emergency calls. During a call, participating emergency dispatchers will send you a request to share live video or photos over a secure connection, making it easier and faster to get the help you need.\nA new design lets you jump right into a personalized selection of workouts or meditations. The For You tab elevates activities based on preferred trainers, durations, and music. And an all-new search feature makes it easy to find exactly what you love.\nRecord and transcribe a live call directly from the Phone app.21 You can also search call history more easily, dial smarter, and switch SIM cards seamlessly.",
    "favicon": ""
  },
  {
    "title": "Apple Intelligence Preview",
    "link": "https://www.apple.com/apple-intelligence/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVJjMVY2V25neFlsaExhM2hWVFJES0FoaVpBU2dCTWdZZEFvekxBUXc=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T18:47:55.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "AI for the rest of us.\nComing in beta this fall*\nBuilt into your iPhone, iPad, and Mac to help you write, express yourself, and get things done effortlessly.\nDraws on your personal context while setting a brand-new standard for privacy in AI.\nExplore new features for writing, focus, and communication.\nCreate expressive images, unique Genmoji, and custom memory movies.\nDiscover an even more capable, integrated, personal Siri.\nGreat powers come with great privacy.\nApple Intelligence is designed to protect your privacy at every step. It’s integrated into the core of your iPhone, iPad, and Mac through on-device processing. So it’s aware of your personal information without collecting your personal information. And with groundbreaking Private Cloud Compute, Apple Intelligence can draw on larger server-based models, running on Apple silicon, to handle more complex requests for you while protecting your privacy.\nYour data is never stored\nUsed only for your requests\nWith ChatGPT from OpenAI integrated into Siri and Writing Tools, you get even more expertise when it might be helpful for you — no need to jump between tools. Siri can tap into ChatGPT for certain requests, including questions about photos or documents. And with Compose in Writing Tools, you can create and illustrate original content from scratch.\nYou control when ChatGPT is used and will be asked before any of your information is shared. Anyone can access ChatGPT for free, without creating an account. ChatGPT subscribers can connect accounts to access paid features within these experiences.\nNew possibilities for your favorite apps.\nNew App Intents, APIs, and frameworks make it incredibly easy for developers to integrate system-level features like Siri, Writing Tools, and Image Playground into your favorite apps.\nApple Intelligence is compatible with these devices.\nApple Intelligence is free to use and will initially be available in U.S. English. Coming in beta this fall.*",
    "favicon": ""
  },
  {
    "title": "Apple to expand repair options with support for used genuine parts",
    "link": "https://www.apple.com/newsroom/2024/04/apple-to-expand-repair-options-with-support-for-used-genuine-parts/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNUNNRVpVY1hsMFRWWkNTWEYwVFJDM0FSaVRBaWdCTWdtQkFZaElIV1p6TkFF=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-04-11T07:00:00.000Z",
    "time": "Apr 11",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple announces new accessibility features, including Eye Tracking, Music Haptics, and Vocal Shortcuts",
    "link": "https://www.apple.com/newsroom/2024/05/apple-announces-new-accessibility-features-including-eye-tracking/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDJlWEJ1T0hZNU1tZFhTSHA2VFJDb0FSaXNBaWdCTWdhcGxJNnZOUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-15T07:00:00.000Z",
    "time": "May 15",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Vision Pro arrives in China mainland, Hong Kong, Japan, and Singapore",
    "link": "https://www.apple.com/newsroom/2024/06/apple-vision-pro-arrives-in-china-mainland-hong-kong-japan-and-singapore/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXJUazFpTnpBelExSllMVU5uVFJDb0FSaXNBaWdCTWdhcElaTHNzUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-27T07:00:00.000Z",
    "time": "Jun 27",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple previews new entertainment experiences launching with Apple Vision Pro",
    "link": "https://www.apple.com/newsroom/2024/01/apple-previews-new-entertainment-experiences-launching-with-apple-vision-pro/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNU1la1pEUXpNNFJtaEZhVmhrVFJDb0FSaXNBaWdCTWdheFU0eFJMUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-01-16T08:00:00.000Z",
    "time": "Jan 16",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple’s Worldwide Developers Conference to kick off June 10 with Keynote address",
    "link": "https://www.apple.com/newsroom/2024/05/apples-worldwide-developers-conference-to-kick-off-june-10-with-keynote-address/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXZlbkZ2ZEdJNE5scHZTRlJPVFJDb0FSaXNBaWdCTWdZaFZZYnNMUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-28T07:00:00.000Z",
    "time": "May 28",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple unveils iPhone 15 Pro and iPhone 15 Pro Max",
    "link": "https://www.apple.com/newsroom/2023/09/apple-unveils-iphone-15-pro-and-iphone-15-pro-max/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTZSM0JXUkRKeE5EQnhWV2RsVFJDb0FSaXNBaWdCTWdZUmM0b3BLZ2M=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T07:00:00.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple announces winners of the 2024 Apple Design Awards",
    "link": "https://www.apple.com/newsroom/2024/06/apple-announces-winners-of-the-2024-apple-design-awards/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXBUa0l3VlhaaWNWRndWa3BmVFJDb0FSaXNBaWdCTWdZaGRJeU5NUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-06T07:00:00.000Z",
    "time": "Jun 6",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iOS 18 makes iPhone more personal, capable, and intelligent than ever",
    "link": "https://www.apple.com/newsroom/2024/06/ios-18-makes-iphone-more-personal-capable-and-intelligent-than-ever/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWlUWE5GV0V4S09VeENlak01VFJDb0FSaXNBaWdCTWdZTlFvckh1Z1k=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "New features come to Apple services this fall",
    "link": "https://www.apple.com/newsroom/2024/06/new-features-come-to-apple-services-this-fall/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWlSM1Z3TlVST016ZEhXV0p1VFJDb0FSaXNBaWdCTWdhTlFZclZxQVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-11T07:00:00.000Z",
    "time": "Jun 11",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple unveils stunning new iPad Pro with the world’s most advanced display, M4 chip, and Apple Pencil Pro",
    "link": "https://www.apple.com/newsroom/2024/05/apple-unveils-stunning-new-ipad-pro-with-m4-chip-and-apple-pencil-pro/",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNVRka3BKTVRoSWQyZEhaRU56VFJDb0FSaXNBaWdCTWdPUmNRNA=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-07T07:00:00.000Z",
    "time": "May 7",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple and Google deliver support for unwanted tracking alerts in iOS and Android",
    "link": "https://www.apple.com/newsroom/2024/05/apple-and-google-deliver-support-for-unwanted-tracking-alerts-in-ios-and-android/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDNaVzl2ZUVKcVZFbFVWRGw1VFJDb0FSaXNBaWdCTWdZQm9aTEV1QVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-13T07:00:00.000Z",
    "time": "May 13",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iPhone 15 Pro and iPhone 15 Pro Max",
    "link": "https://www.apple.com/iphone-15-pro/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWpVMTl4ZFdGVVJGVXhWblJCVFJDakFSaTJBaWdCTWdhZGdvNXNzUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T18:26:15.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "Get credit toward iPhone 15 Pro when you trade in iPhone 11 or higher.Get credit toward iPhone 15 Pro when you trade in iPhone 11 or higher.*\nClick and turn to explore iPhone.\nTap and turn to explore iPhone.\niPhone 15 Pro is the first iPhone to feature an aerospace‑grade titanium design, using the same alloy that spacecraft use for missions to Mars.\nTitanium has one of the best strength‑to‑weight ratios of any metal, making these our lightest Pro models ever. You’ll notice the difference the moment you pick one up.\nThe beautiful, fine‑brushed finish on the titanium bands is achieved through precision machining, sanding, brushing, and blasting.\nNew contoured edges and the thinnest borders ever on iPhone make it even more comfortable to hold in your hand.\nThe titanium band is bonded with a new internal aluminum frame through solid‑state diffusion. This is an industry‑first innovation, using a thermomechanical process that  joins these two metals with incredible strength.\nThe internal frame is also made from  100% recycled aluminum,  which contributes to our overall usage of recycled materials and helps us work toward our 2030 climate goals.\nA strong titanium band.The toughest back glass in a smartphone. And a Ceramic Shield front that’s even tougher than any smartphone glass.\niPhone is  splash, water, and dust resistant.3  What a relief.\niPhone 15 Pro has an  advanced Super Retina XDR display with ProMotion.  It ramps up refresh rates to 120Hz when you need exceptional graphics performance. And ramps down to save power when you don’t.\nDynamic Island  bubbles up alerts and Live Activities — so you don’t miss them while you’re doing something else. You can easily track your next ride, sports scores, flight status, and more.\nWith the Always-On display, your Lock Screen stays glanceable, so you don’t have to tap it to stay in the know. Using smart algorithms, iPhone detects when it’s in your pocket or face down and goes dark to save battery life.\nStandBy4  turns your iPhone into a new, full-screen experience  with glanceable information you can see from a distance. Just set it on its side while charging to display the time, showcase your favorite photos, or keep an eye on your widgets. Thanks to the Always‑On display, it’s persistent. But at night, the screen dims so you can sleep easy.\nA17 Pro chip. A monster win for gaming.\nA new, Pro‑class GPU enables games not seen before on any smartphone.\niPhone 15 Pro uses hardware-accelerated ray tracing for the first time — that’s up to four times faster than software‑based ray tracing, delivering more fluid graphics and true‑to‑life lighting. It’s the fastest ray‑tracing performance in a smartphone.\nMetalFX Upscaling combines the performance of the GPU and the Neural Engine to produce high‑resolution graphics while using much less power. So you can game on and on.\nUp to 20% faster GPU now with 6 cores\nUp to 10% faster CPU with 6 cores\n4x faster ray tracing than A16 Bionic\n2x faster Neural Engine performs nearly 35 trillion operations per second with 16 cores\nA17 Pro GPU is up to 70% faster than the GPU in iPhone 12 Pro\nWith iPhone 15 Pro, you have multiple focal lengths to work with. It’s like having seven pro lenses in your pocket, everywhere you go.\n0.5x Ultra Wide | Macro\n0.5x Ultra Wide | 13 mm\n1x Main | 24 mm\n1x Main | 28 mm\n1x Main | 35 mm\n2x Telephoto | 48 mm\nNew 5x Telephoto | 120 mm\nShoot magical spatial videos,  then relive them on Apple Vision Pro\nA camera that captures your wildest imagination.\nThe advanced quad‑pixel sensor makes the most of 48 megapixels by adapting to what you’re shooting, so you get low‑light photos with phenomenal detail. It also lets you scoot in closer with an additional 2x Telephoto.\nThe new Photonic Engine combines the best pixels from a super‑high‑resolution image with another that’s optimized for light capture. So you automatically get 24MP photos — that’s twice the resolution than before — for everyday shots with extra detail.\nFor the moments when you want to prioritize detail, you have more pro options to choose from.\n48MP HEIF gives you four times more resolution than before, in a format that’s ready to share. Or shoot in 48MP ProRAW for precise control over color, detail, and dynamic range.\nNow you can choose your default Main camera lens — 24 mm, 28 mm, or 35 mm — all without having to carry around extra gear. That’s the power of computational photography.\nThe Photonic Engine supercharges your portraits, giving you beautiful detail, true-to-life color, zero shutter lag, and up to two times better low-light performance.\nNow portraits can be Live Photos, too.\nIn Portrait mode, you can use continuous zoom to move in nice and close.\nAnd you can even shift the focus between subjects after you take a shot.\nMagic is made behind the camera, too.\nIt’s not just portraits that benefit from the Photonic Engine. Night mode now lets you  see your subjects more clearly in darker scenes  with increased dynamic range.\nWhen lighting is bright or uneven, the latest Smart HDR intelligently optimizes for both your subject and the background — giving you photos with  gorgeous color and more accurate skin tones.\nThe TrueDepth camera also uses the latest Smart HDR, Night mode, and portrait enhancements. So  you’ll get your best selfies yet.\nShift. Zoom. Steady. And, cut.\nCinematic mode  automatically shifts the focus  to the most important subject in a scene. And now you can master compelling close‑ups with the new 2x optical‑quality zoom. Bravo.\nUse Action mode to  steady a really shaky handheld shot.\nPro video. Now with more Pro.\nNew  Log encoding makes ProRes even more powerful, enabling more range and flexibility for visual effects and color grading in post.\niPhone 15 Pro is  the first smartphone to support ACES  — Academy Color Encoding System — a global color standard for major movie productions. Do your thing, directors.\nSpatial video capture comes to iPhone.\nTake spatial videos on iPhone 15 Pro and relive them on Apple Vision Pro.\nMake memories come alive with spatial videos. iPhone 15 Pro can shoot 3D videos using the advanced Ultra Wide and Main cameras, so you can relive your favorite moments on Apple Vision Pro.\nFor iPhone 15 Pro Max, we designed a 5x Telephoto camera with the longest optical zoom of any iPhone ever to fit in our compact Pro camera system.\nNow you can  take sharper close‑ups from farther away — like a phenomenal photo of your friend or a goal in your kid’s soccer match.\n5x optical zoom with the 120 mm lens\nWe created a state‑of‑the‑art tetraprism design — a folded glass structure below the lens — to  reflect light rays four times over.  This allows light to travel for longer in the same space, giving you a new focal length that really goes the distance.\nTo support the tetraprism design, we pioneered a 3D sensor‑shift optical image stabilization and autofocus module that moves in all three directions.  Our most advanced stabilization system ever  delivers twice as many microadjustments as before.\nUp to 10,000 microadjustments per second\nLet your overlay be your guide.\nUsing intelligent image stabilization, our new guide  helps you line up super‑zoomed‑in shots.  It will come in handy now that you have up to 25x digital zoom to play with.\nTwice the zoom range of iPhone 12 Pro Max\nTwice the zoom range of iPhone 12 Pro Max\nThe all‑new Action button is  a fast track to your favorite feature.  Once you set the one you want, just press and hold to launch the action.\nBy default, the Action button is set to toggle between Ring and Silent modes. If you choose a different action, you can use Control Center to mute or use Focus filters to automatically set your iPhone to silent.\nWhatever you’re doing, the Action button is at the ready. Launch Camera to catch a spontaneous selfie. Record an instant voice memo. You can even select Shortcut to open an app or run a series of tasks like switching on the lights in your living room and playing music.\niPhone 15 Pro is the first iPhone to support USB 3,5 for a huge leap in data transfer speeds and faster pro workflows than ever before.\nThe new USB‑C connector lets you charge your Mac or iPad with the same cable you use to charge iPhone 15 Pro. Bye‑bye, cable clutter.\nUp to 20x faster file transfers\nAnd with all‑new Wi‑Fi 6E6 you'll get two times faster wireless speeds. So you can upload, download, and transfer files in a flash.\nUSB‑C with USB 35 gives you up to 10Gb/s, so you can transfer your masterful ProRes videos, just like that.\nNow you can connect USB‑C gear like thumb drives, fast external storage, 4K displays, and microphones. And you can charge Apple Watch or AirPods from your iPhone.7\nCharge up to 50% in around 30 minutes8 with the 20W USB‑C Power Adapter (sold separately).\nSwap drives. Keep filming. And carry on.\niPhone 15 Pro lets you shoot ProRes video directly to external storage, so you can quickly switch drives and  keep your iPhone camera rolling on set.  Want to capture slow motion Hollywood style? Now you can record ProRes 4K at 60 fps to an external SSD.\nWant to find a friend in a crowded train station or busy park? Look no further than Precision Finding for Find My friends. It’s powered by the second‑generation Ultra Wideband chip,9 now with three times greater range, so it can lead you right to them.\nTo enable Precision Finding, friends with iPhone 15 or iPhone 15 Pro can share their location only with you using Find My. It’s simple — and private.\nWi‑Fi 6E6  gives you the fastest Wi‑Fi on iPhone — a speed boost that makes a big difference.\n5G provides a superfast experience so you can make high‑quality FaceTime calls, quickly download files, and play real‑time multiplayer games on the go.11\niPhone 15 Pro is the first smartphone with Thread radio, which will allow you to directly control your Thread‑enabled smart home devices.\nUp to 29 hrs video playback on iPhone 15 Pro Max12\nUp to 23 hrs video playback on iPhone 15 Pro12\nAdd a MagSafe Charger for fast, efficient wireless charging13\niPhone 15 Pro Max has up to 9 more hours video playback than iPhone 12 Pro Max\niPhone 15 Pro has up to 6 more hours video playback than iPhone 12 Pro\nIn an emergency, iPhone has your back.\nNew Roadside Assistance via satellite14 can get you help for things like a flat tire or a dead battery, even when you’re off the grid.\niPhone also has Emergency SOS via satellite14 and Crash Detection15, two vital safety features that have helped save lives.\nIn an emergency,iPhone has your back.\nIf your car breaks down and you’re off the beaten path without cell service or Wi‑Fi, you can still use iPhone to get help.14\nFirst, start a new text to Roadside Assistance and follow the easy onscreen steps to see how to connect — and stay connected — to a satellite. Then tap to answer a few key questions, like what model of car you have and what kind of help you need.\nOnce you reply, you’ll be connected with a AAA roadside assistance provider, who can send someone with the right equipment to help get you moving again. Don’t have a membership? No worries. It all works, even if you’re not a member.16\nRoadside Assistance via satellite is included for free for two years with iPhone 15 Pro\nIf you’ve tried calling 911 but don’t have cell service or Wi‑Fi, you can use iPhone to text emergency services over satellite.14\nTo save time, iPhone front-loads important questions to assess your situation. Just tap to respond. Then iPhone will show you where to point your phone to stay connected and avoid obstructions like mountains.\nRemember, it can take from 15 seconds to more than a minute to get through depending on conditions.\niPhone can detect a severe car crash and call for help if you can’t.15\nHardware sensors and advanced motion algorithms identify signs of a crash, like sudden shifts in speed and direction, or changes in cabin pressure caused by deploying airbags.\nThen iPhone can call 911 and notify your emergency contacts. Precision dual‑frequency GPS helps relay your location accurately.\nOver 1 million hours of real‑world driving and crash data helps iPhone recognize accidents\nDesigned to make a difference.\nWhat matters to you matters to Apple, too. From privacy protections that give you more control over your data. To using more recycled materials that minimize environmental impact. To creating built‑in features that make iPhone accessible to all.\nThe internal structural frame of iPhone 15 Pro has\nDesigned to make a difference.\nThe Health app makes it easy for you to access your health and fitness information — and securely share access with apps, relatives, and doctors.\nPasskeys eliminate the need for passwords on apps and websites by using unique digital keys. Just use Touch ID or Face ID to authenticate. Simple and secure.\nSafari Enhanced Private Browsing locks browsing windows when they’re not being used, blocks known trackers from loading, and removes tracking URLs.\nBig steps toward a smaller footprint.\niPhone 15 Pro contains more recycled materials than ever:\n100 percent recycled cobalt in the battery17\n100 percent recycled gold in the USB‑C connector\n100 percent recycled copper foil in the MagSafe inductive charger\nNow 99 percent of iPhone packaging is fiber based,18 with 100 percent recycled or responsibly sourced wood fibers.19 And there’s still no plastic wrap around the box.\nOur stores, offices, and data centers are already carbon neutral. By 2030, our products — and your carbon footprint from using them — will be, too.\nIf you’re at risk of losing your ability to speak, Personal Voice lets you create a voice that sounds like you, so you can communicate with it using Live Speech for calls and conversations.\nMagnifier helps users with vision disabilities learn about their surroundings. For example, Point and Speak20 in Magnifier reads each label you point toward to help you interact with objects like electrical appliances.\nVoiceOver  is a screen reader that tells people who are blind or have low vision exactly what’s happening on iPhone. It can describe friends, objects, text, photos, and even graphs in great detail.\nPro tip: you can get to your favorite accessibility feature faster if you assign it to the Action button\nStyle it out. Swap it over. Sticker it up.\nContact Poster. Create your own poster that contacts will see when you call. Pick a favorite pic or Memoji, pair it with a favorite font, and there you have it — your very own calling card.\nNameDrop. Want to swap contact info with someone? Just bring your iPhone close to theirs. You can both choose what you want to share, and the information transfers instantly.\nLive Stickers.  Touch and hold an object in a photo to lift it from the background and create a sticker. Add effects like Puffy and Shiny. Or create animated stickers from Live Photos.\nMisplaced your iPhone? The latest Apple Watch models can show you its approximate distance and direction.21 To set up a group photo on your iPhone, join the group and use Apple Watch as a viewfinder to snap the shot. And when you take a call on your Apple Watch, just tap your iPhone to continue the conversation there.\nYou can answer calls or messages from your iPhone directly on your Mac. Copy images, video, or text from your iPhone, then paste into another app on your nearby Mac. And with iCloud, you can access your favorite files from either your iPhone or Mac.\nSet up AirPods on iPhone with just a tap. You’ll love Adaptive Audio, which automatically tailors the noise control to provide the best listening experience across different environments and interactions throughout the day.\nOur most advanced 48MP Main camera 3x or 5x Telephoto cameraUltra Wide camera\nUp to 29 hours video playback24\nA16 Bionic chip with 5-core GPU\n48MP Main camera 2x TelephotoUltra Wide camera\nUp to 26 hours video playback24",
    "favicon": ""
  },
  {
    "title": "Apple Vision Pro arrives in new countries and regions beginning June 28",
    "link": "https://www.apple.com/newsroom/2024/06/apple-vision-pro-arrives-in-new-countries-and-regions-beginning-june-28/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXlkVGR1UkdGWlVVOTVURll3VFJEaEFSamhBU2dCTWdZbFZaVE5wUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Behind the scenes at Scary Fast: Apple’s keynote event shot on iPhone and edited on Mac",
    "link": "https://www.apple.com/newsroom/2023/10/behind-the-scenes-at-scary-fast-apples-keynote-event-shot-on-iphone/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUllRkpFTUc1bVZGWXpaRGxaVFJDb0FSaXNBaWdCTWdZTmdaQnRMUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-10-31T07:00:00.000Z",
    "time": "Oct 31, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple introduces transcripts for Apple Podcasts",
    "link": "https://www.apple.com/newsroom/2024/03/apple-introduces-transcripts-for-apple-podcasts/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUZkRWw0WWt0R1R6Vm1RbTFCVFJDS0FoaS1BU2dCTWdZZE5JcU1uUWc=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-03-05T08:00:00.000Z",
    "time": "Mar 5",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Vision Pro arrives in Apple Store locations across the U.S.",
    "link": "https://www.apple.com/newsroom/2024/02/apple-vision-pro-arrives-in-apple-store-locations-across-the-us/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNU9VVWRPVW5Zd04xVkJTVlZtVFJDb0FSaXNBaWdCTWdrQk1ZU016YUhnUmdJ=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-02-02T08:00:00.000Z",
    "time": "Feb 2",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple unveils the new 13- and 15-inch MacBook Air with the powerful M3 chip",
    "link": "https://www.apple.com/newsroom/2024/03/apple-unveils-the-new-13-and-15-inch-macbook-air-with-the-powerful-m3-chip/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTJaRXhrY1RGdVlYTXdhVXcyVFJDb0FSaXNBaWdCTWdZVk1vd3RuUVU=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-03-04T08:00:00.000Z",
    "time": "Mar 4",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple debuts iPhone 15 and iPhone 15 Plus",
    "link": "https://www.apple.com/newsroom/2023/09/apple-debuts-iphone-15-and-iphone-15-plus/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNW1SRU5JY3pGdGFWOXdUbVJ6VFJDS0FoaS1BU2dCTWdZaFU0NVV0UWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T07:00:00.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple unveils App Store Award winners, the best apps and games of 2023",
    "link": "https://www.apple.com/newsroom/2023/11/apple-unveils-app-store-award-winners-the-best-apps-and-games-of-2023/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTRkbmw0WTNsTldXRkxVVGxOVFJDb0FSaXNBaWdCTWdZdGhZN09OUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-11-29T08:00:00.000Z",
    "time": "Nov 29, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iOS 17 is available today",
    "link": "https://www.apple.com/newsroom/2023/09/ios-17-is-available-today/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNWtaV293U0ZVd2FUbDVRVFk1VFJDb0FSaXNBaWdCTWdrTlVvckdLbWRGS2dJ=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-18T07:00:00.000Z",
    "time": "Sep 18, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple introduces new Apple Pencil, bringing more value and choice to the lineup",
    "link": "https://www.apple.com/newsroom/2023/10/apple-introduces-new-apple-pencil-bringing-more-value-and-choice-to-the-lineup/",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNW1UWEF5TVhCTU5XZHZRV0phVFJDb0FSaXNBaWdCTWdNaEFBdw=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-10-17T07:00:00.000Z",
    "time": "Oct 17, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "watchOS 11 brings powerful health and fitness insights, and even more personalization and connectivity",
    "link": "https://www.apple.com/newsroom/2024/06/watchos-11-brings-powerful-health-and-fitness-insights/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDRlbXg1VW1KRFptWk1RazFWVFJDb0FSaXNBaWdCTWdhTllaRE90QWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Redesigned Apple TV app elevates the viewing experience",
    "link": "https://www.apple.com/newsroom/2023/12/redesigned-apple-tv-app-elevates-the-viewing-experience/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXNPVFJHUnpsdVYybG5SRUZGVFJDb0FSaXNBaWdCTWdhUlFvWXJKUWc=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-12-11T08:00:00.000Z",
    "time": "Dec 11, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple launches “Made for Business” in select stores around the world",
    "link": "https://www.apple.com/newsroom/2024/04/apple-launches-made-for-business-in-select-stores-around-the-world/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXFRak5DTkdvM1psQlVWbEJHVFJDb0FSaXNBaWdCTWdhaG9wU05PUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-04-24T07:00:00.000Z",
    "time": "Apr 24",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Office of Public Affairs | Justice Department Sues Apple for Monopolizing Smartphone Markets",
    "link": "https://www.justice.gov/opa/pr/justice-department-sues-apple-monopolizing-smartphone-markets",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVFZbDlvYlV0Q2FqWlJWMVZSVFJDVkFSalRBaWdCTWdZdE1walZHQW8=-w400-h224-p-df-rw",
    "source": "Department of Justice",
    "datetime": "2024-03-21T07:00:00.000Z",
    "time": "Mar 21",
    "articleType": "regular",
    "content": "Apple’s Broad-Based, Exclusionary Conduct Makes It Harder for Americans to Switch Smartphones, Undermines Innovation for Apps, Products, and Services, and Imposes Extraordinary Costs on Developers, Businesses, and Consumers\nThe Justice Department, joined by 16 other state and district attorneys general, filed a civil antitrust lawsuit against Apple for monopolization or attempted monopolization of smartphone markets in violation of Section 2 of the Sherman Act.\nThe complaint, filed in the U.S. District Court for the District of New Jersey, alleges that Apple illegally maintains a monopoly over smartphones by selectively imposing contractual restrictions on, and withholding critical access points from, developers. Apple undermines apps, products, and services that would otherwise make users less reliant on the iPhone, promote interoperability, and lower costs for consumers and developers. Apple exercises its monopoly power to extract more money from consumers, developers, content creators, artists, publishers, small businesses, and merchants, among others. Through this monopolization lawsuit, the Justice Department and state Attorneys General are seeking relief to restore competition to these vital markets on behalf of the American public.\n“Consumers should not have to pay higher prices because companies violate the antitrust laws,” said Attorney General Merrick B. Garland. “We allege that Apple has maintained monopoly power in the smartphone market, not simply by staying ahead of the competition on the merits, but by violating federal antitrust law. If left unchallenged, Apple will only continue to strengthen its smartphone monopoly. The Justice Department will vigorously enforce antitrust laws that protect consumers from higher prices and fewer choices. That is the Justice Department’s legal obligation and what the American people expect and deserve.”\n“No matter how powerful, no matter how prominent, no matter how popular — no company is above the law,” said Deputy Attorney General Lisa Monaco. “Through today’s action, we reaffirm our unwavering commitment to that principle.”\n“When corporations engage in anticompetitive conduct, the American people and our economy suffer,” said Acting Associate Attorney General Benjamin C. Mizer. “Today’s action against Apple sends a strong signal to those seeking to box out competitors and stifle innovation — that the Justice Department is committed to using every tool available to advance economic justice and root out anticompetitive practices, wherever they arise.”\n“For years, Apple responded to competitive threats by imposing a series of “Whac-A-Mole” contractual rules and restrictions that have allowed Apple to extract higher prices from consumers, impose higher fees on developers and creators, and to throttle competitive alternatives from rival technologies,” said Assistant Attorney General Jonathan Kanter of the Justice Department’s Antitrust Division. “Today’s lawsuit seeks to hold Apple accountable and ensure it cannot deploy the same, unlawful playbook in other vital markets.”\nAs alleged in the complaint, Apple has monopoly power in the smartphone and performance smartphones markets, and it uses its control over the iPhone to engage in a broad, sustained, and illegal course of conduct. This anticompetitive behavior is designed to maintain Apple’s monopoly power while extracting as much revenue as possible. The complaint alleges that Apple’s anticompetitive course of conduct has taken several forms, many of which continue to evolve today, including:\nBlocking Innovative Super Apps. Apple has disrupted the growth of apps with broad functionality that would make it easier for consumers to switch between competing smartphone platforms.\nSuppressing Mobile Cloud Streaming Services. Apple has blocked the development of cloud-streaming apps and services that would allow consumers to enjoy high-quality video games and other cloud-based applications without having to pay for expensive smartphone hardware.\nExcluding Cross-Platform Messaging Apps. Apple has made the quality of cross-platform messaging worse, less innovative, and less secure for users so that its customers have to keep buying iPhones.\nDiminishing the Functionality of Non-Apple Smartwatches. Apple has limited the functionality of third-party smartwatches so that users who purchase the Apple Watch face substantial out-of-pocket costs if they do not keep buying iPhones.\nLimiting Third Party Digital Wallets. Apple has prevented third-party apps from offering tap-to-pay functionality, inhibiting the creation of cross-platform third-party digital wallets.\nThe complaint also alleges that Apple’s conduct extends beyond these examples, affecting web browsers, video communication, news subscriptions, entertainment, automotive services, advertising, location services, and more. Apple has every incentive to extend and expand its course of conduct to acquire and maintain power over next-frontier devices and technologies.\nFor over a century, the Department has enforced the antitrust laws against illegal monopolies, deploying the Sherman Act to unfetter markets and restore competition. As alleged in the complaint, the Department is seeking equitable relief on behalf of the American public to redress Apple’s long-running, pervasive anticompetitive conduct.\nApple Inc. is a publicly traded company incorporated in California and headquartered in Cupertino, California. In fiscal year 2023, Apple generated annual net revenues of $383 billion and net income of $97 billion. Apple’s net income exceeds any other company in the Fortune 500 and the gross domestic products of more than 100 countries.",
    "favicon": "/themes/custom/usdoj_uswds/favicon.ico"
  },
  {
    "title": "Apple unveils the redesigned 11-inch and all-new 13-inch iPad Air with M2",
    "link": "https://www.apple.com/newsroom/2024/05/apple-unveils-the-redesigned-11-inch-and-all-new-13-inch-ipad-air-with-m2/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDVXa04zYlRRM1NISmhOVzVaVFJDLUFSaUtBaWdCTWdZbFZJeXVxUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-07T07:00:00.000Z",
    "time": "May 7",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iPadOS 18 Preview",
    "link": "https://www.apple.com/ipados/ipados-18-preview/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNTNhVTFKZUdwdWFsTnJNalJUVFJDakFSaTJBaWdCTWdtSlFaTE5tYWsxREFJ=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T18:47:55.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "Totally. Rewrites. Rules.Explore new ways to work with Apple Pencil, discover new experiences in apps, and customize iPad even further. And bring your ideas to life like never before with Apple Intelligence.\nOn iPad Pro and iPad Air models with M1 and later, iPadOS 18 introduces Apple Intelligence, which draws on your personal context to give you intelligence that’s most helpful and relevant for you.\nComing in beta this fall*\nJot down thoughts fast. Let Smart Script smooth it out.\nMore about Handwriting with Smart Script\nMake text stand out with color.\nMore about Math Notes with Apple Pencil\nMore about Rearrange apps and widgets\nMore about Locked and hidden apps\nMore about Your entire library, organized just for you\nMore about Swipe right for the new Carousel\nType with tone, flair, and feeling.\nMore about All-new ways to play with text\nExpress yourself in more ways than ever.\nMore about Tapback with any emoji or sticker\nMore about More responsive AirPods and controllers\nMore about All your credentials in one place\nWorks across iPad, iPhone, Mac, Apple Vision Pro, and Windows.\nMore about Securely synced across devices and apps\nMore about Remote control in screen sharing\nMore about Redesigned tab bar in apps\nSay yes with a nod, or no with a shake.\nMore about Personalized Spatial Audio for gaming\nEye Tracking makes it possible for people to control iPad and iPhone with just their eyes.10 And Vocal Shortcuts helps people with severe atypical speech record sounds that trigger specific actions on their iPad and iPhone.\nCreate, view, edit, and complete reminders from the Reminders app right in Calendar.\nView detailed trail networks with new topographic maps.11 Browse thousands of hikes and save them for offline access.12 And even create custom routes.\nA new design lets you jump right into a personalized selection of workouts or meditations. The For You tab elevates activities based on preferred trainers, durations, and music. And an all-new search feature makes it easy to find exactly what you love.\nSee real-time actor and music information for Apple Original movies and shows with InSight.13\nWith guest access you can manage how and when people can enter your home.14 Add robot vacuum cleaners to the Home app, including in scenes, automations, and Siri requests.15 And easily access and understand your home electricity use with new Electricity Usage and Rates features.16",
    "favicon": ""
  },
  {
    "title": "Apple introduces M4 chip",
    "link": "https://www.apple.com/newsroom/2024/05/apple-introduces-m4-chip/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVdZWGQxWjNKUU4zRk9jR2hFVFJDb0FSaXNBaWdCTWdZcGxaS3ROUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-07T07:00:00.000Z",
    "time": "May 7",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Final Cut Pro for Mac and iPad get powerful updates",
    "link": "https://www.apple.com/newsroom/2023/11/final-cut-pro-for-mac-and-ipad-get-powerful-updates/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWhNM2RPTUU1MFIyeGhkM0JTVFJDb0FSaXNBaWdCTWdhWllZNHFxUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-11-06T08:00:00.000Z",
    "time": "Nov 6, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple unveils Apple Watch Ultra 2",
    "link": "https://www.apple.com/newsroom/2023/09/apple-unveils-apple-watch-ultra-2/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWxhbEJNZWtOc1IwcGphVGhqVFJDb0FSaXNBaWdCTWdhTmNaTE5zUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T07:00:00.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Vision Pro unlocks new opportunities for health app developers",
    "link": "https://www.apple.com/newsroom/2024/03/apple-vision-pro-unlocks-new-opportunities-for-health-app-developers/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTJjRVJTWWpOYWVHNVZZVVo1VFJDb0FSaXNBaWdCTWdZSlFvaE5uUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-03-11T07:00:00.000Z",
    "time": "Mar 11",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Updates to the Home experience elevate entertainment and bring more convenience",
    "link": "https://www.apple.com/newsroom/2024/06/updates-to-the-home-experience-elevate-entertainment-and-bring-more-convenience/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWhaemxvWWpVd2JEQjNRa1ZTVFJDb0FSaXNBaWdCTWdheFE1aFJJUWs=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Vision Pro brings a new era of spatial computing to business",
    "link": "https://www.apple.com/newsroom/2024/04/apple-vision-pro-brings-a-new-era-of-spatial-computing-to-business/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNXhaazVHVUZKdVFsSkpZWGRwVFJDb0FSaXNBaWdCTWdrQk1JNnlvS2ZBekFF=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-04-09T07:00:00.000Z",
    "time": "Apr 9",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Jing’an to welcome its first customers this Thursday, March 21, in Shanghai",
    "link": "https://www.apple.com/newsroom/2024/03/apple-jingan-to-welcome-its-first-customers-thursday-march-21-in-shanghai/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNDFOVFpQVnpGemVtMVdUM0Z3VFJDb0FSaXNBaWdCTWdrQndJYUF4T09vdVFB=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-03-18T07:00:00.000Z",
    "time": "Mar 18",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iPhone 15 lineup and new Apple Watch lineup arrive worldwide",
    "link": "https://www.apple.com/newsroom/2023/09/iphone-15-lineup-and-new-apple-watch-lineup-arrive-worldwide/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUZXa3hWYlZWRVFYRjBVWFZJVFJDb0FSaXNBaWdCTWdZQk1KekdIQW8=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-22T07:00:00.000Z",
    "time": "Sep 22, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple unveils its first carbon neutral products",
    "link": "https://www.apple.com/newsroom/2023/09/apple-unveils-its-first-carbon-neutral-products/",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNURPVTF6U2tseVZuUnlWV0ZzVFJDb0FSaXNBaWdCTWdNWlF3QQ=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T07:00:00.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple ramps up investment in clean energy and water around the world",
    "link": "https://www.apple.com/newsroom/2024/04/apple-ramps-up-investment-in-clean-energy-and-water-around-the-world/",
    "image": "https://news.google.com/api/attachments/CC8iMkNnNTFZakZCWkV0clFWcFNaekF3VFJDb0FSaXNBaWdCTWdzQkFJU2dzQ00wdVFoc3Fn=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-04-17T07:00:00.000Z",
    "time": "Apr 17",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Watch Series 9",
    "link": "https://www.apple.com/apple-watch-series-9/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWtNMlJVTld0eVptWjVaMUZhVFJDakFSaTJBaWdCTWdZTmdvcElzUVU=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T18:23:52.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "Our most powerful chip in Apple Watch ever. A magical way to use your Apple Watch without touching the screen. A display that’s twice as bright. And now you can choose a watch case and band combination that’s carbon neutral.\nCustom Apple silicon makes Apple Watch Series 9 more capable, more intuitive, and faster. The dual-core CPU has 5.6 billion transistors — 60 percent more than the S8 chip. A four-core Neural Engine processes machine learning tasks up to two times faster. It enables a number of innovations, including the double tap gesture.\nGestures make Apple Watch even easier to use anytime, especially when your hands are full. Just double tap your index finger and thumb together to answer a call, open a notification, play and pause music, and more.\nThe advanced display system in Series 9 boosts the maximum brightness up to 2000 nits — double Series 8 — so it’s easier to read in full sun. It’s also better in low‑light situations, like a movie theater, because it dims to just 1 nit.\nWith Series 9, Siri requests processed on your device are faster and more secure. Plus, Siri dictation is up to 25 percent more accurate. You can ask Siri about your health data, including things like how much you slept last night. Or use it to log information such as your weight or period.\nHomePod control. Watch takes the stage.\nA second-generation Ultra Wideband chip enables integration with HomePod.1 When music is playing, Apple Watch Series 9 opens the Now Playing screen to let you control it. If nothing is playing, the Smart Stack will offer media suggestions to play on HomePod.\nwatchOS 10 brings more to your screen than ever before. Virtually every app has been totally redesigned to give you more information at a glance. From any watch face, simply turn the Digital Crown to reveal the Smart Stack with widgets for relevant and timely information. And with insights for mental and vision health, you can keep track of your body and mind — right from your wrist.\nPowerful insights at a glance.\nApple Watch helps you better understand your mental and physical health. Health data is kept private and secure. And when you’re ready to share with a healthcare provider, friends, or family members, you’re in control.\nApple Watch keeps you connected to the people and things that you care about, right from your wrist. And with a cellular plan, you can do it all without your iPhone nearby.9\nWhatever workout you have in mind, it’s sure to be on your wrist and ready with just a tap. See all the metrics you need to keep motivated in customizable views. And durability that makes it easy to give it all you’ve got, without sweating how your Apple Watch will hold up.\nWhether you fall, get in a car crash, or need help in an emergency, Series 9 can call for help when you need it.\nUse AR to see Apple Watch Series 9.\nJust open this page in Safari on your iPhone or iPad.\nFrom HIIT to Meditation, there’s something for everyone.\nGet credit toward a new Apple Watch.16\nWith Apple Trade In, just give us your eligible Apple Watch and get credit for a new one. It’s good for you and the planet.\nAny case. Any band. Any style you want.\nWhich Apple Watch is right for you?\n44mm or 40mm aluminum case size\nRetina displayUp to 1000 nits\nHigh and low heart rate notifications\nFall Detection and Crash Detection14\nSupports Apple Watch For Your Kids (GPS + Cellular models)Connect family members who don’t have an iPhone19\n45mm or 41mm aluminum or stainless steel case size\nAlways-On Retina displayUp to 2000 nits\nFaster on-device Siri with health data access\nHigh and low heart rate notifications\nFall Detection and Crash Detection14\nSupports Apple Watch For Your Kids (GPS + Cellular models)Connect family members who don’t have an iPhone19\nUp to 36 hours inLow Power Mode22\nAlways-On Retina displayUp to 3000 nits\nFaster on-device Siri with health data access\nHigh and low heart rate notifications\nFall Detection and Crash Detection14\nSupports Apple Watch For Your Kids (GPS + Cellular models)Connect family members who don’t have an iPhone19\nUp to 72 hours inLow Power Mode25",
    "favicon": ""
  },
  {
    "title": "Apple Vision Pro, One Month Later: It's in My Life, Sometimes",
    "link": "https://www.cnet.com/tech/computing/apple-vision-pro-one-month-later-its-in-my-life-sometimes/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXpOM2xsTVZOYVdURnJOMk5tVFJDb0FSaXNBaWdCTWdZaGRJVFB3UVU=-w400-h224-p-df-rw",
    "source": "CNET",
    "datetime": "2024-03-12T07:00:00.000Z",
    "time": "Mar 12",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple TV+ announces “Neuromancer,” new drama based on the multi-award-winning science fiction novel by William Gibson",
    "link": "https://www.apple.com/tv-pr/news/2024/02/apple-tv-announces-neuromancer-new-drama-based-on-the-multi-award-winning-science-fiction-novel-by-william-gibson/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUJZVlJETmxkdWVtVTBabEZQVFJDU0FoaTRBU2dCTWdhTkFvYXNxUVE=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-02-28T08:00:00.000Z",
    "time": "Feb 28",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple expands Self Service Repair and introduces new Diagnostics process",
    "link": "https://www.apple.com/newsroom/2023/12/apple-expands-self-service-repair-and-introduces-new-diagnostics-process/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVFaRGxUUkhwR2FtWjJXV2hTVFJDb0FSaXNBaWdCTWdhcGxaRE50UVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-12-13T08:00:00.000Z",
    "time": "Dec 13, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "My Life Outside of the Apple Vision Pro",
    "link": "https://www.wired.com/story/the-only-thing-worse-than-one-vision-pro-in-a-relationship-is-two/",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNUVNRTB5TFV0SVV6VkRhRGxSVFJEQ0FSaURBaWdCTWdPWmtoSQ=-w400-h224-p-df-rw",
    "source": "WIRED",
    "datetime": "2024-04-20T07:00:00.000Z",
    "time": "Apr 20",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple supercharges 24-inch iMac with new M3 chip",
    "link": "https://www.apple.com/newsroom/2023/10/apple-supercharges-24-inch-imac-with-new-m3-chip/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUJNbnBHTjBKcmJraHpaa0ZaVFJDLUFSaUtBaWdCTWdZZE5Jck1IUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-10-30T07:00:00.000Z",
    "time": "Oct 30, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "watchOS 10 is available today",
    "link": "https://www.apple.com/newsroom/2023/09/watchos-10-is-available-today/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXJRbWhzZWpWa1pXTkRhMVJ2VFJDb0FSaXNBaWdCTWdZZGM1TE5LUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-18T07:00:00.000Z",
    "time": "Sep 18, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple and Île-de-France Mobilités introduce Navigo for iPhone and Apple Watch",
    "link": "https://www.apple.com/newsroom/2024/05/apple-and-ile-de-france-mobilites-introduce-navigo-for-iphone-and-apple-watch/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVJXWGhDYm5SQlVUaEVWV2hPVFJEaEFSamhBU2dCTWdhZE00b0xtZ2s=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-21T07:00:00.000Z",
    "time": "May 21",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Hearing Study shares preliminary insights on tinnitus",
    "link": "https://www.apple.com/newsroom/2024/05/apple-hearing-study-shares-preliminary-insights-on-tinnitus/",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNU5MVmxEVDFReUxVUm1ORUZ1VFJDb0FSaXNBaWdCTWdPZFFndw=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-28T07:00:00.000Z",
    "time": "May 28",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Arcade takes players into a new dimension with spatial gaming",
    "link": "https://www.apple.com/newsroom/2024/02/apple-arcade-takes-players-into-a-new-dimension-with-spatial-gaming/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTFSRmhoY25weGIxZGxWVUV4VFJDb0FSaXNBaWdCTWdhUlVwQnFJUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-02-15T08:00:00.000Z",
    "time": "Feb 15",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iPhone 15 Pro and 15 Pro Max - Technical Specifications",
    "link": "https://www.apple.com/iphone-15-pro/specs/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTZUMnBpWHpRMVgydGpaMHB2VFJDakFSaTJBaWdCTWdhZGdvNXNzUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T18:45:11.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "Black Titanium, White Titanium, Blue Titanium, Natural Titanium\nTitanium designCeramic Shield frontTextured matte glass back\nBlack Titanium, White Titanium, Blue Titanium, Natural Titanium\nTitanium designCeramic Shield frontTextured matte glass back\nThe iPhone 15 Pro display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the screen is 6.12 inches diagonally (actual viewable area is less).\nThe iPhone 15 Pro Max display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the screen is 6.69 inches diagonally (actual viewable area is less).\nProMotion technology with adaptive refresh rates up to 120Hz\n1000 nits max brightness (typical); 1600 nits peak brightness (HDR); 2000 nits peak brightness (outdoor)\nSupport for display of multiple languages and characters simultaneously\nRated IP68 (maximum depth of 6 meters up to 30 minutes) under IEC standard 60529\nNew 6‑core CPU with 2 performance and 4 efficiency cores\n48MP Main: 24 mm, ƒ/1.78 aperture, second‑generation sensor‑shift optical image stabilization, 100% Focus Pixels, support for super‑high‑resolution photos (24MP and 48MP)\n12MP Ultra Wide: 13 mm, ƒ/2.2 aperture and 120° field of view, 100% Focus Pixels\n12MP 2x Telephoto (enabled by quad‑pixel sensor): 48 mm, ƒ/1.78 aperture, second‑generation sensor‑shift optical image stabilization, 100% Focus Pixels\n12MP 3x Telephoto: 77 mm, ƒ/2.8 aperture, optical image stabilization\n3x optical zoom in, 2x optical zoom out; 6x optical zoom range\nDigital zoom up to 15x\n48MP Main: 24 mm, ƒ/1.78 aperture, second‑generation sensor‑shift optical image stabilization, 100% Focus Pixels, support for super‑high‑resolution photos (24MP and 48MP)\n12MP Ultra Wide: 13 mm, ƒ/2.2 aperture and 120° field of view, 100% Focus Pixels\n12MP 2x Telephoto (enabled by quad‑pixel sensor): 48 mm, ƒ/1.78 aperture, second‑generation sensor‑shift optical image stabilization, 100% Focus Pixels\n12MP 5x Telephoto: 120 mm, ƒ/2.8 aperture, 3D sensor‑shift optical image stabilization and autofocus, tetraprism design\n5x optical zoom in, 2x optical zoom out; 10x optical zoom range\nDigital zoom up to 25x\nNext-generation portraits with Focus and Depth Control\nPortrait Lighting with six effects\nNight mode portraits enabled by LiDAR Scanner\nWide color capture for photos and Live Photos\nImage formats captured: HEIF, JPEG, and DNG\n4K video recording at 24 fps, 25 fps, 30 fps, or 60 fps\n1080p HD video recording at 25 fps, 30 fps, or 60 fps\n720p HD video recording at 30 fps\nCinematic mode up to 4K HDR at 30 fps\nAction mode up to 2.8K at 60 fps\nSpatial video recording at 1080p at 30 fps\nHDR video recording with Dolby Vision up to 4K at 60 fps\nProRes video recording up to 4K at 60 fps with external recording\nMacro video recording, including slo‑mo and time‑lapse\nSlo‑mo video support for 1080p at 120 fps or 240 fps\nSecond‑generation sensor‑shift optical image stabilization for video (Main)\nOptical image stabilization for video (3x Telephoto)\n3D sensor‑shift optical image stabilization and autofocus for video (5x Telephoto)\nDigital zoom up to 9x (iPhone 15 Pro) and 15x (iPhone 15 Pro Max)\nCinematic video stabilization (4K, 1080p, and 720p)\nTake 8MP still photos while recording 4K video\nVideo formats recorded: HEVC, H.264, and ProRes\nNext-generation portraits with Focus and Depth Control\nPortrait Lighting with six effects\nWide color capture for photos and Live Photos\n4K video recording at 24 fps, 25 fps, 30 fps, or 60 fps\n1080p HD video recording at 25 fps, 30 fps, or 60 fps\nCinematic mode up to 4K HDR at 30 fps\nHDR video recording with Dolby Vision up to 4K at 60 fps\nProRes video recording up to 4K at 60 fps with external recording\nSlo-mo video support for 1080p at 120 fps\nCinematic video stabilization (4K, 1080p, and 720p)\nEnabled by TrueDepth camera for facial recognition\nPay with your iPhone using Face ID in stores, within apps, and on the web\nSend and receive money in Messages with Apple Cash4\nComplete purchases made with Apple Pay on your Mac\nPay for your ride using Express Transit5\nCredit card created by Apple, designed for iPhone\nGet unlimited 3% Daily Cash at Apple, and select merchants when you use Apple Pay,6 2% with Apple Pay, and 1% everywhere else\nUse the Wallet app to apply for, manage, and use Apple Card\nTitanium, laser‑etched physical credit card for use where Apple Pay is not accepted yet\nShare with up to five people, 13 years or older, in your Family Sharing7 group to track expenses and manage spending\n5G NR (Bands n1, n2, n3, n5, n7, n8, n12, n14, n20, n25, n26, n28, n29, n30, n38, n40, n41, n48, n53, n66, n70, n71, n75, n76, n77, n78, n79)\n5G NR mmWave (Bands n258, n260, n261)\nFDD-LTE (Bands 1, 2, 3, 4, 5, 7, 8, 12, 13, 14, 17, 18, 19, 20, 25, 26, 28, 29, 30, 32, 66, 71)\nTD-LTE (Bands 34, 38, 39, 40, 41, 42, 46, 48, 53)\nUMTS/HSPA+/DC-HSDPA (850, 900, 1700/2100, 1900, 2100 MHz)\nGSM/EDGE (850, 900, 1800, 1900 MHz)\n5G (sub‑6 GHz and mmWave) with 4x4 MIMO10\nGigabit LTE with 4x4 MIMO and LAA10\nWi‑Fi 6E (802.11ax) with 2x2 MIMO11\nExpress Cards with power reserve\nPrecision dual-frequency GPS (GPS, GLONASS, Galileo, QZSS, BeiDou, and NavIC)\nFaceTime video calling over cellular or Wi‑Fi\nFaceTime HD (1080p) video calling over 5G or Wi‑Fi\nShare experiences like movies, TV, music, and other apps in a FaceTime call with SharePlay\nPortrait mode in FaceTime video\nVoice Isolation and Wide Spectrum microphone modes\nOptical zoom with rear‑facing camera\nShare experiences like movies, TV, music, and other apps in a FaceTime call with SharePlay\nVoice Isolation and Wide Spectrum microphone modes\nSupported formats include AAC, MP3, Apple Lossless, FLAC, Dolby Digital, Dolby Digital Plus, and Dolby Atmos\nSupported formats include HEVC, H.264, AV1, and ProRes\nHDR with Dolby Vision, HDR10, and HLG\nUp to 4K HDR AirPlay for mirroring, photos, and video out to Apple TV (2nd generation or later) or AirPlay‑enabled smart TV\nVideo mirroring and video out support: Up to 4K HDR through native DisplayPort output over USB-C or USB-C Digital AV Adapter (model A2119; adapter sold separately)14\nUse your voice to send messages, set reminders, and more\nActivate hands‑free with only your voice using “Siri” or “Hey Siri”\nUse your voice to run shortcuts from your favorite apps\nAction button featuresSilent mode, Focus, Camera, Flashlight, Voice Memo, Translate, Magnifier, Shortcut, or Accessibility\nUSB-C connector with support for:\nVideo playback Up to 23 hours\nVideo playback (streamed) Up to 20 hours\nAudio playback Up to 75 hours\nVideo playback Up to 29 hours\nVideo playback (streamed) Up to 25 hours\nAudio playback Up to 95 hours\nMagSafe wireless charging up to 15W18\nQi2 wireless charging up to 15W18\nQi wireless charging up to 7.5W18\nFast-charge capable: Up to 50% charge in around 30 minutes19 with 20W adapter or higher (available separately)\nWireless charging up to 15W18\niOS 17iOS is the world’s most personal and secure mobile operating system, packed with powerful features and designed to protect your privacy.\nSee what’s new in iOS 17\nBuilt-in accessibility features supporting vision, mobility, hearing, and cognitive disabilities help you get the most out of your iPhone.\nFor a complete list of Apple apps available on iPhone, see apple.com/apps.\nViewable document types.jpg, .tiff, .gif (images); .doc and .docx (Microsoft Word); .htm and .html (web pages); .key (Keynote); .numbers (Numbers); .pages (Pages); .pdf (Preview and Adobe Acrobat); .ppt and .pptx (Microsoft PowerPoint); .txt (text); .rtf (rich text format); .vcf (contact information); .xls and .xlsx (Microsoft Excel); .zip; .ics; .usdz (USDZ Universal)\nApple ID (required for some features)\nSyncing to a Mac or PC requires:\nmacOS Catalina 10.15 or later using the Finder\nmacOS High Sierra 10.13 through macOS Mojave 10.14.6 using iTunes 12.8 or later\nWindows 10 or later using iTunes 12.12.10 or later (free download from apple.com/itunes/download)\nOperating ambient temperature:32° to 95° F (0° to 35° C)\nNonoperating temperature:−4° to 113° F (−20° to 45° C)\nRelative humidity:5% to 95% noncondensing\nOperating altitude:tested up to 10,000 feet (3000 m)\nLanguage supportEnglish (Australia, UK, U.S.), Chinese (Simplified, Traditional, Traditional – Hong Kong), French (Canada, France), German, Italian, Japanese, Korean, Spanish (Latin America, Spain), Arabic, Bulgarian, Catalan, Croatian, Czech, Danish, Dutch, Finnish, Greek, Hebrew, Hindi, Hungarian, Indonesian, Kazakh, Malay, Norwegian, Polish, Portuguese (Brazil, Portugal), Romanian, Russian, Slovak, Swedish, Thai, Turkish, Ukrainian, Vietnamese\nQuickType keyboard supportEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese – Simplified (Handwriting, Pinyin QWERTY, Pinyin 10-Key, Shuangpin, Stroke), Chinese – Traditional (Cangjie, Handwriting, Pinyin QWERTY, Pinyin 10-Key, Shuangpin, Stroke, Sucheng, Zhuyin), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian, Japanese (Kana, Romaji), Korean (2-Set, 10-Key), Spanish (Latin America, Mexico, Spain), Ainu, Albanian, Amharic, Apache (Western), Arabic, Arabic (Najdi), Armenian, Assamese, Assyrian, Azerbaijani, Bangla, Belarusian, Bodo, Bulgarian, Burmese, Cantonese – Traditional (Cangjie, Handwriting, Phonetic, Stroke, Sucheng), Catalan, Cherokee, Croatian, Czech, Danish, Dhivehi, Dogri, Dutch, Dzongkha, Emoji, Estonian, Faroese, Filipino, Finnish, Flemish, Fula (Adlam), Georgian, Greek, Gujarati, Hawaiian, Hebrew, Hindi (Devanagari, Latin, Transliteration), Hungarian, Icelandic, Igbo, Indonesian, Irish Gaelic, Kannada, Kashmiri (Arabic, Devanagari), Kazakh, Khmer, Konkani (Devanagari), Kurdish (Arabic, Latin), Kyrgyz, Lao, Latvian, Lithuanian, Macedonian, Maithili, Malay (Arabic, Latin), Malayalam, Maltese, Manipuri (Bengali, Meetei Mayek), Māori, Marathi, Mongolian, Navajo, Nepali, Norwegian (Bokmål, Nynorsk), Odia, Pashto, Persian, Persian (Afghanistan), Polish, Portuguese (Brazil, Portugal), Punjabi, Rohingya, Romanian, Russian, Samoan, Sanskrit, Santali (Devanagari, Ol Chiki), Serbian (Cyrillic, Latin), Sindhi (Arabic, Devanagari), Sinhala, Slovak, Slovenian, Swahili, Swedish, Tajik, Tamil (Anjal, Tamil 99), Telugu, Thai, Tibetan, Tongan, Turkish, Turkmen, Ukrainian, Urdu, Uyghur, Uzbek (Arabic, Cyrillic, Latin), Vietnamese (Telex, VIQR, VNI), Welsh, Yiddish, Akan, Bangla (Transliteration), Chickasaw, Choctaw, Chuvash, Gujarati (Transliteration), Hausa, Hmong (Pahawh), Ingush, Japanese (Handwriting), Kabyle, Kannada (Transliteration), Liangshan Yi, Malayalam (Transliteration), Mandaic, Marathi (Transliteration), Mi’kmaw, N’Ko, Osage, Punjabi (Transliteration), Rejang, Tamazight (Standard Moroccan), Tamil (Transliteration), Telugu (Transliteration), Urdu (Transliteration), Wancho, Wolastoqey, Yoruba\nQuickType keyboard support with autocorrectionArabic, Arabic (Najdi), Bangla, Bulgarian, Catalan, Cherokee, Chinese – Simplified (Pinyin QWERTY), Chinese – Traditional (Pinyin QWERTY), Chinese – Traditional (Zhuyin), Croatian, Czech, Danish, Dutch, English (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Estonian, Filipino, Finnish, Dutch (Belgium), French (Belgium), French (Canada), French (France), French (Switzerland), German (Austria), German (Germany), German (Switzerland), Greek, Gujarati, Hawaiian, Hebrew, Hindi (Devanagari, Latin, Transliteration), Hungarian, Icelandic, Indonesian, Irish Gaelic, Italian, Japanese (Kana), Japanese (Romaji), Korean (2-Set, 10-Key), Latvian, Lithuanian, Macedonian, Malay, Marathi, Norwegian (Bokmål), Norwegian (Nynorsk), Persian, Persian (Afghanistan), Polish, Portuguese (Brazil), Portuguese (Portugal), Punjabi, Romanian, Russian, Serbian (Cyrillic), Serbian (Latin), Slovak, Slovenian, Spanish (Latin America), Spanish (Mexico), Spanish (Spain), Swedish, Tamil (Anjal), Tamil (Tamil 99), Telugu, Thai, Turkish, Ukrainian, Urdu, Vietnamese (Telex)\nQuickType keyboard support with predictive typingEnglish (Australia, Canada, India, Japan, Singapore, South Africa, UK, U.S.), Chinese (Simplified, Traditional), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian, Japanese, Korean, Spanish (Latin America, Mexico, Spain), Arabic, Arabic (Najdi), Cantonese (Traditional), Dutch, Hindi (Devanagari, Latin), Portuguese (Brazil, Portugal), Russian, Swedish, Thai, Turkish, Vietnamese, Hebrew, Polish, Romanian\nQuickType keyboard support with multilingual typingEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese – Simplified (Pinyin), Chinese – Traditional (Pinyin), French (France), French (Belgium), French (Canada), French (Switzerland), German (Germany), German (Austria), German (Switzerland), Italian, Japanese (Romaji), Portuguese (Brazil), Portuguese (Portugal), Spanish (Spain), Spanish (Latin America), Spanish (Mexico), Dutch (Belgium), Dutch (Netherlands), Hindi (Latin), Vietnamese, Polish, Romanian, Turkish\nQuickType keyboard support with contextual suggestionsEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese (Simplified), French (Belgium), French (Canada), French (France), French (Switzerland), German (Austria), German (Germany), German (Switzerland), Italian, Spanish (Latin America), Spanish (Mexico), Spanish (Spain), Arabic, Arabic (Najdi), Dutch (Belgium), Dutch (Netherlands), Hindi (Devanagari), Hindi (Latin), Russian, Swedish, Portuguese (Brazil), Turkish, Vietnamese\nQuickType keyboard support with QuickPathEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese (Simplified Pinyin QWERTY), Chinese (Traditional Pinyin QWERTY), French (Canada), French (France), French (Switzerland), German (Austria), German (Germany), German (Switzerland), Italian, Spanish (Latin America), Spanish (Mexico), Spanish (Spain), Portuguese (Brazil), Portuguese (Portugal), Dutch (Belgium), Dutch (Netherlands), Swedish, Vietnamese, Arabic, Hebrew, Korean, Polish, Romanian\nSiri languagesEnglish (Australia, Canada, India, Ireland, New Zealand, Singapore, South Africa, UK, U.S.), Spanish (Chile, Mexico, Spain, U.S.), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian (Italy, Switzerland), Japanese (Japan), Korean (Republic of Korea), Mandarin Chinese (China mainland, Taiwan), Cantonese (China mainland, Hong Kong), Arabic (Saudi Arabia, United Arab Emirates), Danish (Denmark), Dutch (Belgium, Netherlands), Finnish (Finland), Hebrew (Israel), Malay (Malaysia), Norwegian (Norway), Portuguese (Brazil), Russian (Russia), Swedish (Sweden), Thai (Thailand), Turkish (Türkiye)\nDictation languagesEnglish (Australia, Canada, India, Ireland, Malaysia, New Zealand, Philippines, Saudi Arabia, Singapore, South Africa, United Arab Emirates, UK, U.S.), Cantonese (China mainland, Hong Kong), Mandarin Chinese (China mainland, Taiwan), French (Belgium, Canada, France, Luxembourg, Switzerland), German (Austria, Germany, Switzerland), Italian (Italy, Switzerland), Japanese, Korean, Spanish (Chile, Colombia, Mexico, Spain, U.S.), Portuguese (Brazil, Portugal), Arabic (Kuwait, Qatar, Saudi Arabia, United Arab Emirates), Catalan, Croatian, Czech, Danish, Dutch (Belgium, Netherlands), Finnish, Greek, Hebrew, Hindi, Hungarian, Indonesian, Malay, Norwegian (Bokmål), Polish, Romanian, Russian, Shanghainese (China mainland), Slovak, Swedish, Thai, Turkish, Ukrainian, Vietnamese\nMonolingual dictionary supportEnglish (UK, U.S.), Chinese (Simplified, Traditional, Traditional – Hong Kong), Danish, Dutch, French, German, Hebrew, Hindi, Italian, Japanese, Korean, Norwegian, Portuguese, Russian, Spanish, Swedish, Thai, Turkish, Bulgarian, Catalan, Greek, Malay, Polish, Punjabi, Romanian\nIdiom dictionary supportSimplified Chinese, Traditional Chinese – English, Cantonese – English\nBilingual dictionary supportArabic – English, Bangla – English, Chinese (Simplified) – English, Chinese (Traditional) – English, Czech – English, Dutch – English, Finnish – English, French – English, French – German, German – English, Gujarati – English, Hindi – English, Hungarian – English, Indonesian – English, Italian – English, Japanese – English, Japanese – Chinese (Simplified), Korean – English, Polish – English, Portuguese – English, Russian – English, Spanish – English, Tamil – English, Telugu – English, Thai – English, Urdu – English, Vietnamese – English, English – Greek, English – Malay, English – Swedish\nThesaurusEnglish (UK, U.S.), Chinese (Simplified)\nSpell checkEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian, Spanish (Latin America, Mexico, Spain), Arabic, Arabic (Najdi), Bulgarian, Czech, Danish, Dutch (Netherlands, Belgium), Finnish, Greek, Hindi (Devanagari), Hungarian, Irish Gaelic, Norwegian (Bokmål, Nynorsk), Polish, Portuguese (Brazil, Portugal), Punjabi, Romanian, Russian, Swedish, Telugu, Turkish, Vietnamese\nApple Pay supported regionsArgentina, Armenia, Australia, Austria, Azerbaijan, Bahrain, Belarus, Belgium, Brazil, Bulgaria, Canada, Chile, China mainland,22 Colombia, Costa Rica, Croatia, Cyprus, Czech Republic, Denmark, El Salvador, Estonia, Faroe Islands, Finland, France, Georgia, Germany, Greece, Greenland, Guatemala, Guernsey, Honduras, Hong Kong, Hungary, Iceland, Ireland, Isle of Man, Israel, Italy, Japan, Jersey, Jordan, Kazakhstan, Kuwait, Latvia, Liechtenstein, Lithuania, Luxembourg, Macao, Malaysia, Malta, Mexico, Moldova, Monaco, Montenegro, Morocco, Netherlands, New Zealand, Norway, Palestine, Panama, Peru, Poland, Portugal, Qatar, Romania, San Marino, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, South Africa, South Korea, Spain, Sweden, Switzerland, Taiwan, UK, Ukraine, United Arab Emirates, U.S., Vatican City, Vietnam\nUSB‑C Charge Cable (1 m)\nProgress toward Apple’s 2030 carbon neutral goal\n20% recycled or renewable content24\n28% emissions reduction against baseline25\n38% of manufacturing electricity is sourced from supplier clean energy projects26\n100% recycled aluminum in the internal structural frame\n100% recycled cobalt in the battery27 — a first for Apple\n100% recycled copper foil in the main logic board and — in a first for Apple — the MagSafe inductive charger\n100% recycled copper wire and 100% recycled tungsten in the Taptic Engine\n100% recycled gold in the wire of all cameras, the plating of multiple printed circuit boards, and the USB‑C connector\n100% recycled rare earth elements in all magnets, representing 100% of the rare earth elements in the device28\n100% recycled tin in the solder of multiple printed circuit boards\n35% or more recycled plastic in multiple components\nExceeds U.S. Department of Energy requirements for battery charger systems29\nMercury-, BFR-, PVC-, and beryllium-free\nNo established final assembly sites generate waste sent to landfill as part of Apple’s Zero Waste Program\nAll final assembly supplier sites are transitioning to 100% renewable energy for Apple production\n99% or more fiber-based packaging31\n100% of virgin wood fiber comes from responsibly managed forests32\nTrade in your eligible device for credit toward your next purchase, or get an Apple Gift Card you can use anytime.33 If your device isn’t eligible for credit, we’ll recycle it for free.\nWe’re committed to making our products without taking from the earth, and to become carbon neutral across our entire business, including products, by 2030.\nTrade in your smartphone for credit.\nWith Apple Trade In, you can get credit toward a new iPhone when you trade in an eligible smartphone.33 It’s good for you and the planet.\nStill have questions? Just ask.\nYou won’t find a better place to buy iPhone. We know about carriers, payment options, and more. And we make it easy to understand.",
    "favicon": ""
  },
  {
    "title": "AirPods introduce convenient ways to communicate and interact",
    "link": "https://www.apple.com/newsroom/2024/06/airpods-introduce-convenient-ways-to-communicate-and-interact/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNVNZM3BGTUdoM2VqbHlaSEZ0VFJEaEFSamhBU2dCTWdtZFE0NVJuYW1LandF=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple’s 2024 Pride Collection shines light on LGBTQ+ communities",
    "link": "https://www.apple.com/newsroom/2024/05/apples-2024-pride-collection-shines-light-on-lgbtq-plus-communities/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXhSMnQzUTB4SmRFNXFNR1JqVFJDb0FSaXNBaWdCTWdhWlVvNktKUWc=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-06T07:00:00.000Z",
    "time": "May 6",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple The Exchange TRX opens Saturday, June 22, in Kuala Lumpur",
    "link": "https://www.apple.com/newsroom/2024/06/apple-the-exchange-trx-opens-saturday-june-22-in-kuala-lumpur/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUthakp3WlhKNFJrMTBaMEV5VFJDb0FSaXNBaWdCTWdhQllZWkpRUU0=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-19T07:00:00.000Z",
    "time": "Jun 19",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Inside Apple’s Big Plan to Bring Generative AI to All Its Devices",
    "link": "https://www.bloomberg.com/news/newsletters/2023-10-22/what-is-apple-doing-in-ai-revamping-siri-search-apple-music-and-other-apps-lo1ffr7p",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVpiMWMwWjJ4MGFVazBlV28yVFJDM0FSaVRBaWdCTWdZZEJwWUxBZ2s=-w400-h224-p-df-rw",
    "source": "Bloomberg",
    "datetime": "2023-10-22T07:00:00.000Z",
    "time": "Oct 22, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iPhone 15 and iPhone 15 Plus - Technical Specifications",
    "link": "https://www.apple.com/iphone-15/specs/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHRkRmQ1VWpGR1YxTm9SbE14VFJDakFSaTJBaWdCTWdhbGhJNnRNUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T18:45:10.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "Black, Blue, Green, Yellow, Pink\nAluminum design Ceramic Shield front Color-infused glass back\nBlack, Blue, Green, Yellow, Pink\nAluminum design Ceramic Shield front Color-infused glass back\nThe iPhone 15 display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the screen is 6.12 inches diagonally (actual viewable area is less).\nThe iPhone 15 Plus display has rounded corners that follow a beautiful curved design, and these corners are within a standard rectangle. When measured as a standard rectangular shape, the screen is 6.69 inches diagonally (actual viewable area is less).\n1000 nits max brightness (typical); 1600 nits peak brightness (HDR); 2000 nits peak brightness (outdoor)\nSupport for display of multiple languages and characters simultaneously\nRated IP68 (maximum depth of 6 meters up to 30 minutes) under IEC standard 60529\n6‑core CPU with 2 performance and 4 efficiency cores\n48MP Main: 26 mm, ƒ/1.6 aperture, sensor‑shift optical image stabilization, 100% Focus Pixels, support for super-high-resolution photos (24MP and 48MP)\n12MP Ultra Wide: 13 mm, ƒ/2.4 aperture and 120° field of view\n12MP 2x Telephoto (enabled by quad-pixel sensor): 52 mm, ƒ/1.6 aperture, sensor-shift optical image stabilization, 100% Focus Pixels\n2x optical zoom in, 2x optical zoom out; 4x optical zoom range\nDigital zoom up to 10x\nNext-generation portraits with Focus and Depth Control\nPortrait Lighting with six effects\nWide color capture for photos and Live Photos\nImage formats captured: HEIF and JPEG\n4K video recording at 24 fps, 25 fps, 30 fps, or 60 fps\n1080p HD video recording at 25 fps, 30 fps, or 60 fps\n720p HD video recording at 30 fps\nCinematic mode up to 4K HDR at 30 fps\nAction mode up to 2.8K at 60 fps\nHDR video recording with Dolby Vision up to 4K at 60 fps\nSlo‑mo video support for 1080p at 120 fps or 240 fps\nSensor-shift optical image stabilization for video (Main)\nDigital zoom up to 6x\nCinematic video stabilization (4K, 1080p, and 720p)\nTake 8MP still photos while recording 4K video\nVideo formats recorded: HEVC and H.264\nNext-generation portraits with Focus and Depth Control\nPortrait Lighting with six effects\nWide color capture for photos and Live Photos\n4K video recording at 24 fps, 25 fps, 30 fps, or 60 fps\n1080p HD video recording at 25 fps, 30 fps, or 60 fps\nCinematic mode up to 4K HDR at 30 fps\nHDR video recording with Dolby Vision up to 4K at 60 fps\nSlo-mo video support for 1080p at 120 fps\nCinematic video stabilization (4K, 1080p, and 720p)\nEnabled by TrueDepth camera for facial recognition\nPay with your iPhone using Face ID in stores, within apps, and on the web\nSend and receive money in Messages with Apple Cash4\nComplete purchases made with Apple Pay on your Mac\nPay for your ride using Express Transit5\nCredit card created by Apple, designed for iPhone\nGet unlimited 3% Daily Cash at Apple, and select merchants when you use Apple Pay,6 2% with Apple Pay, and 1% everywhere else\nUse the Wallet app to apply for, manage, and use Apple Card\nTitanium, laser‑etched physical credit card for use where Apple Pay is not accepted yet\nShare with up to five people, 13 years or older, in your Family Sharing7 group to track expenses and manage spending\n5G NR (Bands n1, n2, n3, n5, n7, n8, n12, n14, n20, n25, n26, n28, n29, n30, n38, n40, n41, n48, n53, n66, n70, n71, n75, n76, n77, n78, n79)\n5G NR mmWave (Bands n258, n260, n261)\nFDD‑LTE (Bands 1, 2, 3, 4, 5, 7, 8, 12, 13, 14, 17, 18, 19, 20, 25, 26, 28, 29, 30, 32, 66, 71)\nTD‑LTE (Bands 34, 38, 39, 40, 41, 42, 46, 48, 53)\nUMTS/HSPA+/DC-HSDPA (850, 900, 1700/2100, 1900, 2100 MHz)\nGSM/EDGE (850, 900, 1800, 1900 MHz)\n5G (sub‑6 GHz and mmWave) with 4x4 MIMO10\nGigabit LTE with 4x4 MIMO and LAA10\nWi‑Fi 6 (802.11ax) with 2x2 MIMO\nGPS, GLONASS, Galileo, QZSS, and BeiDou\nFaceTime video calling over cellular or Wi‑Fi\nFaceTime HD (1080p) video calling over 5G or Wi-Fi\nShare experiences like movies, TV, music, and other apps in a FaceTime call with SharePlay\nVoice Isolation and Wide Spectrum microphone modes\nShare experiences like movies, TV, music, and other apps in a FaceTime call with SharePlay\nVoice Isolation and Wide Spectrum microphone modes\nSupported formats include AAC, MP3, Apple Lossless, FLAC, Dolby Digital, Dolby Digital Plus, and Dolby Atmos\nSupported formats include HEVC, H.264, and ProRes\nHDR with Dolby Vision, HDR10, and HLG\nUp to 4K HDR AirPlay for mirroring, photos, and video out to Apple TV (2nd generation or later) or AirPlay‑enabled smart TV\nVideo mirroring and video out support: Up to 4K HDR through native DisplayPort output over USB-C or USB-C Digital AV Adapter (model A2119; adapter sold separately)13\nUse your voice to send messages, set reminders, and more\nActivate hands‑free with only your voice using “Siri” or “Hey Siri”\nUse your voice to run shortcuts from your favorite apps\nUSB-C connector with support for:\nVideo playback Up to 20 hours\nVideo playback (streamed) Up to 16 hours\nAudio playback Up to 80 hours\nVideo playback Up to 26 hours\nVideo playback (streamed) Up to 20 hours\nAudio playback Up to 100 hours\nMagSafe wireless charging up to 15W16\nQi2 wireless charging up to 15W16\nQi wireless charging up to 7.5W16\nFast-charge capable: Up to 50% charge in around 30 minutes17 with 20W adapter or higher (available separately)\nWireless charging up to 15W16\niOS 17iOS is the world’s most personal and secure mobile operating system, packed with powerful features and designed to protect your privacy.\nSee what’s new in iOS 17\nBuilt-in accessibility features supporting vision, mobility, hearing, and cognitive disabilities help you get the most out of your iPhone.\nFor a complete list of Apple apps available on iPhone, see apple.com/apps.\nViewable document types.jpg, .tiff, .gif (images); .doc and .docx (Microsoft Word); .htm and .html (web pages); .key (Keynote); .numbers (Numbers); .pages (Pages); .pdf (Preview and Adobe Acrobat); .ppt and .pptx (Microsoft PowerPoint); .txt (text); .rtf (rich text format); .vcf (contact information); .xls and .xlsx (Microsoft Excel); .zip; .ics; .usdz (USDZ Universal)\nApple ID (required for some features)\nSyncing to a Mac or PC requires:\nmacOS Catalina 10.15 or later using the Finder\nmacOS High Sierra 10.13 through macOS Mojave 10.14.6 using iTunes 12.8 or later\nWindows 10 or later using iTunes 12.12.10 or later (free download from apple.com/itunes/download)\nOperating ambient temperature:32° to 95° F (0° to 35° C)\nNonoperating temperature:−4° to 113° F (−20° to 45° C)\nRelative humidity:5% to 95% noncondensing\nOperating altitude:tested up to 10,000 feet (3000 m)\nLanguage supportEnglish (Australia, UK, U.S.), Chinese (Simplified, Traditional, Traditional – Hong Kong), French (Canada, France), German, Italian, Japanese, Korean, Spanish (Latin America, Spain), Arabic, Bulgarian, Catalan, Croatian, Czech, Danish, Dutch, Finnish, Greek, Hebrew, Hindi, Hungarian, Indonesian, Kazakh, Malay, Norwegian, Polish, Portuguese (Brazil, Portugal), Romanian, Russian, Slovak, Swedish, Thai, Turkish, Ukrainian, Vietnamese\nQuickType keyboard supportEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese – Simplified (Handwriting, Pinyin QWERTY, Pinyin 10-Key, Shuangpin, Stroke), Chinese – Traditional (Cangjie, Handwriting, Pinyin QWERTY, Pinyin 10-Key, Shuangpin, Stroke, Sucheng, Zhuyin), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian, Japanese (Kana, Romaji), Korean (2-Set, 10-Key), Spanish (Latin America, Mexico, Spain), Ainu, Albanian, Amharic, Apache (Western), Arabic, Arabic (Najdi), Armenian, Assamese, Assyrian, Azerbaijani, Bangla, Belarusian, Bodo, Bulgarian, Burmese, Cantonese – Traditional (Cangjie, Handwriting, Phonetic, Stroke, Sucheng), Catalan, Cherokee, Croatian, Czech, Danish, Dhivehi, Dogri, Dutch, Dzongkha, Emoji, Estonian, Faroese, Filipino, Finnish, Flemish, Fula (Adlam), Georgian, Greek, Gujarati, Hawaiian, Hebrew, Hindi (Devanagari, Latin, Transliteration), Hungarian, Icelandic, Igbo, Indonesian, Irish Gaelic, Kannada, Kashmiri (Arabic, Devanagari), Kazakh, Khmer, Konkani (Devanagari), Kurdish (Arabic, Latin), Kyrgyz, Lao, Latvian, Lithuanian, Macedonian, Maithili, Malay (Arabic, Latin), Malayalam, Maltese, Manipuri (Bengali, Meetei Mayek), Māori, Marathi, Mongolian, Navajo, Nepali, Norwegian (Bokmål, Nynorsk), Odia, Pashto, Persian, Persian (Afghanistan), Polish, Portuguese (Brazil, Portugal), Punjabi, Rohingya, Romanian, Russian, Samoan, Sanskrit, Santali (Devanagari, Ol Chiki), Serbian (Cyrillic, Latin), Sindhi (Arabic, Devanagari), Sinhala, Slovak, Slovenian, Swahili, Swedish, Tajik, Tamil (Anjal, Tamil 99), Telugu, Thai, Tibetan, Tongan, Turkish, Turkmen, Ukrainian, Urdu, Uyghur, Uzbek (Arabic, Cyrillic, Latin), Vietnamese (Telex, VIQR, VNI), Welsh, Yiddish, Akan, Bangla (Transliteration), Chickasaw, Choctaw, Chuvash, Gujarati (Transliteration), Hausa, Hmong (Pahawh), Ingush, Japanese (Handwriting), Kabyle, Kannada (Transliteration), Liangshan Yi, Malayalam (Transliteration), Mandaic, Marathi (Transliteration), Mi’kmaw, N’Ko, Osage, Punjabi (Transliteration), Rejang, Tamazight (Standard Moroccan), Tamil (Transliteration), Telugu (Transliteration), Urdu (Transliteration), Wancho, Wolastoqey, Yoruba\nQuickType keyboard support with autocorrectionArabic, Arabic (Najdi), Bangla, Bulgarian, Catalan, Cherokee, Chinese – Simplified (Pinyin QWERTY), Chinese – Traditional (Pinyin QWERTY), Chinese – Traditional (Zhuyin), Croatian, Czech, Danish, Dutch, English (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Estonian, Filipino, Finnish, Dutch (Belgium), French (Belgium), French (Canada), French (France), French (Switzerland), German (Austria), German (Germany), German (Switzerland), Greek, Gujarati, Hawaiian, Hebrew, Hindi (Devanagari, Latin, Transliteration), Hungarian, Icelandic, Indonesian, Irish Gaelic, Italian, Japanese (Kana), Japanese (Romaji), Korean (2-Set, 10-Key), Latvian, Lithuanian, Macedonian, Malay, Marathi, Norwegian (Bokmål), Norwegian (Nynorsk), Persian, Persian (Afghanistan), Polish, Portuguese (Brazil), Portuguese (Portugal), Punjabi, Romanian, Russian, Serbian (Cyrillic), Serbian (Latin), Slovak, Slovenian, Spanish (Latin America), Spanish (Mexico), Spanish (Spain), Swedish, Tamil (Anjal), Tamil (Tamil 99), Telugu, Thai, Turkish, Ukrainian, Urdu, Vietnamese (Telex)\nQuickType keyboard support with predictive typingEnglish (Australia, Canada, India, Japan, Singapore, South Africa, UK, U.S.), Chinese (Simplified, Traditional), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian, Japanese, Korean, Spanish (Latin America, Mexico, Spain), Arabic, Arabic (Najdi), Cantonese (Traditional), Dutch, Hindi (Devanagari, Latin), Portuguese (Brazil, Portugal), Russian, Swedish, Thai, Turkish, Vietnamese, Hebrew, Polish, Romanian\nQuickType keyboard support with multilingual typingEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese – Simplified (Pinyin), Chinese – Traditional (Pinyin), French (France), French (Belgium), French (Canada), French (Switzerland), German (Germany), German (Austria), German (Switzerland), Italian, Japanese (Romaji), Portuguese (Brazil), Portuguese (Portugal), Spanish (Spain), Spanish (Latin America), Spanish (Mexico), Dutch (Belgium), Dutch (Netherlands), Hindi (Latin), Vietnamese, Polish, Romanian, Turkish\nQuickType keyboard support with contextual suggestionsEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese (Simplified), French (Belgium), French (Canada), French (France), French (Switzerland), German (Austria), German (Germany), German (Switzerland), Italian, Spanish (Latin America), Spanish (Mexico), Spanish (Spain), Arabic, Arabic (Najdi), Dutch (Belgium), Dutch (Netherlands), Hindi (Devanagari), Hindi (Latin), Russian, Swedish, Portuguese (Brazil), Turkish, Vietnamese\nQuickType keyboard support with QuickPathEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), Chinese (Simplified Pinyin QWERTY), Chinese (Traditional Pinyin QWERTY), French (Canada), French (France), French (Switzerland), German (Austria), German (Germany), German (Switzerland), Italian, Spanish (Latin America), Spanish (Mexico), Spanish (Spain), Portuguese (Brazil), Portuguese (Portugal), Dutch (Belgium), Dutch (Netherlands), Swedish, Vietnamese, Arabic, Hebrew, Korean, Polish, Romanian\nSiri languagesEnglish (Australia, Canada, India, Ireland, New Zealand, Singapore, South Africa, UK, U.S.), Spanish (Chile, Mexico, Spain, U.S.), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian (Italy, Switzerland), Japanese (Japan), Korean (Republic of Korea), Mandarin Chinese (China mainland, Taiwan), Cantonese (China mainland, Hong Kong), Arabic (Saudi Arabia, United Arab Emirates), Danish (Denmark), Dutch (Belgium, Netherlands), Finnish (Finland), Hebrew (Israel), Malay (Malaysia), Norwegian (Norway), Portuguese (Brazil), Russian (Russia), Swedish (Sweden), Thai (Thailand), Turkish (Türkiye)\nDictation languagesEnglish (Australia, Canada, India, Ireland, Malaysia, New Zealand, Philippines, Saudi Arabia, Singapore, South Africa, United Arab Emirates, UK, U.S.), Cantonese (China mainland, Hong Kong), Mandarin Chinese (China mainland, Taiwan), French (Belgium, Canada, France, Luxembourg, Switzerland), German (Austria, Germany, Switzerland), Italian (Italy, Switzerland), Japanese, Korean, Spanish (Chile, Colombia, Mexico, Spain, U.S.), Portuguese (Brazil, Portugal), Arabic (Kuwait, Qatar, Saudi Arabia, United Arab Emirates), Catalan, Croatian, Czech, Danish, Dutch (Belgium, Netherlands), Finnish, Greek, Hebrew, Hindi, Hungarian, Indonesian, Malay, Norwegian (Bokmål), Polish, Romanian, Russian, Shanghainese (China mainland), Slovak, Swedish, Thai, Turkish, Ukrainian, Vietnamese\nMonolingual dictionary supportEnglish (UK, U.S.), Chinese (Simplified, Traditional, Traditional – Hong Kong), Danish, Dutch, French, German, Hebrew, Hindi, Italian, Japanese, Korean, Norwegian, Portuguese, Russian, Spanish, Swedish, Thai, Turkish, Bulgarian, Catalan, Greek, Malay, Polish, Punjabi, Romanian\nIdiom dictionary supportSimplified Chinese, Traditional Chinese – English, Cantonese – English\nBilingual dictionary supportArabic – English, Bangla – English, Chinese (Simplified) – English, Chinese (Traditional) – English, Czech – English, Dutch – English, Finnish – English, French – English, French – German, German – English, Gujarati – English, Hindi – English, Hungarian – English, Indonesian – English, Italian – English, Japanese – English, Japanese – Chinese (Simplified), Korean – English, Polish – English, Portuguese – English, Russian – English, Spanish – English, Tamil – English, Telugu – English, Thai – English, Urdu – English, Vietnamese – English, English – Greek, English – Malay, English – Swedish\nSpell checkEnglish (Australia, Canada, India, Japan, New Zealand, Singapore, South Africa, UK, U.S.), French (Belgium, Canada, France, Switzerland), German (Austria, Germany, Switzerland), Italian, Spanish (Latin America, Mexico, Spain), Arabic, Arabic (Najdi), Bulgarian, Czech, Danish, Dutch (Netherlands, Belgium), Finnish, Greek, Hindi (Devanagari), Hungarian, Irish Gaelic, Norwegian (Bokmål, Nynorsk), Polish, Portuguese (Brazil, Portugal), Punjabi, Romanian, Russian, Swedish, Telugu, Turkish, Vietnamese\nApple Pay supported regionsArgentina, Armenia, Australia, Austria, Azerbaijan, Bahrain, Belarus, Belgium, Brazil, Bulgaria, Canada, Chile, China mainland,20 Colombia, Costa Rica, Croatia, Cyprus, Czech Republic, Denmark, El Salvador, Estonia, Faroe Islands, Finland, France, Georgia, Germany, Greece, Greenland, Guatemala, Guernsey, Honduras, Hong Kong, Hungary, Iceland, Ireland, Isle of Man, Israel, Italy, Japan, Jersey, Jordan, Kazakhstan, Kuwait, Latvia, Liechtenstein, Lithuania, Luxembourg, Macao, Malaysia, Malta, Mexico, Moldova, Monaco, Montenegro, Morocco, Netherlands, New Zealand, Norway, Palestine, Panama, Peru, Poland, Portugal, Qatar, Romania, San Marino, Saudi Arabia, Serbia, Singapore, Slovakia, Slovenia, South Africa, South Korea, Spain, Sweden, Switzerland, Taiwan, UK, Ukraine, United Arab Emirates, U.S., Vatican City, Vietnam\nUSB-C Charge Cable (1 m)\nProgress toward Apple’s 2030 carbon neutral goal\n23% recycled or renewable content22\n25% emissions reduction against baseline23\nOver 30% of manufacturing electricity is sourced from supplier clean energy projects24\n75% recycled aluminum in the enclosure\n100% recycled cobalt in the battery25 — a first for Apple\n100% recycled copper foil in the main logic board and — in a first for Apple — the MagSafe inductive charger\n100% recycled copper wire and 100% recycled tungsten in the Taptic Engine\n100% recycled gold in the wire of all cameras, the plating of multiple printed circuit boards, and the USB‑C connector\n100% recycled rare earth elements in all magnets, representing 100% of the rare earth elements in the device26\n100% recycled tin in the solder of multiple printed circuit boards\n35% or more recycled plastic in multiple components\nExceeds U.S. Department of Energy requirements for battery charger systems27\nMercury-, BFR-, PVC-, and beryllium-free\nNo established final assembly sites generate waste sent to landfill as part of Apple’s Zero Waste Program\nAll final assembly supplier sites are transitioning to 100% renewable energy for Apple production\n99% or more fiber-based packaging29\n100% of virgin wood fiber comes from responsibly managed forests30\nTrade in your eligible device for credit toward your next purchase, or get an Apple Gift Card you can use anytime.31 If your device isn’t eligible for credit, we’ll recycle it for free.\nWe’re committed to making our products without taking from the earth, and to become carbon neutral across our entire business, including products, by 2030.\nTrade in your smartphone for credit.\nWith Apple Trade In, you can get credit toward a new iPhone when you trade in an eligible smartphone.31 It’s good for you and the planet.\nStill have questions? Just ask.\nYou won’t find a better place to buy iPhone. We know about carriers, payment options, and more. And we make it easy to understand.",
    "favicon": ""
  },
  {
    "title": "Final Cut Pro transforms video creation with Live Multicam on iPad and new AI features on Mac",
    "link": "https://www.apple.com/newsroom/2024/05/final-cut-pro-transforms-video-creation-with-live-multicam-on-ipad-and-new-ai-features-on-mac/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVZlRGhIYURFNFdUZFlWRzA1VFJDLUFSaUtBaWdCTWdhZFFwaU5JUWs=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-07T07:00:00.000Z",
    "time": "May 7",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Original Films Formula 1® feature starring Brad Pitt to be released on June 27, 2025",
    "link": "https://www.apple.com/tv-pr/news/2024/06/apple-original-films-highly-anticipated-formula-1-feature-starring-brad-pitt-and-hailing-from-director-joseph-kosinski-to-be-released-globally-in-theaters-in-partnership-with-warner-bros-pictures-on-june-27-2025/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXVZazFPWkdwZlFYVlNhMWhJVFJDakFSaTJBaWdCTWdhaHRKS3N1UVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-17T07:00:00.000Z",
    "time": "Jun 17",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple empowers developers and fuels innovation with new tools and resources",
    "link": "https://www.apple.com/newsroom/2024/06/apple-empowers-developers-and-fuels-innovation-with-new-tools-and-resources/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUJVakl0Y0V4NFZYcExjazlTVFJDM0FSaVRBaWdCTWdhTlFZcEpxUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Vision Pro hands-on, again, for the first time",
    "link": "https://www.theverge.com/24040075/apple-vision-pro-hands-on-virtual-reality",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVhZbkJPZUd4aWVVRjFPVUpaVFJDaUFSaTNBaWdCTWdZOUE1d3pFUW8=-w400-h224-p-df-rw",
    "source": "The Verge",
    "datetime": "2024-01-16T08:00:00.000Z",
    "time": "Jan 16",
    "articleType": "regular",
    "content": "It’s a slushy, snowy day in New York City — the kind where I’d normally look out the window and declare a work-from-home day. But today, I hauled myself out into the wet cold because Apple had offered Nilay Patel and me demo time with the Apple Vision Pro.Nilay and a few others have already spent time with the Vision Pro, but for everyone else, the $3,499 Vision Pro has been shrouded in mystery. But my half-hour with it revealed that Apple’s headset felt more familiar than I thought it would. The iPhone face scan to select the correct light seal is very similar to setting up Face ID. Slipping it onto your head isn’t that different from any number of other VR headsets, like the Meta Quest line — the design and fabric headband are just more Apple-y. And like any other VR headset, you feel it sitting on your head and wrecking your hairdo once you slip it on. (If you’ve got long hair like me, you’ll feel it bunch up in the back, too.)You can see the shimmer on the OLED display that lets you know I’m not seeing you. Photo: AppleAfter the headset is situated, there’s a brief setup for eye tracking — look at various dots and tap your fingers together — and then visionOS drops you into the app launcher, which looks a lot like Launchpad on a Mac. The only difference is you can still see the room around you, if you so choose. On the upper right-hand side, there’s a digital crown — something I’m well acquainted with as an Apple Watch user. You use it to recenter your homescreen or immerse yourself in a virtual environment. The opposite side has a button for taking spatial photos and video. This, too, looks like the side button on an Apple Watch.As in previous demos, vision tracking was fast and accurate. Looking at a menu item or button immediately highlighted it. Movie titles highlighted in the Apple TV app as my eyes roved over them. Apple had us open the virtual keyboard in Safari to browse to a website, and it worked, albeit clunkily: you look at a letter and pinch your fingers to select it. You can type as fast as your eyes can move and fingers can pinch, which means it’s much easier to dictate to Siri.I had a little trouble with the pinch and double-pinch gestures at first because I was apparently holding the pinches too long when trying to select. It wasn’t until I was told to lightly tap and let go — the same action as double tap on the Apple Watch — that it all started to click.The demo we received was similar to what Nilay got to experience at WWDC, with a few additions here and there. Even so, reading about Nilay’s experience a few months ago and then actually getting to see it myself were two very different things. I’ve read how bonkers the screen is. But even knowing that, my eyes weren’t really prepared for two 4K screens blasting 23-micron pixels into each eyeball. I had to remind myself to blink lest my eyes dry out.The virtual world inside the Vision Pro feels like a higher-resolution version of what Meta is trying to accomplish with the Quest but with a vastly more powerful M2-based computer to use inside. It’s neat that I can throw an app over to my upper right so I can look up at the ceiling and view photos if I want. It’s fun to rip the tires off an AR Alfa Romeo F1 car in JigSpace. There is a certain novelty to opening up the Disney Plus app to watch a Star Wars trailer in a virtual environment that looks like Tatooine. I did, in fact, flinch when a T. rex made eye contact with me. A virtual environment of the Haleakalā volcano surprised me because the texture of the rocks looked quite lifelike. This is all familiar stuff. It’s just done well, and done with no lag whatsoever.Nilay, contemplating the Vision Pro. Photo: AppleApple had us bring some of our own spatial videos and panoramic photos to look at inside the Vision Pro, and the effect was convincing, although it works best when the camera is held still. Nilay had shot some spatial videos where he’d intentionally moved the camera to follow his kid around the zoo and felt some familiar VR motion queasiness. Apple says it’s doing everything it can to reduce that, but it’s clear some shots will work better in spatial than others — like any other camera system, really. We’ll have to keep playing with this outside of Apple’s carefully controlled environment to really figure out its limits.Apple keeps emphasizing that the Vision Pro isn’t meant to isolate you from the rest of the world, and the display on the front of the headset is designed to keep you connected to others. So we got to see a demo of EyeSight — what an onlooker would see on that front display when looking at someone wearing the Vision Pro. It’s a bit goofy, but you can see the wearer’s eyes, part of what Apple calls a “persona.” (We were not able to set up our own personas, sadly.) When Apple’s Vision Pro demo person blinked, we saw a virtual version of their eyes blink. When they were looking at an app, a bluish light appeared to indicate their attention was elsewhere. And when they went into a full virtual environment, the screen turned into an opaque shimmer. If you started talking to them while they were watching a movie, their virtual ghost eyes would appear before you. And when they took a spatial photo, you’d see the screen flash like a shutter. This is all well and good, but it’s strange to wear the headset and not actually know what’s happening on that front display — to not really have a sense of your appearance. And it’s even stranger that looking at people in the real world can cause them to appear, apparition-like, in the virtual world. The social cues of this thing are going to take a long while to sort out. Admittedly, it was all a whirlwind. I spent a half-hour like a kid gawping at an alien planet — even though I’d never left the couch. But by the end of my demo, I started to feel the weight of the headset bring me back to the real world. I’d been furrowing my brow, concentrating so hard, I felt the beginnings of a mild headache. That tension dissipated as soon as I took the headset off, but walking back out into Manhattan, I kept replaying the demo over in my head. I know what I just saw. I’m just still trying to see where it fits in the real world. Related:",
    "favicon": "/icons/favicon.ico"
  },
  {
    "title": "Five new games, including Ubisoft’s Rabbids: Legends of the Multiverse, arrive on Apple Arcade",
    "link": "https://www.apple.com/newsroom/2024/05/new-games-including-rabbids-legends-of-the-multiverse-arrive-on-apple-arcade/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUlha3BQUTJoT2FYSlNablpVVFJDb0FSaXNBaWdCTWdhWlk0cUxMUVU=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-06T07:00:00.000Z",
    "time": "May 6",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iPhone 15 and iPhone 15 Plus",
    "link": "https://www.apple.com/iphone-15/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTJXamRQUm5wRmRraHlVbVJGVFJDSUFSanlBaWdCTWdZcEZZck9uUVE=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T18:25:25.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "Get credit toward iPhone 15 when you trade in iPhone 11 or higher.Get credit toward iPhone 15 when you trade in iPhone 11 or higher.*\nClick and turn to explore iPhone.\nTap and turn to explore iPhone.\nDynamic Island. For when things just pop up.\nWhen something bubbles up, just touch and hold to act on it. Dynamic Island expands so you can find out when your dinner will arrive, rewind your podcast, or see if your AirPods have connected and their battery level.\nIf two activities are happening at once, Dynamic Island splits in two. So now you can chat with a friend and keep an eye on your timer. Or follow your team’s score while you check your running pace. Just touch and hold to expand one of the activities, or tap to open the app.\nAll kinds of activities. And expanding.\nDynamic Island can let you know if your flight is delayed, track your hike, and tell you when your workout will end. And new apps are added all the time, so it keeps getting more and more helpful.\nAirPods charging, Tide Guide, Flighty, Citymapper, CARROT Weather, Alarm, Active call.\nA display that shines in bright sunlight.\nThe Super Retina XDR display is up to twice as bright in the sun compared to iPhone 14, so you’ll really notice the difference. And a big boost in peak HDR brightness makes movies — and even the videos you take — more brilliant.\nUp to 2x peak outdoor brightness\nStandBy3 turns your iPhone into a new full-screen experience with glanceable information you can see from a distance. Just set it on its side while charging to display the time, showcase your favorite photos, or keep an eye on your widgets.\nDependably durable. The Ceramic Shield front is tougher than any smartphone glass.\nRemarkably resistant.iPhone is splash, water, and dust resistant.4What a relief.\nTruly tough.The aerospace-grade aluminum enclosure issuper strong and light.\nSuperfine metallic ions embed color into the glass — with a unique formulation for each color. Then the glass is polished with nanocrystalline particles and etched to create a textured matte finish.\nA design that feels just right.\nThe aerospace‑grade aluminum frame is highly durable, and the new contoured edges feel even better in your hand.\n75% recycled aluminum in the enclosure\nAll‑new 48MP Main camera. For breathtaking, smile-making picture taking.\nThree optical-quality zoom levels let you effortlessly frame the perfect shot from right where you are.\nChoose 2x Telephoto to zoom in for that perfect close‑up.\nChoose 1x for detailed middle‑distance shots.\nChoose 0.5x to capture way more of the scene with the Ultra Wide camera.\nNight mode automatically activates in especially dark scenes and now captures even richer color and sharper detail.\nWhen lighting is bright or uneven, the latest Smart HDR intelligently optimizes for both your subject and the background. So you get gorgeous color and even more true-to-life skin tones.\nA front camera auto​focused on you.\nThe TrueDepth camera automatically focuses on you and your friends, for spectacular selfies and supersharp FaceTime calls.\nVideos that deserve the most views.\nTake 4K HDR videos with amazing detail, color, and contrast. Use Action mode to steady a really shaky handheld shot. Or try 4K Cinematic mode to automatically shift the focus to the most important subject in a scene.\nUse Action mode for smooth handheld videos\nUse the optical-quality 2x Telephoto to zoom in and frame the perfect portrait from right where you are. Need to go closer still? Use continuous zoom to move in even more.\nThe new Photonic Engine supercharges your portraits. It combines the best pixels from a super‑high‑resolution image with another that’s optimized for light capture.So you get a 24MP image with twice the resolution. It’s perfect for everyday photos — at a file size small enough for storing and sharing.\nA16 Bionic powers all kinds of advanced features. Like computational photography used for 24MP photos and next-generation portraits. Voice Isolation for phone calls. And smooth performance for graphics-intensive games. All with incredible efficiency for great battery life. No wonder it started as a Pro chip.\nThe A16 Bionic GPU is up to 40% faster than the GPU in iPhone 12\nThe new USB-C connector lets you charge your Mac or iPad with the same cable you use to charge iPhone 15. You can even use iPhone 15 to charge Apple Watch or AirPods.6 Bye-bye, cable clutter.\nCharge up to 50% in around 30 minutes7 with the 20W USB-C Power Adapter. Or add a MagSafe Charger for fast, efficient wireless charging. (Both sold separately.)\nWant to find a friend in a crowded train station or busy park? Look no further than Precision Finding for Find My friends. It’s powered by the second‑generation Ultra Wideband chip,8 now with three times greater range, so it can lead you right to them.\nTo enable Precision Finding, friends with iPhone 15 Pro or iPhone 15 can share their location only with you using Find My. It’s simple — and private.\nConnect here, there, and everywhere.\neSIM simplifies traveling. Just activate an eSIM for the country you’re visiting before you go. Or when you arrive.9\n5G provides a superfast experience so you can make high-quality FaceTime calls, quickly download files, and play real-time multiplayer games on the go.10\nWi-Fi 6 is speedy. So you can stream movies at the highest resolutions. And make Wi-Fi calls without a hitch.\nIn an emergency,iPhone has your back.\nNew Roadside Assistance via satellite11 can get you help for things like a flat tire or dead battery, even when you’re off the grid.\niPhone also has Emergency SOS via satellite11 and Crash Detection12, two vital safety features that have helped save lives.\nIn an emergency,iPhone has your back.\nIf your car breaks down and you’re off the beaten path without cell service or Wi-Fi, you can still use iPhone to get help.11\nFirst, start a new text to Roadside Assistance and follow the easy onscreen steps to see how to connect — and stay connected — to a satellite. Then tap to answer a few key questions, like what model of car you have and what kind of help you need.\nOnce you reply, you’ll be connected with a AAA roadside assistance provider, who can send someone with the right equipment to help get you moving again. Don’t have a membership? No worries. It all works, even if you’re not a member.13\nRoadside Assistance via satellite is included for free for two years with iPhone 15\nIf you’ve tried calling 911 but don’t have cell service or Wi-Fi, you can use iPhone to text emergency services over satellite.11\nTo save time, iPhone front-loads important questions to assess your situation. Just tap to respond. Then iPhone will show you where to point your phone to stay connected and avoid obstructions like mountains.\nRemember, it can take from 15 seconds to more than a minute to get through depending on conditions.\niPhone can detect a severe car crash and call for help if you can’t.12\nHardware sensors and advanced motion algorithms identify signs of a crash, like sudden shifts in speed and direction, or changes in cabin pressure caused by deploying airbags.\nThen iPhone can call 911 and notify your emergency contacts.\nOver 1 million hours of real-world driving and crash data helps iPhone recognize accidents.\nDesigned to make a difference.\nWhat matters to you matters to Apple, too. From privacy protections that give you more control over your data. To using more recycled materials that minimize environmental impact. To creating built-in features that make iPhone accessible to all.\nThe enclosure of iPhone 15 has 75% recycled aluminum\nThe Health app makes it easy for you to access your health and fitness information — and securely share access with apps, relatives, and doctors.\nPasskeys eliminate the need for passwords on apps and websites by using unique digital keys. Just use Touch ID or Face ID to authenticate. Simple and secure.\nSafari Enhanced Private Browsing locks browsing windows when they’re not being used, blocks known trackers from loading, and removes tracking URLs.\nBig steps toward a smaller footprint.\niPhone 15 contains more recycled materials than ever:\n100 percent recycled cobalt in the battery14\n100 percent recycled copper foil in the MagSafe inductive charger\nNow 99 percent of iPhone packaging is fiber based,15 with 100 percent recycled or responsibly sourced wood fibers.16 And there’s still no plastic wrap around the box.\nOur stores, offices, and data centers are already carbon neutral. By 2030, our products — and your carbon footprint from using them — will be, too.\nIf you’re at risk of losing your ability to speak, Personal Voice lets you create a voice that sounds like you, so you can communicate with it using Live Speech for calls and conversations.\nAssistive Access helps users with cognitive disabilities tailor apps and experiences. For example, Messages can offer visual communication tools, like video messages, and the Home Screen can emphasize large text and icons.\nVoiceOver is a screen reader that tells people who are blind or have low vision exactly what’s happening on iPhone. It can describe friends, objects, text, photos, and even graphs in great detail.\nStyle it out. Swap it over. Sticker it up.\nContact Poster. Create your own poster that contacts will see when you call. Pick a favorite pic or Memoji, pair it with a favorite font, and there you have it — your very own calling card.\nNameDrop. Want to swap contact info with someone? Just bring your iPhone close to theirs. You can both choose what you want to share, and the information transfers instantly.\nLive Stickers. Touch and hold an object in a photo to lift it from the background and create a sticker. Add effects like Puffy and Shiny. Or create animated stickers from Live Photos.\nMisplaced your iPhone? The latest Apple Watch models can show you its approximate distance and direction.17 To set up a group photo on your iPhone, join the group and use Apple Watch as a viewfinder to snap the shot. And, when you take a call on your Apple Watch, just tap your iPhone to continue the conversation there.\nYou can answer calls or messages from your iPhone directly on your Mac. Copy images, video, or text from your iPhone, then paste into another app on your nearby Mac. And with iCloud, you can access your favorite files from either your iPhone or Mac.\nSet up AirPods on iPhone with just a tap. You’ll love Adaptive Audio, which automatically tailors the noise control to provide the best listening experience across different environments and interactions throughout the day.\nA16 Bionic chip with 5-core GPU\n48MP Main camera 2x TelephotoUltra Wide camera\nUp to 26 hours video playback20\nOur most advanced 48MP Main camera 3x or 5x Telephoto cameraUltra Wide camera\nUp to 29 hours video playback20",
    "favicon": ""
  },
  {
    "title": "Apple Music celebrates the greatest records ever made with the launch of inaugural 100 Best Albums list",
    "link": "https://www.apple.com/newsroom/2024/05/apple-music-celebrates-the-launch-of-inaugural-100-best-albums-list/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUJWVWhhWlU1V2JXTjBSaTFxVFJDb0FSaXNBaWdCTWdhaGRKQ3NyUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-13T07:00:00.000Z",
    "time": "May 13",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "macOS Sonoma is available today",
    "link": "https://www.apple.com/newsroom/2023/09/macos-sonoma-is-available-today/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNVJRVjlEZDNwQk0wMWFUME5oVFJDeEFSaWNBaWdCTWdrTllvcU1xZWVwY0FF=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-26T07:00:00.000Z",
    "time": "Sep 26, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple introduces spatial video capture on iPhone 15 Pro",
    "link": "https://www.apple.com/newsroom/2023/12/apple-introduces-spatial-video-capture-on-iphone-15-pro/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVdUMk5wVkdwMk4xRlJNRTVZVFJDb0FSaXNBaWdCTWdhWmdJcXBMUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-12-11T08:00:00.000Z",
    "time": "Dec 11, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple spotlights the top apps and games of 2023 on the App Store",
    "link": "https://www.apple.com/newsroom/2023/12/apple-spotlights-the-top-apps-and-games-of-2023-on-the-app-store/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWlhREpVUVhwV2QyNXRNVmhCVFJDakFSaTJBaWdCTWdhcGhaRE9zUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-12-12T08:00:00.000Z",
    "time": "Dec 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "visionOS 2 brings new spatial computing experiences to Apple Vision Pro",
    "link": "https://www.apple.com/newsroom/2024/06/visionos-2-brings-new-spatial-computing-experiences-to-apple-vision-pro/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDJUV1ZtVkhCMmFGUlFZV2h1VFJDb0FSaXNBaWdCTWdhcEpZYnRsUWM=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "I Can't Stop Thinking About How Awkward Apple's 'Mother Nature' Ad Was, and I Finally Figured Out Why",
    "link": "https://www.inc.com/jason-aten/i-cant-stop-thinking-about-how-awkward-apples-mother-nature-ad-was-i-finally-figured-out-why.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUNNbkEwT0MxMmRrSnVMVlJEVFJDb0FSaXJBaWdCTWdZZFY1WXFKZ2c=-w400-h224-p-df-rw",
    "source": "Inc.",
    "datetime": "2023-09-17T07:00:00.000Z",
    "time": "Sep 17, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Watch double tap gesture now available with watchOS 10.1",
    "link": "https://www.apple.com/newsroom/2023/10/apple-watch-double-tap-gesture-now-available-with-watchos-10-1/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUVXVEJxUmxGalp6UTBURXhQVFJDb0FSaXNBaWdCTWdhUlVaS29LZ2s=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-10-25T07:00:00.000Z",
    "time": "Oct 25, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Exclusive: Apple to pause advertising on X after Musk backs antisemitic post",
    "link": "https://www.axios.com/2023/11/17/apple-twitter-x-advertising-elon-musk-antisemitism-ads",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXVWbnBIZGkxUFdUSTJPV2t4VFJDb0FSaXNBaWdCTWdiQlFwWXlKUWc=-w400-h224-p-df-rw",
    "source": "Axios",
    "datetime": "2023-11-17T08:00:00.000Z",
    "time": "Nov 17, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple extends its privacy leadership with new updates across its platforms",
    "link": "https://www.apple.com/newsroom/2024/06/apple-extends-its-privacy-leadership-with-new-updates-across-its-platforms/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHlNMVZ5ZGxscVMxbHFNR0pRVFJDM0FSaVRBaWdCTWdhcE5ZN05IUWc=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "iPhone - Why Upgrade",
    "link": "https://www.apple.com/iphone/why-upgrade/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUhkWFpZUzBSa1REVkRZMlp5VFJDbkFSaXRBaWdCTWdZQlVZeTJOQVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-03-25T18:17:35.000Z",
    "time": "Mar 25",
    "articleType": "regular",
    "content": "Your iPhone vs. the latest. See what you’re missing.\nGet up to  in credit whenyou trade in iPhone 11.1Get up to  in credit whenyou trade in iPhone 11 Pro.1Get up to  in credit whenyou trade in iPhone 11 Pro Max.1Get up to  in credit whenyou trade in iPhone 12.1Get up to  in credit whenyou trade in iPhone 12 mini.1Get up to  in credit whenyou trade in iPhone 12 Pro.1Get up to  in credit whenyou trade in iPhone 12 Pro Max.1\niPhone 15 captures up toiPhone 15 Plus captures up toiPhone 15 Pro captures up toiPhone 15 Pro Max captures up to\n4x the resolution of iPhone 114x the resolution of iPhone 11 Pro4x the resolution of iPhone 11 Pro Max4x the resolution of iPhone 124x the resolution of iPhone 12 mini4x the resolution of iPhone 12 Pro4x the resolution of iPhone 12 Pro Max\nfor a new level of detail and color.\nSave way more shots with 2x2x2x4x more storage than iPhone 11.2Save way more shots with 2x2x2x4x more storage than iPhone 11 Pro.2Save way more shots with 2x2x2x4x more storage than iPhone 11 Pro Max.2Save way more shots with 2x4x more storage than iPhone 12.2Save way more shots with 2x2x2x4x more storage than iPhone 12 mini.2iPhone 15 gives you great storage space to save photos.iPhone 15 Plus gives you great storage space to save photos.Save way more shots with up to 1TB of storage on iPhone 15 Pro.2Save way more shots with 2x more storage than iPhone 12 Pro.2iPhone 15 gives you great storage space to save photos.iPhone 15 Plus gives you great storage space to save photos.Save way more shots with up to 1TB of storage on iPhone 15 Pro.2Save way more shots with 2x more storage than iPhone 12 Pro Max.2\nGet more room to zoom with a 2x Telephoto. It’s like having a third camera.iPhone 15 captures supersharp close‑ups with an even better camera than iPhone 11 Pro.iPhone 11 Pro Max.iPhone 12 Pro.iPhone 15 captures supersharp close‑ups with three zoom options for framing flexibility.Get more room to zoom with a 2x Telephoto.It’s like having a third camera.iPhone 15 Plus captures supersharp close‑ups with an even better camera than iPhone 11 Pro.iPhone 15 Plus captures supersharp close‑ups with an even better camera than iPhone 11 Pro Max.iPhone 15 Plus captures supersharp close‑ups, with an even better camera than iPhone 12 Pro.iPhone 15 Plus captures supersharp close‑ups with three zoom options for framing flexibility.Get more room to zoom with 2x and 3x Telephoto options for more framing flexibility.Get more room to zoom with a 3x Telephoto camerafor added framing flexibility.Get more room to zoom with 2x and 3x Telephoto options for more framing flexibility.\nGet more room to zoom with 2x and 5x Telephoto options for more framing flexibility that gets you incredibly close.Get more room to zoom with a 5x Telephoto camera,for framing flexibility that gets you incredibly close.Get more room to zoom with a 5x Telephoto camera,for framing flexibility that gets you incredibly close.Get more room to zoom with a 5x Telephoto camera, for framing flexibility that gets you incredibly close. Get more room to zoom with a 5x Telephoto camera, for framing flexibility that gets you incredibly close. Get more room to zoom with 2x and 5x Telephoto options for framing flexibility that gets you incredibly close.\nWant closer close‑ups? Go for iPhone 15 Pro, which adds a 3x Telephoto camera.Want more framing flexibility? Go for iPhone 15 Pro, which adds a 3x Telephoto camera.Want more framing options? Go for iPhone 15 Pro, which adds a 3x Telephoto camera.Want closer close‑ups? Go for iPhone 15 Pro, which adds a 3x Telephoto camera.Want closer close‑ups? Go for iPhone 15 Pro, which adds a 3x Telephoto camera.Want more framing flexibility? Go for iPhone 15 Pro, which adds a 3x Telephoto camera.Want more framing options? Go for iPhone 15 Pro, which adds a 3x Telephoto camera.Want closer close‑ups? Go for iPhone 15 Pro Max with a 5x Telephoto camera.\nIf your subject is a person, dog, or cat, iPhone 15 lets you\nquickly capture the shot and turn it into a portrait later.\nIf your subject is a person, dog, or cat, iPhone 15 Plus lets you\nquickly capture the shot and turn it into a portrait later.\nIf your subject is a person, dog, or cat, iPhone 15 Pro lets you\nquickly capture the shot and turn it into a portrait later.\nIf your subject is a person, dog, or cat, iPhone 15 Pro Max lets you\nquickly capture the shot and turn it into a portrait later.\nWhen you’re shooting video on the go, use Action mode to steady really shaky handheld shots.When you’re shooting video on the go, use Action mode to steady really shaky handheld shots.When you’re shooting video on the go, use Action mode to steady really shaky handheld shots.When you’re shooting video on the go, use Action mode to steady really shaky handheld shots.\nMake movies like the movies with Cinematic mode,  which automatically shifts the focus to the most important subject in a scene.Make movies like the movies with Cinematic mode,  which automatically shifts the focus to the most important subject in a scene.Make movies like the movies with Cinematic mode,  which automatically shifts the focus to the most important subject in a scene.Make movies like the movies with Cinematic mode,  which automatically shifts the focus to the most important subject in a scene.\nTake your videosto the next level with 4K Dolby Vision for more detail, color, and contrast.Take your videosto the next level with 4K Dolby Vision at 60 fps for more detail, color, and contrast.Take videos with great detail, color, and contrastthanks to 4K Dolby Vision at 60 fps.Take videos with great detail, color, and contrastthanks to 4K Dolby Vision at 60 fps.Take your videosto the next level with 4K Dolby Vision for more detail, color, and contrast.Take your videosto the next level with 4K Dolby Vision at 60 fps for more detail, color, and contrast.Take videos with great detail, color, and contrastthanks to 4K Dolby Vision at 60 fps.Take videos with great detail, color, and contrastthanks to 4K Dolby Vision at 60 fps.iPhone 15 Pro takes your videos to the next level with 4K Dolby Vision, which delivers beautiful detail, color, and contrast.Take your videosto the next level with 4K Dolby Vision at 60 fps for more detail, color, and contrast.Take your videosto the next levelwith ProRes recording up to 4K at 60 fps.Take videos with great detail, color, and contrastthanks to 4K Dolby Vision at 60 fps.iPhone 15 Pro Max takes your videos to the next level with 4K Dolby Vision, which delivers beautiful detail, color, and contrast.Take your videosto the next level with 4K Dolby Vision at 60 fps for more detail, color, and contrast.Take your videosto the next levelwith ProRes recording up to 4K at 60 fps.Take videos with great detail, color, and contrastthanks to 4K Dolby Vision at 60 fps.\nUSB-C means you can charge your Mac, iPad, or PC with the same cable as iPhone 15.USB-C means you can charge your Mac, iPad, or PC with the same cable as iPhone 15 Plus.USB-C lets you charge your Mac, iPad, or PC with the same cable as iPhone 15 Pro and get up to 20x faster file transfers.USB-C lets you charge your Mac, iPad, or PC with the same cable as iPhone 15 Pro Max and get up to 20x faster file transfers.\nThe A16 Bionic chip hasThe A16 Bionic chip hasThe A17 Pro chip hasThe A17 Pro chip has\na GPU that’s up to 60%2x faster than the GPU in A13 Bionic.a GPU that’s up to 60%2x faster than the GPU in A13 Bionic.a GPU that’s up to 60%2x faster than the GPU in A13 Bionic.a GPU that’s up to 40%70% faster than the GPU in A14 Bionic.a GPU that’s up to 40%70% faster than the GPU in A14 Bionic.a GPU that’s up to 40%70% faster than the GPU in A14 Bionic.a GPU that’s up to 40%70% faster than the GPU in A14 Bionic.\nHonkai: Star RailHonkai: Star RailDEATH STRANDING DIRECTOR’S CUTDEATH STRANDING DIRECTOR’S CUT\nLonger battery life lets you watch up to 3233533 more hours of video  Even though iPhone 15 is packed with so many advanced features, you get great all-day battery life.3Longer battery life lets youwatch up to 98691196 more hours of videoLonger battery life lets you watch up to 6536863 more hours of videoLonger battery life lets you watch up to 121191214129 more hours of video\nthan iPhone 11.3than iPhone 11 Pro.3than iPhone 11 Pro Max.3than iPhone 12.3than iPhone 12 mini.3than iPhone 12 Pro.3than iPhone 12 Pro Max.3\nWant even longer battery life? Go for iPhone 15 Pro Max, which lets you watch up to 9 more hours of video than iPhone 11 Pro Max.Want even longer battery life? Go for iPhone 15 Pro Max, which lets you watch up to 9 more hours of video than iPhone 12 Pro Max.\niPhone 15 gives you Dynamic Island, which bubbles up your flight status, music, and more so you don’t miss anything. It expands to get your attention — hey, your ride is here! — then tucks away again.iPhone 15 Plus gives you Dynamic Island, which bubbles up your flight status, music, and more so you don’t miss anything. It expands to get your attention — hey, your ride is here! — then tucks away again.iPhone 15 Pro gives you Dynamic Island, which bubbles up your flight status, music, and more so you don’t miss anything. It expands to get your attention — hey, your ride is here! — then tucks away again.iPhone 15 Pro Max gives you Dynamic Island, which bubbles up your flight status, music, and more so you don’t miss anything. It expands to get your attention — hey, your ride is here! — then tucks away again.\nWhoa, drop performance is 4x better thanks to a durable design and a Ceramic Shield front that’s tougher than any smartphone glass. iPhone 15 is more water resistant, too.5iPhone 15 is built to last,thanks to a durable design with an aerospace-grade aluminum enclosure and a Ceramic Shield front that’s tougher than any smartphone glass.Whoa, drop performance is 4x better thanks to a durable design and a Ceramic Shield front that’s tougher than any smartphone glass. iPhone 15 Plus is more water resistant, too.5iPhone 15 Plus is  built to last,thanks to a durable design with an aerospace-grade aluminum enclosure and a Ceramic Shield front that’s tougher than any smartphone glass.Whoa, drop performance is 4x better thanks to a durable design and a Ceramic Shield front. iPhone 15 Pro also has the toughest back glass in a smartphone.iPhone 15 Pro is the first iPhone to feature a durable, aerospace-grade titanium design, making theseour lightest Pro models yet.Whoa, drop performance is 4x better thanks to a durable design and a Ceramic Shield front. iPhone 15 Pro Max also has the toughest back glass in a smartphone.iPhone 15 Pro Max is the first iPhone to feature a durable, aerospace-grade titanium design, making theseour lightest Pro models yet.\nOLED display with ProMotion and Always‑On technology\nOLED display with ProMotion and Always‑On technology\nOn your new iPhone, your apps and data will look and feel the same — automatically.On your new iPhone, your apps and data will look and feel the same — automatically.On your new iPhone, your apps and data will look and feel the same — automatically.On your new iPhone, your apps and data will look and feel the same — automatically.On your new iPhone, your apps and data will look and feel the same — automatically.On your new iPhone, your apps and data will look and feel the same — automatically.On your new iPhone, your apps and data will look and feel the same — automatically.\nWith Quick Start, your photos, messages, contacts, and more transfer seamlessly, so you can pick up where you left off.\nYou get free, temporary iCloud storage to transfer your data to your new iPhone.\nIt’s easy to activate your cellular plan with eSIM — just follow the prompts during setup.7\nWe make it easy and secure to erase the personal information from your current iPhone.\nAt any point you can get help from an Apple Specialist, either online or in store.",
    "favicon": ""
  },
  {
    "title": "iPadOS 18 introduces powerful new intelligence features and apps designed for Apple Pencil",
    "link": "https://www.apple.com/newsroom/2024/06/ipados-18-introduces-powerful-intelligence-features-and-apps-for-apple-pencil/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDRWSE54TTJJMlIxQlJiRnBoVFJDM0FSaVRBaWdCTWdZTllvNUh0Z1U=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Jing’an now open in Shanghai",
    "link": "https://www.apple.com/newsroom/2024/03/apple-jingan-now-open-in-shanghai/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWpiRTFhWVUxRVVGRk1NM0ZUVFJDb0FSaXNBaWdCTWdhQmNKQ05zUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-03-21T07:00:00.000Z",
    "time": "Mar 21",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Explores A.I. Deals With News Publishers",
    "link": "https://www.nytimes.com/2023/12/22/technology/apple-ai-news-publishers.html",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNHdPVkJSYkRNM2IwMXlUazlJVFJDM0FSaVRBaWdCTWdrRmdZQ01MYVZ6dHdB=-w400-h224-p-df-rw",
    "source": "The New York Times",
    "datetime": "2023-12-22T08:00:00.000Z",
    "time": "Dec 22, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "The Apple Vision Pro",
    "link": "https://stratechery.com/2024/the-apple-vision-pro/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWhSSE5MV1ZGYVRqbHJhVlJZVFJDb0FSaXNBaWdCTWdZZG9ZNktPUVk=-w400-h224-p-df-rw",
    "source": "Stratechery by Ben Thompson",
    "datetime": "2024-02-06T08:00:00.000Z",
    "time": "Feb 6",
    "articleType": "regular",
    "content": "No wireless. Less space than a nomad. Lame.\nMy one small comfort in the cold Wisconsin winters, walking up and down Bascom Hill in the snow at the University of Wisconsin-Madison, was listening to music on my Diamond Rio.\nThat Rio served me well all through college; Apple shipped the first iPod my senior year, but it was Mac only, and besides, my Rio was good enough. Sure, I could only fit 20 songs or so (of course I bought the proprietary expansion memory card), but if I wanted more I could just sync with my computer. I certainly wasn’t going to pay $2,000 or whatever it cost to get a Mac and an iPod to have “1,000 songs in [my] pocket”.\nTwo years after graduation I was in Taiwan and smitten with the recently released GarageBand, which led to my first Mac, and, not too long after, my first iPod. I can’t believe that I lived any other way!\nI did, like the nerd that I am, experiment with using my iPod as a hard drive, but even with the addition of video capabilities and basic games it was exactly what it promised to be: the best possible way to listen to music on the go. That clarity was part of its allure: Apple had brilliantly paired the iPod with iTunes, offloading advanced playlist capabilities and library management to the computer, letting the iPod do what it did best.\nIt’s hard to imagine, now, but at the time the iPod era seemed to go from height to height, anchored by standalone Apple launch events for new models and iterations, complete with appearances from famous artists. In fact, though, it was only five-and-a-half years before the iPod gave way to the iPhone: yes, Apple still sold standalone music players for a few more years, but one’s pocket only had room for so many devices, and the iPhone was not just an iPod but also a cellular phone and Internet communicator (whatever that was):\nThis little trip down memory lane offers one way to understand Apple’s latest product launch: one way to think about the Vision Pro is that it is the iPod to the iPad’s Diamond Rio. One of the realities of the iPad is that, for most customers, it is a personal video player; for that particular use case the Apple Vision is superior in nearly every way. At the same time, the tragedy of the iPad is that outside of pen-based artistic use cases it is not particularly compelling as a computer. That, for now, is also the story of the Apple Vision Pro; the question is if there is an iPhone-esque obsoletion opportunity in its future.\nIt is, admittedly, a bit early for me to be writing an Apple Vision Pro review: I only received it 36 hours ago, and my original plan was to use it for work on an upcoming trip, and only then give my thoughts. It quickly became apparent, though, that that would not be necessary, or desirable, for reasons I will lay out below. Plus, I wasn’t coming in blind: I tried the Vision Pro last year at WWDC, and was blown away. From the introduction of Apple Vision:\nIt really is one of the best product names in Apple history: Vision is a description of a product, it is an aspiration for a use case, and it is a critique on the sort of society we are building, behind Apple’s leadership more than anyone else.\nI am speaking, of course, about Apple’s new mixed reality headset that was announced at yesterday’s WWDC, with a planned ship date of early 2024, and a price of $3,499. I had the good fortune of using an Apple Vision Pro in the context of a controlled demo — which is an important grain of salt, to be sure — and I found the experience extraordinary.\nIt’s far better than I expected, and I had high expectations.\n— Ben Thompson (@benthompson) June 6, 2023\nThe high expectations came from the fact that not only was this product being built by Apple, the undisputed best hardware maker in the world, but also because I am, unlike many, relatively optimistic about VR. What surprised me is that Apple exceeded my expectations on both counts: the hardware and experience were better than I thought possible, and the potential for Vision is larger than I anticipated. The societal impacts, though, are much more complicated.\nI’m glad I put that caveat about the “controlled demo” in there. What I realize now, after using the Vision Pro as I pleased, is that almost every part of the demo was focused on one particular app or immersive experience: you became, without realizing it, the sort of person who only ever looks at one app full screen on your computer at all times. When you want to use another app, switch to that app, which itself takes over the full screen.\nThis is, of course, how iOS was designed for the iPhone, and while iOS has been scaled up to iPadOS and visionOS, the former is a shining example of how difficult it is to take a one-app UI and make it multi-window. Apple has iterated on multi-window capacity on the iPad for years, and it is still so janky that I mostly only invoke it by accident.1 Part of the problem is hardware: there just isn’t that much screen real estate, even on the largest iPad, and the limitation of only using touch controls means that the operating system has to rely on undiscoverable gestures.\nvisionOS suffers from a similar combination of shortcomings. First off, the user interface is exceptionally difficult to manage once you have multiple windows on the screen, particularly when windows are arranged on the z-axis (i.e. nearer or closer to you in 3-D space); one gets the sense that the usability of iOS-based operating systems are inversely correlated to their screen size. Second, while the eye tracking is an incredible feat of engineering, it is not nearly as precise as it needs to be for productive window management.\nThe biggest limitation, though, is hardware: the Vision Pro field of view is very narrow, in a way I didn’t fully appreciate while only using one app in that demo (Apple hasn’t reported the number, but it is noticeably narrower than the Quest 3’s 110°). This becomes immediately apparent when you have more than two or so apps open: if you want room for more, without encountering the z-axis issues I noted above, you better get ready to physically move your head or body (this is exacerbated by the fact that Vision Pro apps are very large, even if you have chosen the “small” preference; I would like them to be half the size they present as).\nThe net result is that the Vision Pro, at least in its current incarnation, does not come close to being the productivity tool I was so excited about last summer, when I wrote that I suspected the Vision Pro was “the future of the Mac”, and that’s even before getting to the limitations of Apple’s iOS-based operating system in terms of app capabilities and business models. That latter point, along with the limitations of eye-tracking as a default user-interface model, also makes me worry that new and better hardware won’t change this reality.\nI did walk back my “future of the Mac” prediction in a follow-up to that Article.\nI wrote in the productivity section of yesterday’s Article, “To put it even more strongly, the Vision Pro is, I suspect, the future of the Mac.” I’m kind of irritated at myself for not making one critical observation: the Vision Pro is the future of the Mac if Apple makes software choices that allow it to be.\nI’m mostly referring to the Mac’s dramatically larger degree of openness relative to other platforms like iPadOS: so many of the capabilities of a Mac are not because of its input method, but because applications and users have far fewer constraints on what they can do, and it will be difficult to replace the Mac if the same constraints that exist in iPadOS exist in visionOS.\nFrankly, I’m dubious Apple will allow that freedom, and I should have tempered my statement because of that. I do think that visionOS is much more compelling for productivity than the iPad is, thanks to the infinite canvas it enables, but if you have to jump through the same sort of hoops to get stuff done that you do with the iPad, well, that ability to project a Mac screen into the Vision Pro is going to be essential.\nUnfortunately, I find this capability underwhelming: right now you can project one 4K screen into the Vision Pro, which is roughly equivalent to my 16″ MacBook Pro screen. You can augment that screen with Vision Pro apps, but I find the experience unworkable for two reasons: first, the field of view limitation means it is very difficult to even see, much less manage, multiple apps, particularly if the Mac projection is blown up to a useful size; and second, while you can use your keyboard and trackpad (but not mouse) for Vision Pro apps, the mismatch in expected interaction models creates a mental burden that is difficult to dispel. This could get better with time, but the experience was underwhelming enough that I’m not particularly motivated to find out.\nAt the end of the day, my calculation is thus: at my desk I have four monitors.2\nThis is drastically more powerful and capable than anything I could achieve on the Vision Pro; my dream would be to have a similar experience away from my desk, but the limited utility in practice doesn’t make it worth carrying around a Vision Pro when my computer has a perfectly fine screen to get work done (the one big exception would be something like an economy class airline seat, where it is not only difficult to open one’s computer, but also uncomfortable to know that your seat mate can look over your shoulder; more on this privacy aspect in a bit).\nThat noted, this capability might get better soon; in that Update I highlighted this detail in the macOS Sonoma release notes about Apple’s new high-performance screen-sharing:\nA High Performance connection requires a network that supports at least 75Mbps for one 4K virtual display and at least 150Mbps for two 4K virtual displays. Low network latency is also required for responsiveness.\nI have heard through the grapevine that Vision Pro users at Apple headquarters can project two Mac screens, which to me would make a massive difference in the Vision Pro’s utility: having two 4K displays for my Mac anywhere I go would absolutely make me more productive, and make it worth carrying the Vision Pro. Indeed, my question then would be, “Why do I have to carry my entire MacBook?”\nThis leads to one more curious discovery:\nThat’s not a lightning port: it has 12 pins instead of 8, which seems like overkill for simply conducting power. And, to be clear, that’s 12 pins per side, which is the same as a USB-C connector. Two of the pins in USB-C are reserved for a communications channel so two devices can negotiate the orientation of each end of a cable, making the other 22 pins all usable, and enabling protocols like DisplayPort or Thunderbolt. The latter has more than sufficient bandwidth to move compute to the end of that cable — could there be a battery alternative that is nothing more than a keyboard with a Mac built-in, enabling a truly portable computing experience that rivals my desktop setup?\nThis is hugely speculative, to be sure, but I suspect it is our best hope for Mac-like capabilities in a Vision Pro device: I just don’t think visionOS will ever be up to the job, no matter how much it evolves, because there are certain areas where Apple itself will not.\nHere is the key thing to understand about all of the Vision Pro limitations I just articulated: they are not faults, but rather trade-offs, in the service of delivering a truly extraordinary entertainment experience.\nStart with the hardware: contrary to most reviews, I didn’t find the Vision Pro uncomfortable, even with extended use. For me the Solo Knit band hugged the back of my head in a very pleasing way, such that I didn’t notice the weight of the device. What was striking to me was how frictionless it is to put the Vision Pro on, and you’re ready to go.\nA big reason for this is the lack of controllers: while I was frustrated in “productivity mode” at the lack of direct manipulation that you get with, say, the Quest’s controllers, the ability to simply use my eyes3 and hands means that the distance from putting on the Vision Pro to watching a movie or TV show is surprisingly small. And, of course, a movie or TV show is a single app experience: here the trade-off for higher resolution screens at the cost of a narrower field of view is well worth it.\nOne challenge is the inability to use your phone. Now that may be, for some, an advantage (he says as he sheepishly admits to a phone-addled attention span): one of my favorite things about going to the theater is the fact that I’m much less tempted to even think about checking my notifications. That said, while passthrough is a technical marvel, and a massive differentiator over the Quest, you are still looking through a video screen, and that is never more apparent than when trying to read another screen: you can, if you squint, but it’s not particularly pleasant. There is already an app in the App Store that broadcasts your phone screen into the Vision Pro; here is a screenshot with me watching the new Sharp Tech YouTube channel:\nWhat I would like to see, though, is Apple drawing the iPhone screen in the Vision Pro onto the iPhone in your hand, which would make it much easier to interact with.\nThat aside, you’re really not going to think much about your phone once you are watching something: obviously the 3D experiences are incredible, and I can’t wait for sports to be filmed using Apple’s specialty cameras.4 Even just having multiple games on at once, though, is a lot of fun, and movies are extremely immersive. My wife’s response summed up the experience perfectly: “Why would I ever go to a movie theater again?”\nWhat is remarkable is that this stellar experience can be had anywhere: I might have to pick and choose between office and portable productivity, but there is no compromise when it comes to personal entertainment. The best device is the same device no matter where you are. This is what I mean when I say the Vision Pro is to the iPad as the iPod was to the Rio: the increase in fidelity and the overall experience is so vast as to constitute a step-change in functionality.\nThis is also where being private isn’t such a bad thing; there is a reason why Apple already has an ad about using the Vision Pro on an airplane:\nThis is a killer articulation of the fact that isolation is sometimes exactly what you need, even if it suffers from the tech industry affliction of assuming everyone flies regularly. Om Malik, in a recent Stratechery Interview, gave another compelling use case (and started me down the path of thinking about the iPod analogy):\nBut the thing is you actually have to be mobile-native to actually appreciate something like this. So if you’ve grown up watching a 75-inch screen television, you probably would not really appreciate it as much. But if you are like me who’s been watching iPad for ten-plus years as my main video consumption device, this is the obvious next step. If you live in Asia, like you live in Taiwan, people don’t have big homes, they don’t have 85-inch screen televisions. Plus, you have six, seven, eight people living in the same house, they don’t get screen time to watch things so they watch everything on their phone. I think you see that behavior and you see this is going to be the iPod. The headphones, why is headphones selling all the time everywhere? It is because people want their moment of privacy and they want to be alone and they want to listen to their media in their way. I think that’s what Vision Pro excites me is it’s going to be a video consumption device.\nThis does resonate with me, both in theory and in practice: even while trying to figure out the productivity use case I relished the fact that those sitting near me couldn’t see me futzing about. To put it another way, isolation is just another word for privacy, and privacy is very nice to have.\nThere is, though, one problem with both of these examples: folks living in close proximity to others, or even flying in the back of a plane, may not have the wherewithal to spend $3,500 on a personal TV. Those that do are probably more likely to have a traditional home theater or fly in seats with a bit more privacy. That, though, is only a problem for now (and, I might note, a real opportunity for Meta’s significantly lower-priced Quest).\nFor me this will be my primary Vision Pro use case, if one exists. When I watch TV it is usually after my kids are asleep, and simply slipping the Vision Pro on on the couch and relaxing is very pleasant and more convenient than getting my AirPods and pairing them to the Apple TV connected to my very-much-not-a-home-theater TV. The couch use case also diminishes another big Vision Pro negative: the battery and its associated cord is very annoying and will, I suspect, lead to broken Vision Pros yanked down by a battery in someone’s pocket. This sort of moving around is also, I would note, much more common when you’re trying to be productive; the Vision Pro really isn’t built for that, quite literally. Maybe someday, but V1s have to make trade-offs, and Apple has, in every respect, optimized for the entertainment experience.\nMy favorite Vision Pro review isn’t really a review at all: it’s Casey Neistat in, his ever entertaining way, reaching out to pull the future back to the present:\nI’ve focused till now on productivity (the use case I’m most excited about, which the Vision Pro does not deliver on) and entertainment (which the Vision Pro is clearly focused on, and excels at). However, Nilay Patel in his review at The Verge reminded us that Apple CEO Tim Cook has never been a fan of virtual reality:\nSee this thing — a passthrough VR headset with a silly external battery pack and a display that shows ghostly images of your eyes on the front — is not the big goal. The big goal is AR, or augmented reality. In particular, the big goal is optical AR, where light passes directly through unobtrusive glasses to your eyes, with digital information layered over the top of what you’re seeing. AR is a technology with the potential to literally change humanity, and Apple CEO Tim Cook has been talking about how isolating VR headsets are and how important he thinks AR will be for years now.\nTim Cook, 2016: “Few people are going to view that it’s acceptable to be enclosed in something.”\nTim Cook, 2017: “Unlike Virtual Reality which closes the world out, AR allows individuals to be present in the world.”\nTim Cook, 2017: “I also like the fact that [AR] doesn’t isolate […] I’ve never been a fan of VR like that because I think it does the opposite.”\nTim Cook, 2020: “I think [AR is] something that doesn’t isolate people. We can use it to enhance our discussion, not substitute it for human connection, which I’ve always deeply worried about in some of the other technologies.”\nThe problem is that the technology to build a true optical AR display that works well enough to replace an everyday computer just isn’t there yet. The Magic Leap 2 is an optical AR headset that’s cheaper and smaller than the Vision Pro, but it’s plagued by compromises in field of view and image quality that most people would never accept.\nSo Apple’s settled for building a headset with real-time video passthrough — it is the defining tradeoff of the Vision Pro. It is a VR headset masquerading as an AR headset. And let me tell you: the video passthrough on the Vision Pro is really good. It works! It’s convincing. You put the headset on, the display comes on, and you’re right back where you were, only with a bunch of visionOS windows floating around.\nAs Patel notes, this is a tremendous engineering achievement; the problem, however, is that you are still watching video, not seeing the real world. Still, as Neistat and countless other show-offs on social media have demonstrated, you can very much function in the real world with the Vision Pro on, and I don’t think that’s an accident. VR is a destination device, like a TV or video game console or PC, while AR is an accompaniment device, like a phone. The latter is a larger market, simply because the number of opportunities to augment a user’s life are greater than the amount of time available in a zero sum battle for total attention, and it makes sense that to the extent Apple can build experiences beyond entertainment they are focused on building AR, even if for now it is simulated.\nWhat is clear, though, is that Apple will need help: the biggest hole in not just the Vision Pro but also the Quest is software. I’ve already written about The Vision Pro’s Missing Apps, but services like Netflix and YouTube are not what will create an AR future: for that developers need to take risks, which means they need to have the possibility of making money, and deep access to the hardware Apple (and Meta) has created. I do worry that our AR future is going to be so technically challenging that only the biggest companies can create the hardware necessary, even as they hold onto business models and developer limitations that prevent the emergence of high-risk high-investment yet platform-defining software applications.\nThe other interesting aspect of those quotes Patel collected is that Cook’s emphasis on preserving the ability to interact with others really didn’t come across in last year’s Vision Pro announcement. I wrote in my Article:\nWhat was far more striking, though, was how the consumption of this video [of a father’s children] was presented in the keynote:\nNote the empty house: what happened to the kids? Indeed, Apple actually went back to this clip while summarizing the keynote, and the line “for reliving memories” struck me as incredibly sad:\nI’ll be honest: what this looked like to me was a divorced dad, alone at home with his Vision Pro, perhaps because his wife was irritated at the extent to which he got lost in his own virtual experience. That certainly puts a different spin on Apple’s proud declaration that the Vision Pro is “The Most Advanced Personal Electronics Device Ever”.\nIndeed, this, even more than the iPhone, is the true personal computer. Yes, there are affordances like mixed reality and EyeSight to interact with those around you, but at the end of the day the Vision Pro is a solitary experience.\nIt turns out that undersells it: the Vision Pro isn’t just experienced in isolation, it can only really be used by one person. Vision Pro, like all iOS-based devices, doesn’t support multiple user accounts (managed iPads, like in a school, are the exception). Apple, though, obviously wants people to be able to try the Vision Pro, so there is the option for a Guest User session. This is invoked through control center by the Vision Pro owner, who decides whether or not to allow access to their apps and data, and then has five minutes to remove their lenses (if necessary) and hand the Vision Pro to someone else.\nThis is already not great — you can’t, say, leave your Vision Pro at home or in a hotel room for a family member to use, because you’re not there to invoke a Guest User session — but it gets worse; from Apple’s support document:\nWhen your guest puts on Apple Vision Pro, they might first be asked to press and hold the Digital Crown until the displays align and a green check mark appears. Then your guest will be asked to go through hand and eye setup so that Apple Vision Pro responds accurately to their input. When hand and eye setup are complete, your guest can begin using your Apple Vision Pro.\nWhen your guest is finished using Apple Vision Pro, they can simply take off the device to end the Guest User session. The next time you put on Apple Vision Pro, it returns automatically to your personal hand and eye settings.\nThis is very harsh in practice. For example, one friend lifted up the Vision Pro to rub their eyes; when they put the Vision Pro back on the Guest User session was wiped. I had to re-invoke a Guest User session (after re-inserting my lenses5), and then they had to run through the hand and eye calibration all over again. And then I had to do it again and again for the rest of my family.\nWhat this means is that I felt like an absolute jerk. I spent $3500 on a device that only I can use, and it felt bad. I was selfish, even though I didn’t mean to be. It honestly put me in a bad mood, and made me regret my purchase (beyond, you know, the whole “this is my job” thing).\nAgain, I get that there are probably technical limitations to enabling persistent Guest User sessions. At the same time, it’s hard to not notice the incentives at play here: Apple makes money by selling devices, and it is very much in their interest that I solve this problem by buying more Vision Pros. That, though, may have been a reasonable expectation when it comes to a phone, even if it’s a bit shakier when it comes to an iPad. A $3,500 Vision Pro, though, goes too far in my opinion: Apple sells Macs for that much money, but they all support multiple users; there should be, at a minimum, the ability to enable a guest session for some set period of time, not just until they even temporarily remove the Vision Pro from their face.\nIn short, the Vision Pro might not have yet fully realized Cook’s goal of letting users be present in the real world; it’s unfortunate that it is currently so hostile at the prospect of having a shared experience with what is a remarkable device.\nI’m generally annoyed by buy/don’t-buy recommendations from review sites: just tell me what the device is like, and I can make my own decision. That noted, one reason I did want to write this review is because I think the demo I had at WWDC — which, as I understand, is pretty close to the demo available at Apple Stores — was not ultimately representative of the use case I cared the most about for the reasons I laid out above.\nNow, having used a Vision Pro of my own, I have to say that were I making a decision independent of my job, I would not buy a Vision Pro. I personally don’t watch that much TV or movies, and while I am a huge sports fan, there is not yet the sort of immersive content available that would make it worth it to me (but I’m hopeful!). Meanwhile, the productivity use cases simply didn’t materialize for me, although I am hopeful for the ability to project two monitors in a software update.\nAt the same time — and, to be sure, this applies to my job — I am happy to have one for what it says about the future. It is not just that the entertainment experience is extraordinary, but the fact that it is portable that is new (and not to beat a dead horse, is the exact sort of outcome I want for productivity). The AR possibilities hinted at by passthrough, meanwhile, are very compelling (I thought that Joanna Stern’s review captured this well, particularly the cooking app).\nI also, for what it’s worth, think that the Vision Pro is not the death knell for Meta’s VR efforts that so many think it is: the two visceral reactions I had to the Vision Pro were the “sitting down on the couch after a day at work and slipping it on” experience and the “wow it’s nice that my futzing around is private” experience; Meta, having made tradeoffs that favor a drastically lower price, is well-positioned to capture the latter, particularly for the use cases that Malik described. Make no mistake, video on the Vision Pro is better — resolution matters! — but it’s more than passable on the Quest, and better than a tablet or a phone. Controllers, meanwhile, make for a far better gaming experience, even if gaming as a whole is more of a destination activity than an augmented one.\nWhat is most compelling about Meta, though, are their investments in AI. I believe that generative AI will be the key to unlocking the Metaverse, and I suspect that Meta will achieve the capability necessary to deliver an infinite number of unique experiences before Apple will (if they even try). Meta, too, is focused on virtual connections as a matter of business (and I find their early efforts compelling); I would expect the company to deliver a compelling “friend” experience in VR long before Apple (and I do, for the record, think their cartoonish approach to avatars is much better than Apple’s uncanny-valley-esque Personas).\nIn fact, I suspect there is room for both, and their respective market opportunities may follow the distinction I noted above between AR and VR: Apple has its eyes set on the real world, and Meta the virtual one; I just wish one of them would help me get my work done.\nI wrote a follow-up to this Article in this Daily Update.\nYou can disable it completely, which I have done for many people in my life Including my built-in display, which in this picture is 14″; the photo is old, but representative enough. My single favorite feature of Vision Pro is Optic ID: it works perfectly every time, without thought; you don’t need to perfectly place your (dry) finger like Touch ID, or hold your phone just so like Face ID. It’s completely seamless and very satisfying. I think this quote from NBA Commissioner Adam Silver in Sportico does miss the point, however:\n“This is in many ways better than sitting courtside,” Silver said Friday. “It can take you anywhere on the floor. It can give you the perspective of a player … This will, to me, be how people over time experience sports.”\nActually, no, I do want to sit courtside. It’s one of the most incredible experiences you can have as a fan. Moreover, you don’t even need any production: if I want the score, I can look up at the scoreboard; the announcer is the in-arena PA system. Don’t overthink this! At this stage in my life, I much prefer wearing glasses (I can’t have LASIK surgery), so I need the Zeiss lens inserts; they are easy-to-use, but they do make the Vision Pro worse in my experience. First, eye-tracking worked much better without them, and second, bright scenes will induce reflections on the lenses that are very distracting. Moreover, if you stop using the lenses and switch to contacts, you have to re-do hand and eye calibration and re-setup Optic ID",
    "favicon": "/favicon/favicon-32x32.png"
  },
  {
    "title": "Apple Music reveals top 10 albums of all time on 100 Best list",
    "link": "https://www.apple.com/newsroom/2024/05/apple-music-reveals-top-10-albums-of-all-time-on-100-best-list/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXJiMGt0ZFdKeFZFUmZZMWxZVFJDLUFSaUtBaWdCTWdhdEZZak9rUW8=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-22T07:00:00.000Z",
    "time": "May 22",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple leaps into AI with an array of upcoming iPhone features and a ChatGPT deal to smarten up",
    "link": "https://apnews.com/article/apple-artificial-intelligence-siri-iphone-software-conference-4217d67977f95ead880835a71ecce098",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHRka3BqTWxCVFYyZG5abEoxVFJDM0FSaVRBaWdCTWdhaGM0WXpWUU0=-w400-h224-p-df-rw",
    "source": "The Associated Press",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple iPhone Spatial Video Looks Amazing on Vision Pro",
    "link": "https://www.cnet.com/tech/mobile/apple-iphone-spatial-video-arrives-in-beta-and-looks-amazing-on-vision-pro/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDJhRFJRWlcxSk9VMUZiVEpGVFJDb0FSaXNBaWdCTWdhWmdJcXBMUWM=-w400-h224-p-df-rw",
    "source": "CNET",
    "datetime": "2023-12-12T08:00:00.000Z",
    "time": "Dec 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "I Will Never Hire Anyone Again Without Asking Apple's Genius Interview Question",
    "link": "https://www.inc.com/kelly-main/i-will-never-hire-anyone-again-without-asking-apples-genius-interview-question.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXRPVU5mU0VGM2NWcHpiRkJNVFJDb0FSaXJBaWdCTWdhMU00WXlHUW8=-w400-h224-p-df-rw",
    "source": "Inc.",
    "datetime": "2024-06-02T07:00:00.000Z",
    "time": "Jun 2",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple’s new iPhones get faster chips, better cameras and new charging ports",
    "link": "https://apnews.com/article/apple-iphone-cupertino-15-pro-max-4ce309e39cabc302912bcf189605483e",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWZjR1JRVmtsVU5sQjJWVXQ2VFJDM0FSaVRBaWdCTWdhbFFwUXhKUWc=-w400-h224-p-df-rw",
    "source": "The Associated Press",
    "datetime": "2023-09-13T07:00:00.000Z",
    "time": "Sep 13, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Here's Why Apple's WWDC Presentation Changed My Mind About iOS 18",
    "link": "https://www.cnet.com/tech/services-and-software/heres-why-apples-wwdc-presentation-changed-my-mind-about-ios-18/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTZabm95Ylc5bVNHWmxja0ZUVFJDb0FSaXNBaWdCTWdhaFk0Q05NUU0=-w400-h224-p-df-rw",
    "source": "CNET",
    "datetime": "2024-06-16T07:00:00.000Z",
    "time": "Jun 16",
    "articleType": "regular",
    "content": "Before Apple announced iOS 18 on Monday at its Worldwide Developers Conference, I wasn't looking forward to the next iPhone operating system. I've tested dozens of iOS versions and numerous features, but none of the rumored iOS 18 features sparked much excitement for me. And leaks pointing to the implementation of generative artificial intelligence made me dread the OS. I hoped I was wrong about iOS 18 -- that it would offer some useful new features people have been asking for -- and it appears this wish came true.Apple mentioned a few new features that I didn't find compelling, or even necessary, because you could already do some of these things. But overall, when Apple's iOS 18 presentation was over, I was impressed. I'm looking forward to the operating system's fall release, because I'm sure I'll use some of these changes for years to come.More from WWDC WWDC 2024: Everything Apple AnnouncedWWDC 2024 Live Blog: iOS 18, AI, Siri and MoreApple Intelligence Brings New iPhone Features, ChatGPT IntegrationHere are some iOS 18 features from the presentation that I'm looking forward to -- and a few I probably won't use much.Home and lock screen customization    Screenshot by Jessica Dolcourt/CNETThank you, Apple, but also, it's about time. I've wanted both of these options for a while, and I wasn't anticipating getting them simultaneously.I've always felt weird about setting my wife or dog as my background just to have the Instagram or Spotify icons plastered over their faces. I've grouped apps in folders and hidden some icons in the App Library so they wouldn't obstruct my background. But with iOS 18, I won't run into that issue, because I can arrange my icons around my background.I've also wanted to change my lock screen's functions since Android introduced this ability in 2023. I don't need a camera function on my lock screen when I can just swipe right to access my camera. And I really don't need my flashlight to turn on when I put my phone in my pocket. It wasn't clear what functions would be available for the lock screen, but I'd probably get more use out of Quick Notes.Control Center gives you more… control    Screenshot by James Martin/CNETControl Center is an iPhone feature that I would best describe as wonky. It feels crammed with controls I don't necessarily need, and I can't remove or adjust them. Adding controls is cumbersome and just makes the feature feel even more bloated.But when Apple showed how iOS 18 lets you customize your Control Center layout and gives you additional Control Center screens, I was excited. I'll be able to take the bloat from Control Center and spread it out across multiple screens. Easily adding controls also makes this a feature I'll likely get more use out of moving forward instead of throwing my hands up in frustration.Along with the home and lock screen, it feels like Apple is finally listening to people's desires to customize their iPhone's display features to better suit their needs and wants.\nNew Gestures Will Enhance the Way You Interact with Apple Devices",
    "favicon": "/favicon-96.png"
  },
  {
    "title": "Apple Watch Ultra 2",
    "link": "https://www.apple.com/apple-watch-ultra-2/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNXViV3hJVWtoaWEwSlZhWEpuVFJENEFSakxBU2dCTWdtTkVZUW5uYVZUTmdF=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T18:26:19.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Goodbye to Apple’s Smart Keyboard Folio, the best iPad Pro accessory",
    "link": "https://www.theverge.com/24151209/ipad-pro-smart-keyboard-folio-review-discontinued",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDRSMGRzYmtsSGVuTTBWbTE1VFJDb0FSaXJBaWdCTWdZVkJJTExGUWM=-w400-h224-p-df-rw",
    "source": "The Verge",
    "datetime": "2024-05-08T07:00:00.000Z",
    "time": "May 8",
    "articleType": "regular",
    "content": "I had a sneaking suspicion this was going to happen. All the rumors about the new iPad Pro — its shift to an OLED display, the more premium Magic Keyboard — had me convinced that Apple was going to quietly move on from the quirky, very not luxurious Smart Keyboard Folio that became my preferred carry for the 2018 iPad Pro and, later, the M1 iPad Pro.Sure enough, the Smart Keyboard Folio isn’t compatible with the OLED iPad Pros. The 11-inch version can still be used with the sixth-generation iPad Air, but that’s all. So if you’re set on Apple’s very best tablet, it’s not an option anymore. And with no alternative quite like it anywhere in sight, I’m bummed.Before I get to the praise, let’s touch on the negatives. The Smart Keyboard Folio has no trackpad, so unless you pair a mouse with your iPad, the only way to navigate around is by touching the screen. That’s not ideal over long durations, but the product’s whole purpose, at least to me, has always felt like a keyboard tailored for short bursts of productivity. Fire off an email? Absolutely. Post a blog? Yep, I’ve written plenty of posts on The Verge using it. If you ever wanted to work on a novel, the Magic Keyboard was always there waiting in the wings as a step-up option for the real serious stuff.My other critique of the Smart Keyboard Folio is one that Apple still hasn’t fully rectified with the new starts-at-$300 Magic Keyboard. The palm rest and keyboard deck are now aluminum, which is objectively an improvement. But on the outside, Apple’s still using the same old material that picks up smudges like no other and tends to age terribly. I’ve long hoped they’d switch to fabric like Logitech or just come up with something (anything) better, but nope. The lightweight Smart Keyboard Folio was there for typing when I needed it, but it never felt like a chore to lug around. Photo by Chris Welch / The VergeAnd then there’s the price: the Smart Keyboard Folio for the 12.9-inch iPad Pro ran around $200 — pretty ludicrous when you consider how basic it was. It had no backlit keys. There were only two angles to pick from when using the iPad upright. It didn’t offer a spare USB-C port or any extra connectivity. It was literally just a folio case with a weird keyboard on the inside.But you know what made up for all of that? Versatility and a lightweight design that even the newer and lighter Magic Keyboard still can’t match. In practice, it just worked exceptionally well. The fabric-covered keyboard felt damn near invincible. Sure, the keys barely had any travel, and I wouldn’t exactly describe the typing experience as “comfortable.” But the Smart Keyboard Folio was a keyboard when I needed it to be — I could write Verge articles using the thing from anywhere if there was breaking news — and it could just fold behind the screen when I was reading The New York Times, browsing the web, or retouching photos using an Apple Pencil with the tablet in my lap. Feeling my fingers against the keys in that flipped-back orientation was a little odd at first, but I got used to it in no time.With the Magic Keyboard, you’ve got to fully detach the iPad Pro whenever you want to do some reading or use the device in a way where all you really need is the screen. Some people will prefer that, but the Smart Keyboard Folio was thin enough that you never really had to make a choice; you could always just leave it on no matter what you were doing.They made the new iPad Pro thinner than ever but... got rid of this super thin keyboard? Someone make it make sense. Photo by Amelia Holowaty Krales / The VergeThen there was the fact that the folio keyboard was so damn light. It kept the iPad Pro feeling like an iPad in my bag. That has never, ever been the case with a Magic Keyboard attached. When it goes on, you’ve entered MacBook weight territory. I’m not saying there’s any problem with that, but with the Smart Keyboard Folio, there was something special about toting around such a powerful combo that always stayed so airy on my back.At best, Apple is being somewhat stubborn in assuming that every iPad Pro buyer wants the tablet to feel like a laptop (and be a similar weight to one) whenever a keyboard is attached, which is what the Magic Keyboard gets you. If you want to view it with more pessimism, the company is intentionally doing away with what was a compelling, more affordable accessory — one that was easy to take anywhere — in hopes that more people will cave and fork over $300 for the only first-party keyboard that’s available for the new Pro. Now, it falls to other companies to replicate the Smart Keyboard Folio — assuming any of them even decide to bother. For now, Logitech is just churning out a refreshed version of its Combo Touch, which has more of a Surface Pro vibe than anything else. It’s nothing like the folio, so I’m not optimistic that anyone will step in to fill the void.You really don’t know what you’ve got until it’s gone, I suppose.",
    "favicon": "/icons/favicon.ico"
  },
  {
    "title": "Apple TV+ renews acclaimed, expansive sci-fi drama “Invasion” for season three",
    "link": "https://www.apple.com/tv-pr/news/2024/02/apple-tv-renews-acclaimed-expansive-sci-fi-drama-invasion-for-season-three/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUJOVk54ZUVaSFZGZFhUMmR2VFJDb0FSaXJBaWdCTWdZZFVKS3RJUWc=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-02-13T08:00:00.000Z",
    "time": "Feb 13",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "I spent the morning with the Apple Vision Pro",
    "link": "https://techcrunch.com/2024/01/19/i-spent-the-morning-with-the-apple-vision-pro/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVBiWFowU2tSUldXUnFiVlZpVFJEQ0FSaURBaWdCTWdheFZKYVFwUWc=-w400-h224-p-df-rw",
    "source": "TechCrunch",
    "datetime": "2024-01-19T08:00:00.000Z",
    "time": "Jan 19",
    "articleType": "regular",
    "content": "Update: The Vision Pro is now available for preorder on Apple’s site for $3,500. Apple has also offered a better look with a 10-minute “guided tour” of the device. It’s set to start shipping February 2.\n“Avatar” first arrived in theaters in 2009. It was a technological marvel that gave audiences one of the most immersive filmgoing experiences in the medium’s history. If contemporary online forums are to be believed, it also gave some theatergoers something entirely unexpected: depression.\nNot long after the film’s release, CNN reported on a strange new phenomenon that some deemed “Avatar Depression.” The film had been so immersive, a handful of audience members reported experiencing a kind of emptiness when they left the theater, and Pandora along with it.\nAs extended reality experiences have grown more prevalent on the success of headsets from companies like Meta, HTC and Sony, many have experienced similar phenomena. The more immersive the experience, the more jarring it can feel when you finally take the headset off.\nAfter all, at their heart, these sorts of headsets are about effectively tricking one’s brain into what it’s seeing. That cognitive dissonance is also creating the motion sickness some experience in VR. Your body and brain are, for all intents and purposes, experiencing different realities.\nThe Vision Pro isn’t a virtual reality headset — at least not as far as Apple is concerned. If you follow the company’s press materials, it’s a spatial computing device. In practical terms, it’s mixed reality. While many or most applications are thus far experienced as augmented reality, by way of on-board passthrough technology, the device is also capable of going fully immersive with a quick twist of the Apple Watch–style digital crown that sits atop the visor.\nThis week, Apple is giving select members of the media Vision Pro demos. I spent some time with the headset earlier today. It was my first hands-on experience with the hardware, as Matthew had the honor when it was unveiled at WWDC over the summer. The idea was to walk through as many elements as possible in roughly 60 minutes, from the initial app face scans, to the spatial desktop, to movie watching (no gaming, this time out, sadly).\nOptimize your data infrastructure for today’s AI. | Online, August 20\nOptimize your data infrastructure for today’s AI. | Online, August 20\nThe company was careful to provide both ends of the Vision Pro immersion spectrum, ranging from full passthrough to Environments, an all-encompassing nature scene that’s a bit like walking into a live photo on infinite loop. An hour spent cycling through different apps probably isn’t enough to experience full-on “Avatar” depression (certainly not in my case), but it does afford a glimpse at a world where such phenomena are a distinct possibility, especially as display resolutions are capable of rendering increasingly life-like images.\nIn the case of the Vision Pro, the screen is everything. As handsets have arrived at a point where 4K and 120Hz refresh rates are no longer novelties, headsets have taken up the mantle. Much of the Vision’s ability to do what it does is dependent on the pair of micro-LEDs, which jam 23 million pixels in per eye. That has the effect of creating an extremely dense 4K display out in front.\nOf course, this is Apple, so every aspect of the hardware is painstakingly considered. That begins with the fitting process. Starting February 2, Apple will have Geniuses on hand at all of its U.S. stores to guide buyers through the process. The exact nature of the in-store experience hasn’t been outlined, but a portion of the floor will be devoted to this, rather than performing it all within the confines of the Genius Bar.\nOf course, not everyone lives near an Apple Store. As such, the company will also make the process available via the app. In fact, the at-home version relies on the same app employees will be using in-store. The first step is almost indistinguishable from the process of setting up Face ID on an iPhone. You hold the phone up near your face and then move your phone around in a circle as it takes a scan from different angles. You’ll do this twice.\nFrom here, the system will determine which components will best fit with your face shape. All faces are different, of course. There’s a massive range, and getting the wrong component could dramatically impact the experience. We ran into some issues with my face (not the first time those words have been uttered). The Light Seal, which magnetically attaches to the headset, is designed to keep ambient light from leaking in.\nI just couldn’t get it quite right. We ultimately ran out of time and I had to soldier on with light pouring in from the nose bridge and my cheekbones. If you’ve ever had a similar experience with a headset, you know it’s an annoyance at first, but your brain ultimately adjusts and you forget it’s there. There were, however, a few dark demos where it once again made itself known.\nI’ve recently read some hands-on write-ups that reported some discomfort after wearing the hardware for a full hour. I didn’t experience this, but your mileage, will, of course, vary. To more comfortably distribute the device’s pound of weight, Apple is including a pair of straps in the box. There’s the Solo Knit Band, which is the big, padded one you see in all the pictures. Apple is also tossing in the Dual Loop, which is narrower and has a secondary band that goes over the top of the head.\nI wore the latter in the demo, assuming that it would do a better job with weight distribution. The straps snap on magnetically and feature Velcro for adjustments. And then, of course, there’s the battery pack. My guess is that Apple designers fought like hell to find a way around it. Ultimately, however, doing so would either mean a dramatic loss of battery life or a lot more weight added to the headset.\nFor better or worse, the hardware world is one of compromise. There are, after all, limits to physics. As it stands, the battery pack is a bit of a vestigial organ, and not a particularly elegant one at that. It feels like a very first-gen element to be addressed in subsequent versions.\nIt’s long enough that you can run it behind you while you sit, or stuff it in a pocket. I have zero doubt that the coming months will also see a number of solutions from third-party accessory manufacturers, like battery belts that promise an AR element.\nOnce you’re up and running, though, you’ll forget it’s there. This itself can ultimately be an issue, if you decided you want to stand, as I did, halfway through the demo. I got a slight jerk from the pack on doing so. Moral of the story, if you plan to do a lot of standing while wearing the headset, find a good spot for the battery.\nThe UX is largely gesture based. You’re going to do more pinching than an overzealous prankster on St. Patrick’s Day in this thing. The secret sauce is a combination of eye tracking and pinching. Look at an icon and it will pulse subtly. Now you can pinch to select. Pinch your fingers and swipe left or right to scroll. Pinch your fingers on both hands and pull them apart to zoom. There’s a bit of a learning curve, but you’ll get up and running quickly. I believe in you.\nThe hand tracking is very good here. You don’t have to lift your hands (though you probably will, instinctually), just as long as you ensure that they’re not occluded from the line of sight. I largely rested mine on my lap throughout.\nFurther refinement can be found through a button and digital crown located on the top of the visor. The crown is really not much more than a bigger version of what you get on the Apple Watch.\nOnce up and running, I immediately entered the world of passthrough. This isn’t a new idea. Magic Leap does this, as do new headsets from Meta and HTC. A fully immersive experience requires visor opacity. This means that you can’t simply look through the glass at the world around you. Passthrough utilizes on-board cameras to get an image of your surroundings and beam them to your eyes with as little latency as possible.\nOf course, human beings are quite adept at noticing latency. This is another one of those brain/body things. If the headset effectively tricks your brain into believing it’s looking directly at an image, the smallest perceptible bit of latency will be jarring. There is a small bit here. That’s to be expected. It’s not enough, however, to be truly off-putting. Again, you get used to it. (I’m going to be saying that a lot. Get used to it.)\nYou also get used to the passthrough itself. While it’s probably the best version of the technology I’ve experienced, it’s still immediately obvious that you’re not actually looking through a transparent surface. If the headset is a window, it’s a little foggy. The image isn’t as sharp as reality, nor is it as bright. Remember that bit before about getting used to it? That applies again.\nPassthrough is a foundational technology here for a number of reasons. The first and most practical is so you don’t run into shit. Simple enough. The second is that spatial computing element we talked about 1,300 or so words back. The world, to paraphrase Billy Corgan, is a desktop.\nThis is the bit you’ve seen in all the videos. Among those who imagined the Vision Pro as a gaming-first device, it was surprising just how much Apple leaned into this idea of spatial computing. In the grand scheme of things we imagine doing with mixed reality headsets, it’s not one of the sexiest. It’s work. It’s sitting at a desk typing or scrolling the internet. The rub is that there’s no desktop monitor — or rather, reality in your desktop monitor.\nAgain, Apple isn’t the first company to try this. It may well, however, be the most ambitious. It’s a great effect. As someone typing this to you while seated at a desk in front of two large monitors, the appeal is clear. Heck, if you read me with any regularity, you know that after decades of going TV free, I recently got a projector. As I was shopping for projector screens, I found the one that best suited my needs also happened to be 100 inches.\nOne hundred inches is — and I can’t express this enough — a lot of inches. I have a smallish one-bedroom apartment. The projector screen now monopolizes an entire wall of it. Using the Vision Pro, it strikes me that Apple has done a truly excellent job approximating distances and points in space.\nWatching a movie on Vision Pro feels like watching a movie projected large on the wall in front of you. Utilizing the spatial computing element, meanwhile, really gives the effect of picking up app windows and moving them around in front of you. You can have (more or less) as many open at once as you please, like you would on your desktop or phone. It’s the first computing device I’ve used where real estate doesn’t feel like a premium. Want to open another app? Just toss it to the side.\nIf reality is too boring, flip on the Environments feature we discussed before, and do your taxes atop a Hawaiian volcano at sunset. Apple is also opening up Environments to third parties. Disney made a few, so I spent a bit of time at Avengers HQ and in a parked speeder on Tatooine. It’s a fun reminder of how much of my childhood IP that public-domained mouse currently owns.\nFor my money, aside from watching a movie, the most immersive experience today was Encounter Dinosaurs. Apple worked with Jon Favreau and other folks behind the Apple TV+ show Prehistoric Planet to create an impressive dinosaur experience. These projects remind one a bit of some of the first-party app experiences Apple created to show the original iPad’s display.\nHere, a portal opens on the walk, showcasing a craggy prehistoric landscape. A couple of large carnivores reminiscent of the T. rex step through to give you a sniff. It’s very cool and makes you feel like a kid for a moment (never take the headset off and you’ll never have to confront any adult responsibilities). I loved it. The graphics are impressive, the AI makes the dinosaurs respond to the user’s movements and audio pod speakers on either side really bring to life the cacophonous snorts and grunts of a curious carnivore.\nEncounter Dinosaurs isn’t a foundational selling point, but it’s a great sign post for where things are going. Today’s demo was, unfortunately, wholly devoid of gaming, but the dinosaur experience gave me a good bit of hope about future experiences. Honestly, I could have spent the full hour chilling with dinosaurs and been perfectly happy. That’s probably just me.\nWhat may have been the most impressive thing about the demo, however, is that it felt wholly immersive even with passthrough on. It’s a strange sensation feeling transported while being very much grounded in reality.\nAnother surprisingly immersive moment came while trying the Mindfulness app. It took decades of me banging my head against the wall (metaphorically) to really start to see the benefits of meditation. The Vision Pro, however, feels like a bit of a cheat code. The app centers around a flower petal ring that moves in and out to help you control your breathing (it’s similar to the app of the same name on Apple Watch). It’s very centering and something I absolutely plan to take advantage of if and when we get a test unit.\nSpatial photos and videos also warrant a mention here. Shot on the iPhone 15 Pro, the images create a 3D scene with a real sense of depth. Remember ViewMaster? Imagine that, only with your photos and videos and you get a rough proximation of the experience. One video was seated at a family table, and felt downright intrusive, as though you’re watching strangers interact in their own kitchen.\nIf you turn your head toward a person while in one of these fully immersive experiences, you’ll begin to see their figure come through. The system utilizes people recognition and will not do the same with objects. It’s just another way to help wearers avoid being fully cut off from reality.\nFor the people around you, there’s EyeSight (not to be confused with iSight). Remember the scanning process at the beginning? Another thing the app does is build a virtual version of your face. When you look at someone, an image of the top of your face (mostly your eyes) appears in a small virtual cutout on the visor. Cameras inside the headset see when you do something like blink or grimace, and the image responds in real time, with AI creating an approximation of what your face looks like when doing that.\nThe feature exists to circumvent potential privacy concerns, providing a subtle way for people around you to know when you’re looking at them. The contents on the inside of the screen can also be broadcast to an iOS device via AirPlay, so people around you can follow along with what you see.\nPreorders for the Vision Pro open this Friday, January 19. The headset hits retail on February 2. Apple has promised more news and content announcements between now and then. As is, it’s an impressive demonstration of a new paradigm for the company — one that took the better part of a decade to develop. It brings together a number of different things the company has been working on over the years, such as spatial audio into a truly compelling package.\nIs it $3,500 compelling, however? After an hour of testing, I’m not fully convinced. For one thing, that price is prohibitively expensive for a majority of people who would be interested in the system. For another, it feels like we’re very much in the primordial stages of the content story. Much of what is on offer is existing apps ported over. They’re still neat in this setting, but it’s harder to make the case that they’re revolutionary.\nTaken as a whole, however, the Vision Pro just might be.",
    "favicon": "https://techcrunch.com/wp-content/uploads/2015/02/cropped-cropped-favicon-gradient.png?w=32"
  },
  {
    "title": "The Apple Vision Pro Is a Marvel. But Who Will Buy It?",
    "link": "https://www.nytimes.com/2024/01/31/technology/roose-apple-vision-pro.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXdkMjFEYTFSTmNFOVBOSFpZVFJEQ0FSaURBaWdCTWdhWlJKREtvUWM=-w400-h224-p-df-rw",
    "source": "The New York Times",
    "datetime": "2024-01-31T08:00:00.000Z",
    "time": "Jan 31",
    "articleType": "regular",
    "content": "",
    "favicon": "/vi-assets/static-assets/favicon-d2483f10ef688e6f89e23806b9700298.ico"
  },
  {
    "title": "Apple’s Slow Rollout of Intelligence Features Will Stretch Into 2025",
    "link": "https://www.bloomberg.com/news/newsletters/2024-06-16/when-is-apple-intelligence-coming-some-ai-features-won-t-arrive-until-2025-lxhjh86w",
    "image": "https://news.google.com/api/attachments/CC8iI0NnNUJOMnBGY0RKUFZGUTJibkZLVFJDM0FSaVRBaWdCTWdB=-w400-h224-p-df-rw",
    "source": "Bloomberg",
    "datetime": "2024-06-16T07:00:00.000Z",
    "time": "Jun 16",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple charged with breaching EU tech rules, faces another probe",
    "link": "https://www.reuters.com/technology/apples-app-store-rules-breach-eu-tech-rules-eu-regulators-say-2024-06-24/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUhPVlp6TTJoNlZFVTVlRFZDVFJDM0FSaVRBaWdCTWdhcFZJNnVxUVk=-w400-h224-p-df-rw",
    "source": "Reuters",
    "datetime": "2024-06-24T07:00:00.000Z",
    "time": "Jun 24",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple TV+ unveils first look at highly anticipated Godzilla and Titans live-action original series, “Monarch: Legacy of Monsters”",
    "link": "https://www.apple.com/tv-pr/news/2023/08/apple-tv-unveils-first-look-at-highly-anticipated-godzilla-and-titans-live-action-original-series-monarch-legacy-of-monsters/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVNPRmMxUjBWbmJ6VllWbE5uVFJDb0FSaXJBaWdCTWdhQllZb2l1d1k=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-08-17T07:00:00.000Z",
    "time": "Aug 17, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Environment - Mother Nature",
    "link": "https://www.apple.com/environment/mother-nature/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUlRemhtWld0RVpGQm9NVGhzVFJDakFSaTJBaWdCTWdZcGhZN05NUVk=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2023-09-12T18:33:11.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "Inside Apple Park, a woman carries an iPad and walks briskly down an interior corridor.\nShe picks up her pace and mumbles under her breath.\nIn a conference room, Tim Cook sits at a long table.\nTim Cook: [TO HIMSELF] Welcome to Apple, welcome to Apple. Hi, I’m Tim.\nThe woman with the iPad enters the room.\nWoman with iPad: She should be here any minute.\nTim: [TO HIMSELF] How was the weather coming in? Hi, I’m Tim.\nLisa Jackson sits across from Tim. She breathes deeply. At the table, a man in an orange sweater turns to a woman in a turquoise jacket.\nMan in orange sweater: [WHISPERING] I’m going to do the “office is already carbon neutral” thing, right?\nWoman in turquoise jacket: Yeah, all yours.\nThe woman with the iPad turns to a shelf and spots a dead plant.\nShe puts her iPad down and lifts up the plant. She collects its fallen leaves, tucks them into her pocket, then hides the plant behind her back.\nThe light in the conference room dims. Members of the team look up. Tim turns to the window.\nOutside, orchard trees sway from a wind. A cluster of leaves bends in the air. The Rainbow Stage stands bright below a cloudy sky. Back in the conference room, the table rumbles. Water glasses tremble.\nA lady bug lands on a glass.\nMother Nature: I hope we didn’t keep you waiting.\nMother Nature, played by Octavia Spencer, sits at the table.\nWoman in plaid blazer: [WHISPERING] Mother Nature.\nTim: Mother Nature, welcome to Apple. How -- How was the weather getting in?\nMother Nature tilts her head and grins.\nThe room darkens. Outside, clouds block the sun.\nMother Nature: The weather was however I wanted it to be. Let’s cut to the chase. In 2020, you promised to bring Apple’s entire carbon footprint to zero by 2030. Henry David Thoreau over here…\nMother Nature: …said, “We have a profound opportunity to build a more sustainable future for the planet we share.”\nWhile Mother Nature speaks, the woman with the iPad silently mouths the speech.\nMother Nature’s assistant: I think our 10 o’clock said the same thing.\nMother Nature: They all do. All right. This is my third corporate responsibility gig today, so who wants to disappoint me first?\nLisa Jackson: Well, we’ve got some updates we’re excited to share with you —\nMother Nature’s assistant: Is there a materials person here?\nWoman with iPad: Yes. We are in the process of eliminating all plastic from our packaging by the end —\nMother Nature: Let me guess. Fifty years from now when someone else is left holding the bag?\nWoman with iPad: By the end of next year, actually.\nLisa nods and smiles. A man wearing black sitting to Mother Nature’s left speaks.\nMan wearing black: And we’re also currently using 100 percent recycled aluminum in the enclosures of all our MacBooks, Apple TVs, Apple Watch.\nMother Nature: What about iPod shuffle?\nMan wearing black: The... Well...\nMembers of the team glance at each other.\nMother Nature: It’s a joke! Don’t you people make Ted Lasso?\nMan in leather jacket: Oh, that’s a different group.\nMan wearing black: Um, we’re also phasing out leather in our iPhone cases —\nMother Nature: What about Brando over there? They phasing you out too?\nThe team member looks down at his leather jacket.\nMan in leather jacket: Oh.\nMan in orange sweater: Uh, we -- we’re operating on 100 percent clean electricity.\nMother Nature: What runs on 100 percent clean electricity?\nMan in orange sweater: Every Apple office, store, and data center runs on clean electricity, thanks to you and your powerful wind and sun.\nWoman in turquoise jacket: And Apple offices are already carbon neutral.\nMother Nature: This building is carbon neutral?\nMan in orange sweater: Well, yeah, we do it with a mix of clean energy and eliminating greenhouse emissions. It’s kind of like if you were to —\nMother Nature: You’re seriously explaining carbon neutrality to Mother Nature?\nMother Nature’s assistant shakes his head and swings his hand back and forth across his neck.\nMan in orange sweater: Right. No, I’m sorry.\nMother Nature: You want to tell me how photosynthesis works too?\nMother Nature points to him.\nWoman in turquoise jacket: Um, also, over 300 suppliers have committed to using 100 percent clean renewable electricity.\nMother Nature: [TO HER ASSISTANT] What’s next?\nMother Nature’s assistant: [INHALES DEEPLY] Transportation.\nMan in leather jacket: I’m proud to report that we’re shipping more products by ocean rather than air, which reduces transportation emissions by 95 percent.\nMother Nature’s assistant: Ninety-five percent?\nThe assistant turns to Mother Nature, who stares back unaffectedly.\nMother Nature’s assistant: Not too bad.\nMan in leather jacket: I’m also happy to report that we’re investing in projects around the world that protect the earth’s soil, plants, and trees.\nMother Nature: [SCOFFS] Everyone says they’re planting trees.\nMother Nature rises. She walks toward Lisa.\nMother Nature’s assistant: Oh! Hello.\nMother Nature: What, are you trying to save the tropical savanna?\nLisa: Yes. And we’ve also restored mangroves in Colombia.\nLisa: Our aim is to permanently remove carbon from the atmosphere.\nMembers of the team nod and closely watch Mother Nature.\nMother Nature: What about your water usage?\nMother Nature: By how much?\nLisa nods, her hands clasped calmly on the table. Mother Nature suppresses a smile. She turns and walks slowly to the window, her hands joined behind her back. The team watches anxiously. Outside, the sun breaks through the clouds. Tim and Lisa stand.\nTim: As you can see, we’ve innovated and retooled almost every part of our process to reduce our impact on the planet. But there’s still a lot more work to do.\nLisa: And there’s something else we wanted to share with you.\nMother Nature: You’re not trying to bribe Mother Nature with Apple swag?\nLisa: It’s Apple’s very first carbon neutral product.\nMother Nature looks down at the Apple Watch devices on a stand. A logo with five green petals and the words “Carbon Neutral” appear below the devices. Her lips subtly turn up.\nMother Nature: Hm. I want to see you do more of this.\nTim: By 2030, all Apple devices will have a net zero climate impact.\nMother Nature: All of them?\nMother Nature stares at Tim. He looks back, a serious expression on his face. Mother Nature squints one eye slightly.\nMother Nature: OK! Good! See you next year.\nMother Nature and her assistant walk toward the exit.\nMother Nature: [FROM A DISTANCE] Don’t disappoint your mother!\nThe assistant looks back and nods. Tim rubs his head. Members of the team smile.\nTeam members: That was awesome.\nThe woman with the iPad continues to hold the dead plant behind her back. Now, it grows.\nFive green petals transform into the black Apple logo with a green petal.",
    "favicon": ""
  },
  {
    "title": "Apple’s AI Push Sets Stage for Everything From Glasses to Robots",
    "link": "https://www.bloomberg.com/news/newsletters/2024-06-09/apple-wwdc-ai-announcements-will-enable-home-robot-ar-glasses-camera-airpods-lx7jem9f",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUJUV0ZxVlVwdFkzRjVSMUZMVFJDM0FSaVRBaWdCTWdZVlVKYkxvUWc=-w400-h224-p-df-rw",
    "source": "Bloomberg",
    "datetime": "2024-06-09T07:00:00.000Z",
    "time": "Jun 9",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Watch is the perfect golfing companion",
    "link": "https://www.apple.com/newsroom/2024/05/apple-watch-is-the-perfect-golfing-companion/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWpYMDh6WlRVNUxYQXhjamx5VFJDMkFSaVZBaWdCTWdZTklwWXBtZ2s=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-05-15T07:00:00.000Z",
    "time": "May 15",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple The Exchange TRX now open in Kuala Lumpur",
    "link": "https://www.apple.com/newsroom/2024/06/apple-the-exchange-trx-now-open-in-kuala-lumpur/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUxVMlpzTUVOSGVITkxUbU0xVFJDb0FSaXNBaWdCTWdZQk1KREFJQWs=-w400-h224-p-df-rw",
    "source": "apple.com",
    "datetime": "2024-06-22T07:00:00.000Z",
    "time": "Jun 22",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Every “Apple Intelligence” feature announced",
    "link": "https://www.theverge.com/2024/6/10/24175405/wwdc-apple-ai-news-features-ios-18-macos-15-iphone-ipad-mac",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNVBjMnRZV0c4M1NHNDFUVGwzVFJDb0FSaXNBaWdCTWdrQllaalBLQ2pKYUFJ=-w400-h224-p-df-rw",
    "source": "The Verge",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "Apple announced “Apple Intelligence” at WWDC 2024, its name for a new suite of AI features for the iPhone, Mac, and more. Starting later this year, Apple is rolling out what it says is a more conversational Siri, custom, AI-generated “Genmoji,” and GPT-4o access that lets Siri turn to OpenAI’s chatbot when it can’t handle what you ask it for. The company that once refused to use the term “artificial intelligence” when talking about its machine learning features is now, as best as we can tell, catching up with just about all of the table-stakes features that Google, Microsoft, and others have rolled out in the last year. The company says the AI features will be available only on the iPhone 15 Pro and 15 Pro Max and iPads or Macs with M1 or later chips, and only when their language is set to English. The features will start rolling out this fall in iOS 18, iPadOS 18, and macOS Sequoia.Siri gets AI smartsSiri will be a rainbow ring around the edge of your screen soon. GIF: AppleApple said its AI features will carry out actions between apps, as well as manage notifications, automatically write things for you, and summarize text in mail and other apps. As with other built-in AI writing tools, you can change the tone of something you’re writing with a prompt. The company also says its AI features can do things like reference one app to carry out an action in another, such as asking it to play a podcast your partner sent you. When you invoke Siri, Apple says it has “onscreen awareness,” meaning it can understand what you’re asking and “take action with users’ content in more apps over time.” The company says this will work in both Apple and third-party apps, as well. And you’ll be able to type to Siri, not just talk.Of course, this is Apple, so there’s a privacy story. The company says that many features will work on-device, where that’s possible. But when you ask for something more complicated, your device — whether an iPhone, Mac, or iPad — will make a call to shunt the request to the cloud automatically. Apple says it’s using what it calls “Private Cloud Compute.” The models that process more complicated requests are servers “powered by Apple Silicon,” and the company says it will never store or be able to access your data on its servers. Also, the company says that it will let independent experts inspect code running on its servers “to verify privacy.” Apple image generation featuresYou can create Genmoji with a prompt for when emoji just won’t cut it. Image: AppleApple says it’s rolling out “Genmoji,” a new feature that will generate emoji-like reactions on the fly so that when you can’t find the one you want, you can just have it created for you by AI. Similarly, a new image generation feature is coming to iOS 18, called Image Playground. Apple says the feature works in several apps, but it also has its own app by the same name. It will also let developers access an API to include Image Playground on their devices. Additionally, Apple is bringing AI to the Photos app. You can already search for objects pictured in your library, but Apple says it’s improving how this works in the future, so you can search for things like a person who is doing cartwheels. It also added features similar to Google’s Magic Eraser, like the ability to erase a person from a photo.Apple’s OpenAI deal is realSiri will ask you before it uses ChatGPT. Image: AppleChatGPT, powered by GPT-4o, will come to iOS, macOS, and iPadOS “later this year,” as a chatbot that Siri can turn to when it’s not able to do what you ask. When it does this, Apple says it will ask your permission before it sends questions, documents, or photos to ChatGPT and that, after it responds, Siri will present its answers to you. Apple said it was starting with the best chatbot but that it would support other AI models down the road. ChatGPT offers suggestions anywhere you can use AI writing suggestions. Image: AppleThe company also says ChatGPT will be available to use in its systemwide AI writing tools, can be used to generate images, and that it obscures IP addresses. OpenAI won’t store user requests, either, Apple writes. Finally, while you won’t need to create an account or pay for ChatGPT; Apple says subscribers can connect their accounts to use paid features within the built-in integrations. OpenAI published the same information on its website.Related:",
    "favicon": "/icons/favicon.ico"
  },
  {
    "title": "Apple Needs to Evolve to Compete in the Artificial Intelligence Era",
    "link": "https://www.bloomberg.com/news/newsletters/2024-05-19/what-is-apple-doing-in-ai-summaries-cloud-and-on-device-llms-openai-deal-lwdj5pkz",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVFSVlkwVkVnMVpVMVhiMHRRVFJDM0FSaVRBaWdCTWdZUmdvYW9RUVE=-w400-h224-p-df-rw",
    "source": "Bloomberg",
    "datetime": "2024-05-19T07:00:00.000Z",
    "time": "May 19",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Apple Intelligence Brings AI to the iPhone With ChatGPT Integration and More",
    "link": "https://www.cnet.com/tech/mobile/apple-intelligence-brings-ai-to-the-iphone-with-chatgpt-integration-and-more/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXBZVnAzZUVWM1VtaEJiM2RsVFJDb0FSaXNBaWdCTWdZdGdZaXZOUVU=-w400-h224-p-df-rw",
    "source": "CNET",
    "datetime": "2024-06-16T07:00:00.000Z",
    "time": "Jun 16",
    "articleType": "regular",
    "content": "Apple Intelligence, the company's long-awaited deeper push into AI, made its debut at the company's Worldwide Developers Conference on Monday. It will be integrated into iOS 18, iPadOS 18 and MacOS Sequoia, and OpenAI's ChatGPT technology will be more deeply tied into those platforms as well. AI has played an important role in Apple products for years. But the widespread popularity of OpenAI's ChatGPT chatbot has shone a bigger spotlight on generative AI -- models trained on large swaths of data that can create content in response to prompts. As rivals such as Samsung, Google and Microsoft have been infusing the tech into their most important products, all eyes have been on Apple to see how the company plans to bring generative AI to its own products. At WWDC 2024, we're finally getting that answer.More from WWDC WWDC 2024: Everything Apple AnnouncedWWDC 2024 Live Blog: iOS 18, AI, Siri and MoreApple Intelligence Brings New iPhone Features, ChatGPT Integration      Understanding personal context when delivering answers and carrying out tasks is a big part of Apple's approach with Apple Intelligence. Apple seems to be using this tactic as a way to distinguish its own AI efforts from those previously announced by competitors. As an example, the company explained how Apple Intelligence can understand multiple factors like traffic, your schedule and your contacts to help you understand whether you can make it to an event on time. Apple also started out the AI portion of its keynote with an emphasis on privacy. It explained how many of its AI models run on-device, which is generally considered to be more private since information doesn't have to travel over the internet. At times when a task may require larger models, Apple will use a system called Private Cloud Compute. When needed, tasks that require more computing power will run on servers Apple has specifically created that run on Apple Silicon. Apple Intelligence will decide whether a task can be processed on-device.     Watch this: Everything Announced at Apple's WWDC 2024\n12:07Siri upgrades    Apple/Screenshot by CNETSiri is a big part of Apple's AI push. The voice assistant is becoming more natural, relevant and personal with this update. You'll be able to speak in more natural language, and Siri should be able to understand you even if you stumble all over your words. Since it understands context, you can ask follow up questions, and Siri should know what you mean. Apple's virtual assistant will support text input as well. It's also getting better at helping you use your iPhone since it will be able to answer questions about specific iPhone features. Over the course of the next year, more Siri updates will be coming. Siri is getting on-screen awareness so that it can take action based on what's on your phone's screen, which sounds similar to the upgraded version of Gemini that Google announced last month. An example might include adding someone's address to their contact card after receiving it in a text message.      Watch this: Apple Redesigns Siri With AI and Glowing Borders\n03:18Siri will be able to take actions within apps, such as sharing photos on your behalf, and will be able to draw on your personal context to help you accomplish tasks. If you ask it when a loved one's flight is landing, for example, it'll cross-reference flight data that may have been shared with you through a text message or email. Siri will also be able to incorporate other information, like upcoming lunch reservations, so you can ask it how long it will take to get from the airport to the restaurant without switching between apps. Image generation and productivity     Apple/Screenshot by CNETSeveral of the new features in Apple Intelligence are focused on productivity, similar to tools we've seen from Google and Microsoft over the past year. Apple Intelligence can help you rewrite emails in different styles, for example, and it can highlight and summarize priority notifications. There's also a proofreading tool for checking things like grammar and word choice.These so-called Writing Tools will be available in iOS 18, iPadOS 18 and MacOS Sequoia across apps like Notes, Mail, Pages and third-party apps. Like Microsoft and Google, Apple also wants to use AI to tidy up your email inbox. A new feature called Priority Messages will show the most urgent emails, like a boarding pass, and you'll be able to see email summaries without having to open a message.As for notifications, priority alerts will appear at the top of the stack, and there will be notifications to help you quickly get a synopsis of important notifications at a glance.     Watch this: Apple introduces Personalized Emojis Called Genmojis\n00:54As expected, you'll also be able to create emoji on the fly with a new tool called Genmoji. This allows you to create custom emoji based on text inputs, including the ability to create Genmoji of friends or family based on their photos.  Apple is also introducing an image generator called Image Playground. You can choose from themes, accessories, places and more, and these environments get added to your playground. If you have something specific in mind, you can type in an idea to add it to your playground.There are three styles for image generation: sketch, illustration and animation. Since it understands your context, it'll also make suggestions. Image Playground is available as an app, but it'll also be integrated into apps like Messages. All images are created on-device. The Notes app is getting a new tool called Image Wand, which lets you circle a rough sketch within a note and open the Image Playground to create a more realistic picture. You'll also be able to record, transcribe and summarize audio in the Notes app. Apple Intelligence can also take actions on your behalf. You'll be able to ask it to pull up files from last week, play a podcast that a friend or loved one sent the other day and more. The Photos app is also getting enhanced search functionality that lets you find specific images using natural language based on general descriptions, such as \"Maya skateboarding in a tie-dye shirt.\" Google announced a similar feature for Google Photos last month. There's also a new Clean Up tool for removing objects in the background of a photo, which sounds similar to the Magic Editor and Generative Edit features from Google and Samsung. One of the more unique features is the ability to create stories in the photos app by typing in a description. For example, you can create a memory movie based on \"everything we ate in Japan\" or \"last summer in our garden\" to string together photos that fit those descriptions. ChatGPT integration    Apple/Screenshot by CNETApple is also partnering with OpenAI to incorporate ChatGPT into iOS 18, iPadOS 18 and MacOS Sequoia. If you're using Siri, for example, Apple's virtual helper will be able to tap into ChatGPT's expertise when needed to answer a specific question. For instance, if you want to know what types of plants would look nice on your deck, you can snap a photo, and Siri can use ChatGPT to provide an answer.Notably, Apple says that you'll be asked whether you want to use ChatGPT before using the service to pull up answers.      Watch this: OpenAI's ChatGPT Is Coming to Apple Apps\n02:32Apple's announcement follows similar moves from Samsung, Google, Microsoft and OpenAI. Samsung announced a collection of new AI features called Galaxy AI for its Galaxy phones in January. Galaxy AI, which debuted on the Galaxy S24 series, includes tools that can translate phone calls in real time, erase and resize objects in photos and preview video clips in slow motion. Google started 2024 by announcing Circle to Search, a feature for Android phones that makes it possible to launch a Google search just by circling or scribbling on a subject shown on screen. At its I/O conference last month, Google showed how its Gemini assistant will be able to understand more about the apps that are being used. Microsoft also previously unveiled similar AI-powered productivity tools for gathering context from emails and controlling PC settings. Apple also announced new software updates for all of its major platforms at WWDC, including new versions of iOS, MacOS, WatchOS, iPadOS and more. The company usually introduces its new iPhone and Apple Watch models in September.",
    "favicon": "/favicon-96.png"
  },
  {
    "title": "Apple Intelligence is the company’s new generative AI offering",
    "link": "https://techcrunch.com/2024/06/10/apple-intelligence-is-the-companys-new-generative-ai-offering/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNTJNMHhYYm1KblNIZFJPRkkxVFJDb0FSaXNBaWdCTWdrUllJN3l2Q1dhQ2dJ=-w400-h224-p-df-rw",
    "source": "TechCrunch",
    "datetime": "2024-06-10T07:00:00.000Z",
    "time": "Jun 10",
    "articleType": "regular",
    "content": "On Monday at WWDC 2024, Apple unveiled Apple Intelligence, its long-awaited, ecosystem-wide push into generative AI. As earlier rumors suggested, the new feature is called Apple Intelligence (AI, get it?). The company promised the feature will be built with safety at its core, along with highly personalized experiences.\n“Most importantly, it has to understand you and be grounded in your personal context, like your routine, your relationships, your communications, and more,” CEO Tim Cook noted. “And of course, it has to be built with privacy from the ground up together. All of this goes beyond artificial intelligence. It’s personal intelligence, and it’s the next big step for Apple.”\nThe company has been pushing the feature as integral to all of its various operating system offerings, including iOS, macOS and the latest, visionOS.\n“It has to be powerful enough to help with the things that matter most to you,” Cook said. “It has to be intuitive and easy to use. It has to be deeply integrated into your product experiences. Most importantly, it has to understand you and be grounded in your personal context, like your routine, your relationships, your communications and more and of course, it has to be built with privacy from the ground up. Together. All of this goes beyond artificial intelligence. It’s personal intelligence, and it’s the next big step for Apple.”\nSVP Craig Federighi added, “Apple Intelligence is grounded in your personal data and context.” The feature will effectively build upon all of the personal data that users input into applications like Calendar and Maps.\nThe system is built on large language and intelligence models. Much of that processing is done locally according to the company, utilizes the latest version of Apple silicon. “Many of these models run entirely on device,” Federighi claimed during the event.\nThat said, these consumer systems still have limitations. As such, some of the heavy lifting needs to be done off device in the cloud. Apple is adding Private Cloud Compute to the offering. The back end uses services that run Apple chips, in a bid to increase privacy for this highly personal data.\nOptimize your data infrastructure for today’s AI. | Online, August 20\nOptimize your data infrastructure for today’s AI. | Online, August 20\nApple Intelligence also includes what is likely the biggest update to Siri since it was announced more than a decade ago. The company says the feature is “more deeply integrated” into its operating systems. In the case of iOS, that means trading the familiar Siri icon for a blue glowing border that surrounds the desktop while in use.\nSiri is no longer just a voice interface. Apple is also adding the ability to type queries directly into the system to access its generative AI-based intelligence. It’s an acknowledgment that voice is often not the best interface for these systems.\nApp Intents, meanwhile, brings the ability to integrate the assistant more directly into different apps. That will start with first-party applications, but the company will also be opening up access to third parties. That addition will dramatically improve the kinds of things that Siri can do directly.\nThe offering will also open up multitasking in a profound way, allowing a kind of cross-app compatibility. That means, for instance, that users won’t have to keep switching between Calendar, Mail and Maps in order to schedule meetings, for example.\nApple Intelligence will be integrated into most of the company’s apps. That includes things like the ability to help compose messages inside Mail (along with third-party apps) or just utilize Smart Replies to respond. This is, notably, a feature Google has offered for some time now in Gmail and has continued to build out using its own generative AI model, Gemini.\nThe company is even bringing the feature to emojis with Genmoji (yep, that’s the name). The feature uses a text field to build customized emojis. Image Playground, meanwhile, is an on-device image generator that is built into apps like Messages, Keynote, Pages and Freeform. Apple is also bringing a stand-alone Image Playground app to iOS and opening up access to the offering via an API.\nImage Wand, meanwhile, is a new tool for Apple Pencil that lets users circle text to create an image. Effectively it’s Apple’s take on Google’s Circle to Search, only focused on images.\nSearch has been built, as well, for content like photos and videos. The company promises more natural language searches inside of these applications. The GenAI models also make it easier to build slideshows inside of Photos, again using natural language prompts. Apple Intelligence will be rolling out to the latest versions of its operating systems, including iOS and iPadOS 18, macOS Sequoia and visionOS 2. It’s available for free with those updates.\nThe feature will be coming to iPhone 15 Pro and M1 Mac and iPad devices. The standard iPhone 15 will not be getting the feature, likely owing to limitations of the chip.\nThat’s arriving for iOS, iPadOS and macOS later this year. The company says it will also be bringing integration to other third-party LLMs, though didn’t offer much detail. It seems likely that Google’s Gemini is near the top of that list.",
    "favicon": "https://techcrunch.com/wp-content/uploads/2015/02/cropped-cropped-favicon-gradient.png?w=32"
  }
]