[
  {
    "title": "Salesforce kicked me out after I left my desk to play ping-pong",
    "link": "https://www.businessinsider.com/salesforce-ping-pong-work-flexible-2024-7",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWtaa1J5ZGpkdU4xTndPWE5MVFJEQ0FSaURBaWdCTWdhdEpaek9sUW8=-w400-h224-p-df-rw",
    "source": "Business Insider",
    "datetime": "2024-07-02T07:00:00.000Z",
    "time": "Jul 2",
    "articleType": "regular",
    "content": "This as-told-to essay is based on a transcribed conversation with Miles Schwartz, 33, from Montreal. Schwartz was briefly employed at Salesforce as an intern and later cofounded his own company. His employment was verified, and the following has been edited for length and clarity.I was never the best student. Anything with a lot of structure always gave me anxiety, but I thought I would thrive in business when I finished school.After studying marketing at Concordia University, I started an internship at Salesforce. After six weeks, I was escorted out of the building after playing ping-pong outside my lunch hour.The structured environment of a 9-to-5 job didn't allow me to thrive. I've since cofounded my own company and don't watch over employee's shoulders. It's important to give people freedom in how they work.I didn't enjoy my time at SalesforceI started my internship at Salesforce in September 2014 in their Toronto office.I really didn't like the experience. I thought I'd be on business calls, schmoozing people, and going to conferences, but as a business-development intern, I was mainly doing data entry and finding contacts.As a people person, I felt out of my element. I felt like the outcast for not enjoying it. Everyone else seemed to love it there. They didn't overwork people, they compensated people properly, and there were easy paths to promotion.I felt homesick. Going for a beer after work was part of the culture, but I'm really into health and fitness. I prefer to do my own thing after work, like running or going to the gym.My hours were meant to be 9 to 5. I remember once, after staying very late the previous day, I turned up at 9:15 a.m., and my manager came up to me and said, \"You do realize work starts at 9?\" It made me think optics really mattered there.I was let go after I played ping-pong in the middle of the dayThe internship was meant to last four months, leading to a permanent role at the company.\nOne day, six weeks in, I was feeling foggy and tired. I had already taken my hourlong lunch break, but later in the day, a more-senior colleague asked if I wanted to play ping-pong in the office with him.We played for at least 30 minutes, and I was back at my desk within an hour. I intended to stay late that evening to make up for the lost time.When I got back, my manager told me I couldn't disappear in the middle of the day, especially as an intern, and that this wasn't a good look if I wanted to get promoted at the company.I explained I often stayed late to finish my work, but she told me the job was 9 to 5. I felt Salesforce didn't want entry-level employees to work their own hours or do things their own way.I told her I didn't want to get promoted. I wanted to finish the internship and leave. However, my manager politely said I shouldn't stay at all, so security came, took my computer and badge, and escorted me out of the building.I had no hard feelings about it. Why would they spend their energy teaching me about the company if I had no desire to be there?I thrived in a less-structured working environmentI thrive in an environment where I can listen to my body and step away from work for a short while if needed. In a flow state, I can work a 13-hour day, and it's smooth sailing, but some days, you just don't have it. That day at Salesforce, I just didn't have it. I wanted to play ping-pong and clear my head.It reinforced that I didn't thrive in structure, but I started to worry I wouldn't find a workplace where I belonged.I tried another sales job, working for a friend's uncle, but I only lasted a few weeks because I didn't enjoy making 90 cold calls a day and getting hung up on.I took a break from corporate work and started modeling to make money. Eventually, I arranged meetings with startups, but none felt like a natural fit until I landed an interview with Flinks, a fintech startup, in April 2017. They offered me a role as the director of business development.I was nervous I was going to fail. The weekend before I started, I asked one of the founders a few questions, including where he wanted me to work from and what companies I should reach out to initially. He responded, \"Why the hell are you asking me? You're in charge.\"The second he said that, I knew this was exactly the opportunity I was looking for. The freedom to do whatever I wanted motivated me. In a corporate job, I hated being made to do 90 cold calls a day, but I started doing 200 cold calls a day on my own.Over time, I started to build a network and speak at conferences for the company. After a year, I became the chief sales officer. During my time there, Flinks became one of the fastest-growing fintechs in Canada.I cofounded my own company and want people to have freedom in how they workI left Flinks in 2019 and cofounded my own company, Zūm Rails.I work extremely hard, probably close to 50 hours a week, but never overwork to the point of exhaustion.Nowadays, I can walk my dog in the mountains during the day if I want to and reply to emails in the evening when I'm back.My cofounder and I aren't watching over people's shoulders at Zūm Rails.Our hours are meant to be 9 to 5, but I think our culture is more mission-driven, and people aren't watching the clock. We hire talented specialists who all want to succeed.We do have to have some structure to operate in a remote world as a team of over 50 people. For example, sales-development representatives ensure all call notes are updated in the customer-relationship-management system, or CRM, before handing over to an account manager.But I don't micromanage how people get their jobs done. I remember finding it weird when a senior employee asked me if they could go to a doctor's appointment in the afternoon.Our employees have the freedom to work from wherever they feel they will perform at their best, whether it's from a coworking space, an office, or their house, as long as the work gets done to the expected standard.Giving people the freedom to work the way they want to helps boost output.Salesforce didn't respond to a comment request from Business Insider.",
    "favicon": "/public/assets/BI/US/favicons/apple-touch-icon-192x192.png?v=2023-11"
  },
  {
    "title": "Salesforce out as LA28 sponsor",
    "link": "https://www.sportsbusinessjournal.com/Articles/2024/04/15/salesforce-out-as-la28-sponsor",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTVOa3BQWlRVNU0zQklkVjh4VFJDbEFSaXlBaWdCTWdZQkFwVHNBQTA=-w400-h224-p-df-rw",
    "source": "Sports Business Journal",
    "datetime": "2024-04-15T07:00:00.000Z",
    "time": "Apr 15",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce shareholders reject compensation plan for CEO Marc Benioff, other top execs",
    "link": "https://www.cnbc.com/2024/07/01/salesforce-shareholders-vote-against-compensation-for-top-executives.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTVVR0ZqYkd4SFdqVm9kbWswVFJDb0FSaXNBaWdCTWdZTktZQ0htZ2s=-w400-h224-p-df-rw",
    "source": "CNBC",
    "datetime": "2024-07-01T07:00:00.000Z",
    "time": "Jul 1",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce hits silver - a tale of two towers a quarter of a century apart",
    "link": "https://diginomica.com/salesforce-hits-silver-tale-two-towers-quarter-century-apart",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNU9ja2hWWXpJd1kwTTNVMFpoVFJERUFSaUJBaWdCTWdZSlFJQU9IZ28=-w400-h224-p-df-rw",
    "source": "diginomica",
    "datetime": "2024-03-08T08:00:00.000Z",
    "time": "Mar 8",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Workday Salesforce Partnership: Teaming Up For Enterprise AI",
    "link": "https://joshbersin.com/2024/07/workday-salesforce-partnership-teaming-up-for-enterprise-ai/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNXJXamxwV25CYWRVZ3lPVGN0VFJDYUFSaklBaWdCTWdrSm9aS0Z0aVkxandF=-w400-h224-p-df-rw",
    "source": "Josh Bersin",
    "datetime": "2024-07-26T17:27:30.000Z",
    "time": "6 days ago",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce",
    "link": "https://www.nttdata.com/global/en/about-us/partners/salesforce",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDNVMnRaTFVGeFprdDFZbFZ4VFJDdUFSaWlBaWdCTWdaTlVZeTJwQVk=-w400-h224-p-df-rw",
    "source": "NTT Data",
    "datetime": "2024-07-08T22:08:06.000Z",
    "time": "Jul 9",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Q1 Earnings: CEO Benioff Calls AI Models Commodities, Data ‘The New Gold’",
    "link": "https://www.crn.com/news/ai/2024/salesforce-q1-earnings-ceo-benioff-calls-ai-models-commodities-data-the-new-gold",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUZiVlJHY1VOdmQxaDNUMnBmVFJEQ0FSaUVBaWdCTWdZaEJwRHREUXM=-w400-h224-p-df-rw",
    "source": "CRN",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "AI“Customer data and metadata are the new gold for these enterprises,” Salesforce CEO Marc Benioff said Wednesday.\nSalesforce executives played up growth in the vendor’s artificial intelligence offerings while acknowledging continued “measured” customer buying patterns including longer sales cycles and smaller during the fiscal 2025 first quarter.Marc Benioff, CEO and co-founder of the San Francisco-based customer relationship management (CRM) application vendor, told analysts on Wednesday’s call – covering the quarter ended April 30 – that generative AI models are merely commodities and “not where the intelligence lies.”“Customer data and metadata are the new gold for these enterprises,” Benioff said on the call. “We'll be using different models and different UIs [user interfaces] over the years, but we'll be using the same deep data sources. And I think that is why, when I look at what Salesforce is doing, this is going to be critical for our customers.”[RELATED: Salesforce Drops $11B Informatica Acquisition Pursuit: Reports]Salesforce Q1 EarningsSalesforce, which has about 12,000 partners worldwide, manages around 250 petabytes of customer data, including data that “provides the attributes and context the AI models need to generate accurate, relevant output,” Benioff said. This makes the vendor a key player as businesses continue to adopt AI.AI models alone “don't know anything about a company's customer relationships,” he said. “Seventy-five percent of the value of GenAI use cases is in the front office. And everybody knows Salesforce is the leader in front office software. That's our fundamental premise for our growth going forward.”Measured Buying EnvironmentBrian Millham, Salesforce president and chief operating officer, told analysts on the call that the vendor sees “good demand as AI technology rapidly evolves and customers recognize the value of transforming into AI enterprises,” but “we continue to see the measured buying behavior similar to what we have experienced over the past two years.”The momentum Salesforce experienced in the last quarter of the 2024 fiscal year moderated in the latest quarter, Millham said.“We saw elongated deal cycles, deal compression and high levels of budget scrutiny,” he said. “In addition, in Q1 as part of our ongoing transformation, we made some intentional changes in our go-to-market organization to drive long-term productivity and create better customer experiences, which also played a role in the softer bookings performance.”Some deals Salesforce ended up getting done during the quarter were “smaller when we ultimately closed them,” Millham said. He saw “a couple of deals push out of the quarter as people delayed decisions that we thought would actually happen in our first quarter. This no-decision issue is coming up more frequently than we anticipated.”The Americas and Europe, the Middle East and Africa (EMEA) felt more constrained compared to other geographies, Millham said. Technology, small and midsize businesses, and “and other areas of transactional business” are expected to see continued constraint.Salesforce President and Chief Financial Officer Amy Weaver said that the deal compression and project delays contributed to an expected revenue headwind in professional services. “Customers are really just looking for shorter duration projects,” she said.Although the measured buying environment has lasted about “two full years at this point,” Weaver said, “we continue to see good demand on multi-cloud adoption, we're seeing benefits from pricing and packaging changes that we have rolled out over the past year [and] we're seeing very healthy adoption around our industry projects.”Customers who went on a software buying spree during the pandemic now “look to actually rationalize it, ingest it, integrate it, install it, update it” post-pandemic while layering in AI capabilities and preparing data estates, Benioff said.One of the efforts Salesforce has taken to perform better in the measured buying environment is starting quarters with higher pipelines, the CEO said.“Where traditionally we might have started our pipelines at 2x, now our message to our distribution leaders is, ‘Hey, if you're going to start out your pipeline in the quarter, you better start out at 3x,’” Benioff said. “And this is also our message to our peers as well – to evaluate the pipeline much more aggressively than ever before. That means a much deeper inspection of the pipeline but holding it at a much higher level.”OpenAI Shade, AI CompetitionThroughout the call, Benioff told analysts that Salesforce is separated from the growing AI competition because of the data it manages.Other AI vendors “may say they have this capability or that capability, this user interface, that model, that whatever – all of these things are quite fungible and are expiring quickly as the technology rapidly moves forward,” he said. “But the piece that will not expire is the data. The data is the permanent key aspect.”Benioff told analysts on the call that he has been using Microsoft-backed OpenAI’s new GPT-4.0 model, calling it “pretty magical.”But then he shamed the organization behind ChatGPT and Dall-E, saying that OpenAI “stole data from lots of companies like Time [which Benioff owns], Dow Jones, New York Times, Reddit. And now they're all making good, doing agreements with all of us, saying we're sorry, and paying for it.”“For all companies – including ours, others – who want to deploy generative AI internally, it's not just going to be Time Magazine that's going to give you the intelligence,” Benioff said. “It's going to be your customer data and your transaction history and how your company operates in your workflow and your metadata. And that idea that we can deliver another level of productivity for companies using that architecture is absolutely in front of us... That data needs to be stored somewhere. And it needs to come from somewhere. That is going to be something that's going to continue in perpetuity over time.”AI Product UpdatesSalesforce’s Data Cloud unified data platform helps businesses unify data trapped in thousands of applications and silos, Benioff told analysts on the cloud.Some Data Cloud data points Benioff shared include:\n25 percent of Salesforce’s $1 million-plus deals in the quarter included Data Cloud\nThe vendor added more than 1,000 Data Cloud customers for the second quarter in a row\n8 trillion records were ingested into Data Cloud in the quarter, up 42 percent year over year\nData Cloud processed two quadrillion records, more than triple compared to last year\nMore than 1 trillion activations drove customer engagement, a 33 percent increase year over year\n“It is the engine of our future growth, and this is the engine of our future artificial intelligence growth as well,” Benioff said.The growth of Data Cloud points to customers “getting their data estate in order as a precursor to leveraging AI capabilities,” Millham said. “Customers [are] really wanting to bring together many data sources so they can leverage AI in the flow of work … it's actually a step process for many of our customers – ‘Let's get our data in order. And then let's layer in the AI to really drive the productivity gains that we expect.’”Salesforce’s Einstein AI technologies now generate hundreds of billions of predictions per day and trillions per week, Benioff said. Thousands of customers are powering generative AI use cases with Einstein Copilot, Prompt Builder and Einstein Studio, all products that went live in the first fiscal quarter.Hundreds of copilot deals have closed since it became generally available April 25, Benioff said. Millham told analysts that Slack users have leveraged AI to summarize more than 28 million messages since its February launch.Salesforce added 2,300 new customer logos to Starter and Pro Suite, its new, ready-to-use, simplified products with AI built in aimed at small and medium businesses (SMB), Weaver said on the call.M&A On The HorizonWhen asked about Salesforce’s mergers and acquisition strategy following rumors of interest in buying Informatica, Benioff said that Salesforce “will continue to look at products inorganically” as well as innovating within the company.“If we're looking at a large-scale acquisition, we're going to make sure that it is not dilutive to our customers, that it's accretive, that has the right metrics,” he said. “And we're also going to be quick to walk away from things that we are not totally confident in or that we don't have the trust with whatever company that we're looking at. So, we have operated inside that framework. … I don't think any company has been more successful with M&A than Salesforce has been.”Salesforce closed its acquisition of incentive compensation management (ICM) software provider Spiff on Feb. 1.Q1 In DepthSalesforce reported revenue of $9.13 billion during the quarter, an increase of 11 percent year over year.CFO Weaver said the revenue “was at the lower end of our guidance range due to containment pressures on professional services, some license revenue volatility and the continued measure buying environment.”Industry-wise, public sector and financial services performed well. High tech, retail and consumer goods were more constrained, she said.Subscription and support revenue was $8.59 billion, up 13 percent year over year ignoring foreign exchange. “This included the tailwind and the timing of license revenue in MuleSoft and Tableau related to Q4 deals and a one-point benefit from the leap year,” Weaver said.Salesforce’s current remaining performance obligation (cRPO) was $26.4 billion, up 10 percent year over year. RPO was $53.9 billion at the end of the quarter, up 15 percent year over year.The vendor posted operating cash flow of $6.25 billion for the quarter, up 39 percent year over year. Free cash flow was $6.08 billion, up 43 percent year over year. “We have more than tripled the cash we generated just four years ago,” Weaver said.Salesforce’s stock fell about 16 percent after market close, trading at about $228 a share.Nearly half of the vendor’s top 50 wins in the quarter included six or more clouds, Benioff said on the call.Six of its top 10 deals included six or more clouds, Millham said. Slack was included in nearly half of the top 50 deals in the quarter. Half of Salesforce’s top 10 deals included one of its industry clouds.Performance GuidanceSalesforce executives told analysts to expect revenue in the current (fiscal 2025 second) quarter between $9.2 billion and $9.25 billion, an increase of between 7 percent and 8 percent year over year.Although Weaver told analysts on the call that “we are assuming that the conditions we saw in Q1 continue throughout our fiscal year, the vendor maintained its projected full fiscal year revenue of $37.7 billion to $38 billion, which would mark a year-over-year increase of 8 percent to 9 percent.Salesforce lowered its expected full fiscal year revenue for subscription and support to about 10 percent year over year excluding foreign exchange.",
    "favicon": ""
  },
  {
    "title": "Salesforce debuts gen AI benchmark for CRM",
    "link": "https://www.cio.com/article/2151993/salesforce-debuts-gen-ai-benchmark-for-crm.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUtOSGRJVW1acFZ6WlZUWGRJVFJDM0FSaVRBaWdCTWdZaGM1WkxxUWM=-w400-h224-p-df-rw",
    "source": "CIO",
    "datetime": "2024-06-18T07:00:00.000Z",
    "time": "Jun 18",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce, IQVIA expand partnership to codevelop Life Sciences Cloud",
    "link": "https://www.mobihealthnews.com/news/salesforce-iqvia-expand-partnership-co-develop-life-sciences-cloud",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTBXR1pwYlhCdmRIRXpaRzUwVFJDakFSaTJBaWdCTWdhbFFvejBIQWs=-w400-h224-p-df-rw",
    "source": "Mobihealth News",
    "datetime": "2024-04-10T07:00:00.000Z",
    "time": "Apr 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "What's Next for Salesforce After Informatica Deal Collapse?",
    "link": "https://www.cmswire.com/customer-experience/salesforce-informatica-deal-falls-apart/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDNTa05FYm04dGRqVlVhMFZ0VFJEQ0FSaURBaWdCTWdhQms0NVJPUWM=-w400-h224-p-df-rw",
    "source": "CMSWire",
    "datetime": "2024-04-22T07:00:00.000Z",
    "time": "Apr 22",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce's Einstein Copilot is Here: The Conversational AI Assistant for CRM that Delivers Trusted AI Responses Grounded with Your Company Data",
    "link": "https://www.prnewswire.com/news-releases/salesforces-einstein-copilot-is-here-the-conversational-ai-assistant-for-crm-that-delivers-trusted-ai-responses-grounded-with-your-company-data-302072143.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHdNbWgzWlZreFJtNTVVM2RqVFJEQ0FSaURBaWdCTWdZQmdJNWp0Z1U=-w400-h224-p-df-rw",
    "source": "PR Newswire",
    "datetime": "2024-02-27T08:00:00.000Z",
    "time": "Feb 27",
    "articleType": "regular",
    "content": "Einstein Copilot delivers trusted responses because it's grounded in your company's unique data and metadata, enabling it to deeply understand your business and customer relationshipsEinstein Copilot is natively embedded across Salesforce applications to deliver a consistent user experience that can answer questions, generate content, and dynamically automate any action to deliver better productivity, deeper customer relationships, and higher marginsSalesforce customers can access Einstein Copilot by upgrading to Einstein 1 Editions of Salesforce that include Data Cloud, AI, and CRM in a single offering,  /PRNewswire/ -- Salesforce (NYSE: CRM), the #1 AI CRM, today announced the public beta availability of Einstein Copilot, a new customizable, conversational, and generative AI assistant for CRM.\nUnlike other AI assistants or copilots that lack adequate company data to generate useful responses, Einstein Copilot enables Salesforce customers to generate responses using their own private and trusted data, while maintaining strict data governance and without requiring expensive AI model training. As a result, Einstein Copilot can answer questions, summarize content, create new content, interpret complex conversations, and dynamically automate tasks on behalf of a user, all from a single, consistent user experience embedded directly within Salesforce's #1 AI CRM applications.\nThis is made possible by combining a conversational UI, a foundational large language model, and trusted company data that enables Salesforce users to tap into the power of generative AI and interact with their applications in entirely new ways.\n\"AI is the single most important moment in the history of our industry. It will deepen customer relationships, increase productivity and drive higher margins at every company,\" said Marc Benioff, Chair & CEO, Salesforce. \"Our new Einstein Copilot brings together an amazing intuitive interface for interacting with AI, world-class AI models and above all deep integration of the data and metadata needed to benefit from AI. Einstein Copilot is the only copilot with the ability to truly understand what is going on with your customer relationships.\"Why it matters: 86% of IT executives believe that generative AI will have a major impact on their companies, and according to new research from Slack, AI use in the workplace accelerated 24% in the past quarter alone. And, 80% of employees using AI say that it is already improving their productivity. This increased AI adoption indicates that AI is becoming a crucial tool for accomplishing practical business tasks throughout an organization.How customers can purchase Einstein Copilot: Customers can tap into the full power of Salesforce with Einstein 1 Editions, simplified technology packages for businesses looking to accelerate growth and speed productivity with the #1 AI CRM. Einstein 1 Editions provide organizations in every industry access to the best of Salesforce technology, including CRM, Einstein Copilot, Data Cloud, Slack and Tableau in a single offering, helping them transform their business and deliver stronger customer experiences.Einstein Copilot Capabilities-  Grounding prompts in Data Cloud: Einstein Copilot grounds its responses with trusted business data from Data Cloud to provide the necessary context for the highest quality outputs. This allows Einstein Copilot to generate more precise and tailored responses based on trusted company data.-  Out-of-the-box \"actions\": Einstein Copilot comes with a library of out-of-the-box actions – pre-programmed capabilities, automated responses, or business tasks performed by Einstein Copilot – that the AI can perform for the user when prompted. Actions can be combined to execute dynamic multi-step plans. For example, a customer service agent can ask Einstein Copilot to close a case and open a sales opportunity or sell an add-on, and Einstein Copilot will understand the user's intent and can execute the task — or tasks — in the flow of the service experience. With Einstein Copilot there are no silos between applications or data.-  Customize Einstein Copilot for specific business needs: Einstein Copilot can be customized to accomplish specific sales, service, marketing, commerce, and IT tasks, ensuring company and industry policies are applied. Copilot Builder can create custom actions for Einstein Copilot, Prompt Builder activates custom prompts in the flow of work, and Model Builder uses proprietary AI models to power custom Einstein Copilot functionality.-  Reasoning engine to interpret intent and choose the best action: Einstein Copilot's reasoning engine – the process that interprets and processes information to make informed decisions, solve problems, or generate insights – interacts with an LLM by analyzing the full context of the user's prompt, determining the actions or series of actions to take, and generating the output. For example, if a sales rep asks Einstein Copilot, \"Help me recommend a new product tier to my customer,\" Einstein Copilot can determine which products the customer currently has, understand the upgrade options, and transition the customer into a new high-value marketing segment. Finally, Einstein Copilot can update the information across multiple systems with MuleSoft and Salesforce Flow. -  Generating trusted responses and actions: Einstein Copilot serves up trusted AI interactions with privacy and security measures provided by the Einstein Trust Layer. The Einstein Trust Layer is part of the Einstein 1 Platform and performs functions like masking personally identifiable information (PII), scoring outputs for toxicity, and helping to protect information from unauthorized access and data breaches through zero-data retention from Salesforce's LLM partners.Sample Use Cases Einstein Copilot revolutionizes how teams and industries use AI to enhance productivity and personalization, conveniently within their flow of work. Using natural language prompts, salespeople can accelerate deal closures by summarizing records or generating customized communications to provide more personalized client engagement. Customer service and field service agents can streamline case resolution and boost customer satisfaction by surfacing relevant answers, offers, and data from disparate systems. Financial service companies can simplify client onboarding and craft personalized financial plans by automating data collection and analysis, enabling advisors to dedicate more time to client relationships and strategic advice.Customer Quotes:\n\"With Einstein Copilot, our service teams will be able to quickly handle requests, from generating replies to suggesting activities. It will make our teams more efficient, letting us prioritize the guest experience.\" – Robert Marusi, Chief Commercial Officer, Turtle Bay Resorts\n\"Salesforce took the time to understand Wonolo's needs and offer solutions that addressed our pain points. We have been able to bring all the information our agents need together in one place. Einstein has helped our agents be more efficient and confident in their work, without losing the human connection we pride ourselves on as a company.\" – Adam Ashworth, Senior Salesforce Administrator, Wonolo\n\"Einstein Copilot will improve our team's support to McLaren Racing partners. Our teams will use their AI assistant to efficiently summarize partner requests, streamline communication, and foster stronger relationships with our partners.\" – Ed Green, Head of Commercial Technology, McLaren Racing\nPricing Customers can access Einstein Copilot by purchasing Einstein 1 Editions or by adding it on to Enterprise or Unlimited Editions. Detailed pricing information is available here.Global Availability\nEinstein Copilot is available in beta globally for Sales Cloud and Service Cloud, with Commerce Cloud and Marketing Cloud available later in 2024.\nEinstein Copilot currently supports data residency in the United States and the English language.\nAdditionally, Einstein Copilot for Tableau will be launching later this year in H2. Currently Tableau supports generative AI capabilities with Tableau Pulse and Tableau Copilot (now in Beta).",
    "favicon": "/content/dam/prnewswire/icons/2019-Q4-PRN-Icon-32-32.png"
  },
  {
    "title": "Salesforce Backs Out of Informatica Deal, Reports",
    "link": "https://www.cxtoday.com/crm/salesforce-backs-out-of-informatica-deal-reports/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNW5jR2RtY0ZaTk4yVXdjVEJVVFJDZkFSaS1BaWdCTWdrQlFvaE9wZWZJMVFB=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-04-22T07:00:00.000Z",
    "time": "Apr 22",
    "articleType": "regular",
    "content": "Bloomberg and The Wall Street Journal are reporting that the proposed acquisition has fizzled out.\nSalesforce has withdrawn from discussions for the potential takeover of Informatica, according to sources close to the matter.The reports claim that the two tech firms have been unable to agree on terms, with an unidentified Bloomberg source stating that the disagreement is due to price.The apparent breakdown in talks comes just over a week after news broke that Salesforce was deep in discussions to acquire the global data integration platform provider.At the time, Informatica’s shares were trading at $38.48, with the Wall Street Journal reporting that Salesforce was aiming for a price in the mid-$30s a share, which would have made the acquisition one of the most significant in the company’s history.While the reported cooling off seems a bit abrupt – particularly when you consider that the Wall Street Journal was, at one point, anticipating that a deal could be agreed before the end of last week – there have been criticisms within the CX space about the proposed merger.A Doomed Deal?Chief among those who criticized Salesforce’s potential acquisition of Informatica, was Gaurav Dhillon – the current Chief Executive of Software Company SnapLogic and Co-Founder of Informatica – who described the deal as a “real step backward” for Salesforce.Dhillon also expressed concerns about how the merger would affect Informatica’s users, foreseeing a “rocky road ahead” due to significant overlap in integration products.The former Informatica man’s primary concern with the merger revolved around the coexistence of Informatica’s technology and MuleSoft, the integration platform Salesforce acquired for $6.5 billion in 2018.Indeed, Dhillon predicted that integrating a new system alongside MuleSoft could take years:With two disparate platforms, Salesforce now has to navigate merging MuleSoft’s technology with Informatica’s technology – a complex, time-consuming project that will likely take more than five years to complete.Dhillon wasn’t the only person with misgivings about the merger, with both companies having suffered share price drops since the news broke that the pair were in discussions.\nAt the time of writing, both Salesforce and Informatica have recovered somewhat, but are still down 4.8 percent and 6.7 percent in the past week respectively.What next for Salesforce and Informatica?Despite the breakdown in takeover talks, it has still been a good year for Informatica.Having started 2024 with its share price hovering just below $27, it peaked at $38 and is currently sitting at $35.Much of Informatica’s success can be attributed to the company’s growing adoption of AI in the enterprise, as organizations increasingly transition from AI testing to full-scale deployments.Informatica’s data integration and management platform plays a crucial role in supporting these deployments. It enables companies to efficiently collect, organize, and refine customer data, facilitating seamless integration into AI-driven initiatives.Additionally, the tech provider offers essential functionalities such as data management, security, quality assurance, and governance – enabling businesses to maintain accurate, secure, and compliant data.It also boasts high scalability and is capable of providing extensive customization options for tailoring data integration processes to suit the unique requirements of organizations.For Salesforce, even if the acquisition does fall through, it has still been a busy period for the cloud-based software provider.The company recently unveiled its Public Sector Einstein 1 for Service solution, designed to elevate governmental customer service.This offering equips government employees with CRM functionalities, AI capabilities, and enhanced data tools, streamlining administrative tasks and enhancing the constituent experience.Furthermore, it has made its Unified Conversations service widely available on WhatsApp, allowing businesses to leverage WhatsApp for enhanced marketing promotions or service requests, facilitating dynamic two-way communication.\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Introducing Salesforce virtual table support for Power Pages (Preview)",
    "link": "https://www.microsoft.com/en-us/power-platform/blog/power-pages/introducing-salesforce-virtual-table-support-for-power-pages-preview/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUVkV3cxY0U5TldUWkdjRGxFVFJDb0FSaXNBaWdCTWdZQkFLaUFsd3M=-w400-h224-p-df-rw",
    "source": "Microsoft",
    "datetime": "2024-04-12T07:00:00.000Z",
    "time": "Apr 12",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Growth Tech on Salesforce",
    "link": "https://www.mckinsey.com/capabilities/growth-marketing-and-sales/how-we-help-clients/growth-tech-on-salesforce",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNXVZMWd0V1UwM1UzVlVXVlpSVFJDdEFSaWpBaWdCTWdNeGhSSQ=-w400-h224-p-df-rw",
    "source": "McKinsey",
    "datetime": "2023-09-12T17:45:04.000Z",
    "time": "Sep 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Shareholders Vote Against Pay Plans for CEO Marc Benioff, Other Execs",
    "link": "https://www.investopedia.com/salesforce-shareholders-vote-down-pay-plans-for-ceo-marc-benioff-other-execs-8672536",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUlkamMzVDNCdVpGbEZUV1JYVFJDM0FSaVRBaWdCTWdhMU00cFJJUWs=-w400-h224-p-df-rw",
    "source": "Investopedia",
    "datetime": "2024-07-02T07:00:00.000Z",
    "time": "Jul 2",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce shares tumble as soft cloud demand hurts forecasts",
    "link": "https://www.reuters.com/technology/salesforce-forecasts-second-quarter-revenue-below-estimates-2024-05-29/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHpaREpWVUdWMFJEUmZkRUZYVFJDNkFSaVBBaWdCTWdZZFVwZ3JJUWs=-w400-h224-p-df-rw",
    "source": "Reuters",
    "datetime": "2024-05-29T07:00:00.000Z",
    "time": "May 29",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce shares plunge 16% on first revenue miss since 2006",
    "link": "https://www.cnbc.com/2024/05/29/salesforce-crm-q1-earnings-report-2025.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXZlalYzZVVkMVgzUXhUVTlIVFJDb0FSaXNBaWdCTWdhcEZack5rUW8=-w400-h224-p-df-rw",
    "source": "CNBC",
    "datetime": "2024-05-29T07:00:00.000Z",
    "time": "May 29",
    "articleType": "regular",
    "content": "Marc Benioff, CEO of Salesforce, appears on a panel at the World Economic Forum in Davos, Switzerland, on Jan. 18, 2024.Stefan Wermuth | Bloomberg | Getty ImagesSalesforce shares plummeted as much as 17% in extended trading on Wednesday after the cloud software vendor reported weaker-than-expected revenue and issued guidance that trailed Wall Street’s expectations.Here’s how the company did, compared to the LSEG consensus:Earnings per share: $2.44 adjusted vs. $2.38 expectedRevenue: $9.13 billion vs. $9.17 billion expectedSalesforce called for adjusted earnings per share in the current quarter of $2.34 to $2.36 on $9.2 billion to $9.25 billion in revenue. Analysts surveyed by LSEG had expected $2.40 in adjusted earnings per share on $9.37 billion in revenue.Revenue in the fiscal first quarter, which ended April 30, increased 11% from $8.25 billion a year earlier, Salesforce said in a statement. It is the first time since 2006 that Salesforce fell short on revenue, according to LSEG data.Salesforce saw budget scrutiny and longer deal cycles than usual during the quarter, president and operating chief Brian Millham told analysts on a conference call. Management implemented go-to-market changes that cut into bookings, Millham said.All five of Salesforce’s product areas contributed to the growth. But revenue from the Professional Services and Other category, at $548 million, was down 9% and under the StreetAccount consensus of $572.9 million.Net income jumped to $1.53 billion, or $1.56 per share, from $199 million, or 20 cents per share a year ago.Salesforce lifted its earnings forecast for the 2025 fiscal year. The company now expects adjusted earnings of $9.86 to $9.94 per share, compared to $9.68 to $9.76 three months ago. Its revenue guidance remains at $37.7 billion to $38 billion. Analysts polled by LSEG were looking for $9.76 in adjusted earnings per share and $38.08 billion in revenue.Amy Weaver, Salesforce’s finance chief, said she expects deal compression and slowing projects in the professional services business through the current fiscal year.During the quarter, Salesforce started selling its Einstein Copilot assistant sales and customer service representatives. The company also said artificial intelligence features such as conversation summaries and daily recaps were becoming available to paid Slack customers. The Wall Street Journal reported that Salesforce was in talks to buy data-integration company Informatica, but weeks later, the newspaper said talks had collapsed.Weaver said Salesforce acquisitions would need “a clear timeline to value accretion.”Before the after-hours move, Salesforce shares were up 3.5% so far this year, trailing the S&P 500 index, which is up around 11% during the same period. A drop of this magnitude on Thursday would mark Salesforce’s worst day on the market since the 2008 financial crisis.— CNBC’s Robert Hum contributed to this report.WATCH: Salesforce bets even bigger on artificial intelligence",
    "favicon": "https://sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/favicon.ico"
  },
  {
    "title": "Genesys and Salesforce Start to Onboard Customers for Their Joint CX Platform",
    "link": "https://www.cxtoday.com/contact-centre/genesys-and-salesforce-start-to-onboard-customers-for-their-joint-cx-platform/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNDRja0pGV1c1dExXeFlWbUpIVFJDZkFSaS1BaWdCTWdrUk1aS21GcW90aUFJ=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-03-21T07:00:00.000Z",
    "time": "Mar 21",
    "articleType": "regular",
    "content": "The CCaaS and CRM stalwarts launched the CX Cloud from Genesys and Salesforce late last year\nThe CX Cloud from Genesys and Salesforce is generally available, and its first customers are now up and running on the platform.That first batch includes almost 20 enterprises, with Colruyt Group, the European retail corporation, one of the most recognizable new names.However, more Salesforce-centric businesses are in the pipeline, looking to leverage an offering that pulls Genesys’s contact center, journey orchestration, and workforce engagement management (WEM) solutions into Service Cloud.In doing so, these businesses may access more mature CCaaS solutions while pulling new data into the Salesforce ecosystem (as CX Today previously reported).Not only will that firehouse of data support deployments of AI in CX, but it may also help to connect the service, sales, and marketing ecosystem.Yet, the CX Cloud announcement is just one of many, as Genesys released its fiscal year 2024 business results.Most notably, its revenues rose by more than ten percent year-over-year (YoY), with the Genesys Cloud CCaaS platform generating the lion’s share.Indeed, the offering helped the Magic Quadrant leader rake in $1.2BN over the full year, which represents an impressive growth of 45 percent (YoY) in subscription revenue across the platform.NICE is the only other market player to generate over $1BN in CCaaS revenues.The hike in CCaaS revenue comes as Genesys booked over 85 deals valued at $1MN+ in annual contract value (ACV) for the platform over the 12-month period.Meanwhile, the number of deals with an ACV of $5MN grew by more than 65 percent (YoY).Celebrating the vendor’s CCaaS bookings growth – alongside the launch of the CX Cloud from Genesys and Salesforce – Tony Bates, CEO and Chairman of Genesys, stated:Our record-setting bookings are evidence that our vision to ensure every customer and employee interaction is personalized and continually optimized is resonating with the industry.“Our customers are looking to us to lead them into that future, which happens in the cloud with Genesys AI-powered experience orchestration.”While the Genesys numbers appear promising, it’s critical to note that the vendor is a private company. As such, it can pick and choose the financial results it puts into the public domain.\nTherefore, its numbers do not come under the same scrutiny as other contact center stalwarts, such as Cisco, Five9, and NICE.That said, the vendor did share many more impressive statistics while celebrating its recent acquisition of Radarr Technologies and the launch of a new R&D center in Budapest.More FY2024 Highlights from GenesysAlongside a hike in $5MN+ ACV deals, Genesys revealed that the average number of unique agents for each of its top 50 Genesys Cloud customers surpassed 10,000. That’s up almost 30 percent YoY.The statistic reiterates Genesys’s success in moving large enterprises across to its CCaaS platform – many of which transitioned from its legacy base.Indeed, 950 customers – out of the 5,700+ that leverage the Genesys Cloud – have migrated from Engage, Genesys’s legacy platform.Such migration success perhaps derives from the vendor’s strength in sharing helpful processes and solutions that support businesses as they move from legacy environments, as Gartner underlined in its latest Magic Quadrant report.However, Genesys also suggests that AI has played a role, highlighting that the use of digital bots on the platform surged by four times (YoY) and voice bots rose by three times (YoY).In addition, platform users have already automated over 1.2MN contact summaries via Genesys’ Auto Summarization for Agent Assist, since its launch in Q3 of the last financial year.Alongside auto-summarization, Genesys released 400 new features over the 12 months, including 100+ new workforce engagement management (WEM) capabilities and almost 70 AI-powered tools.In terms of the types of businesses leveraging these tools within its Cloud, Genesys revealed it had achieved significant growth in sectors such as healthcare, retail, and business services. There, revenues have risen by 75, 65, and 65 percent, respectively.Finally, Genesys noted that it won $200+MN in new and sustained business thanks to its sustainability practices – underlining the value for CX vendors in uplevelling their ESG practices.\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Salesforce updates Sales and Service Cloud with new capabilities",
    "link": "https://www.cio.com/article/2139149/salesforce-updates-sales-and-service-cloud-with-new-capabilities.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVFSV010T1ZsVWNuQmlTV2syVFJDb0FSaXNBaWdCTWdhaG81SnN0UVk=-w400-h224-p-df-rw",
    "source": "CIO",
    "datetime": "2024-06-06T07:00:00.000Z",
    "time": "Jun 6",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Dear SaaStr: Should I Switch from HubSpot CRM to Salesforce if I’m Just Starting Out?",
    "link": "https://www.saastr.com/dear-saastr-should-i-switch-from-hubspot-crm-to-salesforce-if-im-just-starting-out/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUpkVFpSYnpab1ZGVjVUa2xRVFJEcEFSallBU2dCTWdZSkNKYW1qZ3M=-w400-h224-p-df-rw",
    "source": "SaaStr",
    "datetime": "2023-08-16T15:15:45.000Z",
    "time": "Aug 16, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "ERM, Salesforce, NatureMetrics and Planet launch NatureTech Alliance to address biodiversity loss",
    "link": "https://www.erm.com/about/news/erm-salesforce-naturemetrics-and-planet-launch-naturetech-alliance-to-address-biodiversity-loss/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNUlSWHBSWjBaU01GaFRXRVZ1VFJEQ0FSaURBaWdCTWdrWkVZTFRVT0o2UlFJ=-w400-h224-p-df-rw",
    "source": "Legal Term",
    "datetime": "2024-05-14T07:00:00.000Z",
    "time": "May 14",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "LA28 loses top-tier Salesforce sponsorship",
    "link": "https://www.sportspromedia.com/news/la28-salesforce-sponsorship-ends-olympics-paralympics-team-usa-nbc/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXpNRWh3VWpsaGRERnVSbUl5VFJDdUFSaWlBaWdCTWdZMWc0eFJzUVU=-w400-h224-p-df-rw",
    "source": "SportsPro Media",
    "datetime": "2024-04-16T07:00:00.000Z",
    "time": "Apr 16",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Accenture and Salesforce Collaborate to Help Life Sciences Companies Create Differentiation with Data and AI",
    "link": "https://newsroom.accenture.com/news/2023/accenture-and-salesforce-collaborate-to-help-life-sciences-companies-create-differentiation-with-data-and-ai",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNU1lWE5xYVhWVlFYVnFPVk51VFJDaUFSaTJBaWdCTWdZQlI1UkZJZ2M=-w400-h224-p-df-rw",
    "source": "Newsroom | Accenture",
    "datetime": "2023-11-06T08:00:00.000Z",
    "time": "Nov 6, 2023",
    "articleType": "regular",
    "content": "Building on the recently announced Accenture and Salesforce generative AI collaboration, the companies will leverage their joint generative AI acceleration hub to develop new solutions and use cases for Salesforce Life Sciences Cloud. The companies will also use Salesforce Data Cloud and Einstein AI, Salesforce’s AI technology, to help increase productivity and transform healthcare professional and patient experiences.\n“The rapid pace of science and technology advancements is making treatment decisions more complex,” said Emma McGuigan, senior managing director and Enterprise & Industry Technologies lead at Accenture. “Data and AI will drive differentiation around how life sciences organizations engage with their customers. Together with Salesforce, we can help organizations establish a digital foundation to support omni-channel experiences across sales, service and marketing with data and intelligence at the core.”The accelerated adoption of data and analytics capabilities to fuel decisions and operations is a top investment priority for 58% of life sciences companies, according to Accenture Research.“As we build the next generation Life Sciences Platform, Accenture is partnering with our teams to provide its deep industry expertise,\" said Amit Khanna, SVP & GM, Health and Life Sciences at Salesforce. “Accenture’s deep understanding of the pharma and medtech spaces and their current work to transform patient experiences will help us create new innovation for life sciences companies and in the new development of Salesforce Life Sciences Cloud.”Accenture and Salesforce have worked with Cencora (formerly AmerisourceBergen), a global pharmaceutical solutions provider that offers integrated support, including patient services, across the pharmaceutical development and commercialization journey. With Life Sciences Cloud, the companies will help Cencora utilize rich data and insights to modernize patient engagement with a digital-first capability at scale.“Cencora is committed to leveraging new and emerging technologies, like generative AI, to deliver solutions that reduce potential barriers along the treatment journey and meet the needs of our biopharma partners, healthcare providers and the patients they serve,” said Shannon Coven, senior vice president, Data & Platforms for Global Pharma Services at Cencora. “Together with Accenture and Salesforce, we are harnessing the power of data and AI to help improve outcomes and enhance the patient care experience.”Together, Accenture and Salesforce have already developed assets and accelerators including:\nA patient services Health Cloud assessment framework, which evaluates legacy pharma patient services solutions to generate insights and a value case for Salesforce Life Sciences Cloud.\nA pharmaceutical Data Cloud and Einstein AI accelerator, which provides a holistic view of provider and patient data, using the power of generative AI. It enables greater impact by suggesting the most important messages to be delivered to the patient during the next interaction.",
    "favicon": ""
  },
  {
    "title": "Salesforce Government Trailblazer Summit 2024",
    "link": "https://guidehouse.com/events/2024/06/04/salesforce-government-trailblazer-summit-2024",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNVdOa3RrWlZoUlZFVnpSM1JEVFJEaEFSamhBU2dCTWdrQk1KUkFHLXByU2dJ=-w400-h224-p-df-rw",
    "source": "Guidehouse",
    "datetime": "2024-06-04T07:00:00.000Z",
    "time": "Jun 4",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce-Informatica Deal Appears to Have Fallen Through",
    "link": "https://www.datanami.com/2024/04/24/salesforce-informatica-deal-appears-to-have-fallen-through/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTRUbmRoUzFKc2VXWTFWelZGVFJDdUFSaWlBaWdCTWdhQk1JUU9xUU0=-w400-h224-p-df-rw",
    "source": "Datanami",
    "datetime": "2024-04-24T07:00:00.000Z",
    "time": "Apr 24",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "My take - digesting Salesforce’s Q1 and what it means for it and the tech market’s future",
    "link": "https://diginomica.com/my-take-digesting-salesforces-q1-and-what-it-means-it-and-tech-markets-future",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUVhVTExV0dKZlpsZG1Za2hXVFJDM0FSaVRBaWdCTWdZSlFZQVZuUWs=-w400-h224-p-df-rw",
    "source": "diginomica",
    "datetime": "2024-06-04T07:00:00.000Z",
    "time": "Jun 4",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce and AI: How Salesforce’s Einstein Transforms Sales",
    "link": "https://www.eweek.com/artificial-intelligence/how-salesforce-drives-business-through-ai/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUlWbWhSYTJJNE9HeDVSbXN4VFJDMEFSaVlBaWdCTWdhaGxKU01NUWM=-w400-h224-p-df-rw",
    "source": "eWeek",
    "datetime": "2024-04-09T07:00:00.000Z",
    "time": "Apr 9",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "McKinsey teams up with Salesforce to deliver on the promise of AI-powered growth",
    "link": "https://www.mckinsey.com/about-us/new-at-mckinsey-blog/delivering-tech-powered-growth-through-generative-ai",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNUdWamh4T1haTWVVZDZkbGhaVFJDdEFSaWpBaWdCTWdrRkFZYUtEU1pWYlFF=-w400-h224-p-df-rw",
    "source": "McKinsey",
    "datetime": "2023-09-07T07:00:00.000Z",
    "time": "Sep 7, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "“Death of a Salesforce”: Why AI Will Transform the Next Generation of Sales Tech",
    "link": "https://a16z.com/ai-transforms-sales/",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNDJhMDlEYjJWT09IcEthRWRDVFJDaUFSaTNBaWdCTWdPSkF6dw=-w400-h224-p-df-rw",
    "source": "Andreessen Horowitz",
    "datetime": "2024-07-31T16:41:10.000Z",
    "time": "16 hours ago",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "AI is the thorn in Salesforce’s side",
    "link": "https://www.morningbrew.com/daily/stories/2024/05/31/ai-is-the-thorn-in-salesforce-s-side",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTVURWR0ZFVWS2RYcFhYMmREVFJDM0FSaVRBaWdCTWdhbFZKNk1JUWs=-w400-h224-p-df-rw",
    "source": "Morning Brew",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce, Zoom Law Chiefs Get Nearly $26 Million in Total Pay",
    "link": "https://news.bloomberglaw.com/business-and-practice/salesforce-zoom-law-chiefs-get-nearly-26-million-in-total-pay",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXRRVk5CY2xSZlQwMXFVVlZWVFJDTEFSanFBaWdCTWdZZFpaYXFxUWM=-w400-h224-p-df-rw",
    "source": "Bloomberg Law",
    "datetime": "2024-05-03T07:00:00.000Z",
    "time": "May 3",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce shares tumble 20% in worst day since 2004",
    "link": "https://www.cnbc.com/2024/05/30/salesforce-stock-fall-earnings-revenue-miss.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHhXVlZ0TTNOeFJsUjVUak5mVFJDb0FSaXNBaWdCTWdhQllJYXROUVk=-w400-h224-p-df-rw",
    "source": "CNBC",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "Marc Benioff, cofounder and CEO of Salesforce, attends a session at the Congress centre during the World Economic Forum in Davos, Switzerland, on January 17, 2023.Fabrice Coffrini | Afp | Getty ImagesShares of Salesforce closed down 20% Thursday, marking the stock’s worst day in nearly 20 years. Its worst trading day on record is July 21, 2004, when shares fell 27% just days after the company went public.The drop comes after Salesforce on Wednesday reported fiscal first-quarter results that missed Wall Street’s estimates for revenue for the first time since 2006. It also gave lighter-than-expected guidance.The cloud software vendor said revenue for the period increased 11% to $9.13 billion, which was shy of the $9.17 billion expected by analysts, according to LSEG.Salesforce expects second-quarter adjusted earnings per share of $2.34 to $2.36 on $9.2 billion to $9.25 billion in revenue. Analysts surveyed by LSEG were expecting $2.40 in adjusted earnings per share on $9.37 billion in revenue.Citi analysts said broader macroeconomic challenges “returned with a vengeance” during Salesforce’s first quarter. They noted that the period has also been weaker for other software companies, but that execution issues and changes to Salesforce’s go-to-market strategy also impacted the company’s performance.The analysts lowered their price target on the stock to $260 from $323.“With slowing growth, lack of de-risked estimates and more active M&A we are comfortable on the sidelines awaiting improving growth or more evidence of Data Cloud/GenAI momentum/monetization,” the Citi analysts wrote in a note Thursday.Other firms took a more optimistic position.Goldman Sachs analysts reiterated their buy rating on the stock and said they view Salesforce as a “high-quality software franchise.” They said that the company will need to win back confidence from investors but added that they believe easing interest rates, the end of the election cycle, and generative artificial intelligence will serve as growth catalysts.Goldman Sachs analysts said in a note Wednesday that Salesforce is “an under-appreciated Gen-AI winner.” They also see room for “meaningful margin expansion to take place,” the note said.Morgan Stanley analysts said it is hard to look at Salesforce’s results without having one’s confidence in its growth “somewhat shaken.” However, they believe the company will benefit from generative AI, particularly next year.The analysts maintained their overweight rating on the stock.“While the quarter was a disappointment and likely reduces investor conviction in a near-term rebound in growth, the evidence suggests impacts are more cyclical than secular,” they wrote in a note Thursday.— CNBC’s Michael Bloom and Jordan Novet contributed to this reportDon’t miss these insights from CNBC PRONvidia could be on the verge of a massive technical sell-off, chart analyst warnsTom Lee says the rotation out of large caps is just beginning, small caps to surge 15% in AugustBuy and hold these 5 attractively valued growth stocks for the next decade, the pros sayAvoid the ‘Magnificent 7’ and buy these lesser-known stocks instead, wealth manager saysCorrection: This story was updated to reflect Salesforce’s worst day was July 21, 2004, not July 4, 2004.",
    "favicon": "https://sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/favicon.ico"
  },
  {
    "title": "Decoding Salesforce’s plausible $11 billion bid to acquire Informatica",
    "link": "https://www.cio.com/article/2092247/decoding-salesforces-plausible-11-billion-bid-to-acquire-informatica.html",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNXhkMlJqV0dOQ05uazBWRGx3VFJDM0FSaVRBaWdCTWdrQmNaQXBzZWFKY3dF=-w400-h224-p-df-rw",
    "source": "CIO",
    "datetime": "2024-04-17T07:00:00.000Z",
    "time": "Apr 17",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Pacers Sports & Entertainment and Salesforce Announce Continued Partnership",
    "link": "https://fever.wnba.com/news/pacers-sports-entertainment-and-salesforce-announce-continued-partnership",
    "source": "Indiana Fever",
    "datetime": "2024-03-21T07:00:00.000Z",
    "time": "Mar 21",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "IBM and Salesforce Team Up To Help Businesses Accelerate Adoption of Trustworthy AI",
    "link": "https://newsroom.ibm.com/2023-08-31-IBM-and-Salesforce-Team-Up-To-Help-Businesses-Accelerate-Adoption-of-Trustworthy-AI",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUhNMDFsYUhOeGVuWnpNWGRwVFJDSkFSanZBaWdCTWdZTm9aUzBNQWM=-w400-h224-p-df-rw",
    "source": "IBM Newsroom",
    "datetime": "2023-08-31T07:00:00.000Z",
    "time": "Aug 31, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Selects Ironclad for Contract Lifecycle Management",
    "link": "https://www.prnewswire.com/news-releases/salesforce-selects-ironclad-for-contract-lifecycle-management-302107230.html",
    "image": "https://news.google.com/api/attachments/CC8iJkNnNHdhRWhwYlU5dVIza3pNRlJOVFJCOEdKWURLQUV5QXdHaEVB=-w400-h224-p-df-rw",
    "source": "PR Newswire",
    "datetime": "2024-04-03T07:00:00.000Z",
    "time": "Apr 3",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Time to Buy the Dip on Salesforce Stock?",
    "link": "https://www.fool.com/investing/2024/06/09/time-to-buy-the-dip-on-salesforce-stock/R",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVZURk5aTmxWWE5FRXlZVkJuVFJDM0FSaVRBaWdCTWdaRlFwYjBJQWs=-w400-h224-p-df-rw",
    "source": "The Motley Fool",
    "datetime": "2024-06-09T07:00:00.000Z",
    "time": "Jun 9",
    "articleType": "regular",
    "content": "",
    "favicon": "https://g.foolcdn.com/misc-assets/logo-tmf-primary-favicon.ico"
  },
  {
    "title": "Salesforce Stock Gains as CRM Software Giant Holds Its Annual Shareholder Meeting",
    "link": "https://www.investopedia.com/salesforce-stock-gains-as-crm-software-giant-holds-its-annual-shareholder-meeting-8670733",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVRVRVJxUW1oNGQySlVTR0owVFJDMUFSaVdBaWdCTWdZZHM1SktPUVk=-w400-h224-p-df-rw",
    "source": "Investopedia",
    "datetime": "2024-07-02T07:00:00.000Z",
    "time": "Jul 2",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce adds Contact Center updates to Service Cloud",
    "link": "https://www.cio.com/article/2074693/salesforce-adds-contact-center-updates-to-service-cloud.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVFSV010T1ZsVWNuQmlTV2syVFJDb0FSaXNBaWdCTWdhaG81SnN0UVk=-w400-h224-p-df-rw",
    "source": "CIO",
    "datetime": "2024-03-26T07:00:00.000Z",
    "time": "Mar 26",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce announces new AI-enabled copilots at Connections 2024",
    "link": "https://www.digitalcommerce360.com/2024/05/23/salesforce-einstein-copilot-features-connections-2024/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXZVR2xyYlRkVFJHSlBSR1JCVFJDb0FSaXNBaWdCTWdZSmhJQ0h1UVU=-w400-h224-p-df-rw",
    "source": "Digital Commerce 360",
    "datetime": "2024-05-23T07:00:00.000Z",
    "time": "May 23",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce abandons pursuit of Informatica, source says",
    "link": "https://www.reuters.com/markets/deals/salesforces-talks-buy-informatica-fizzle-wsj-reports-2024-04-21/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWZOVVpxUkZWMFRVOVhNM1oyVFJDM0FSaVRBaWdCTWdhTmdvUnFMUWM=-w400-h224-p-df-rw",
    "source": "Reuters",
    "datetime": "2024-04-21T07:00:00.000Z",
    "time": "Apr 21",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce to lobby for new rules on AI’s environmental impact",
    "link": "https://www.greenbiz.com/article/salesforce-lobby-new-rules-ais-environmental-impact",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTZVV1pzYW1OMmVtcG5kSE5qVFJDd0FSaWZBaWdCTWdZeEE1NVFEUXM=-w400-h224-p-df-rw",
    "source": "GreenBiz",
    "datetime": "2024-04-22T07:00:00.000Z",
    "time": "Apr 22",
    "articleType": "regular",
    "content": "Salesforce will begin lobbying for new regulations requiring companies to disclose emissions data and efficiency standards for artificial intelligence.\nThe company announced the move Monday as part of its new “Sustainable AI Policy Priorities.” It has previously published positions on ethics and equity related to AI, as have other big tech companies including Amazon, Google and Microsoft.\nSalesforce’s new policy comes amid growing concern over the amount of electricity required to train and run AI algorithms. Data centers already account for 2-3 percent of annual global power consumption. Demand could triple by 2030, accelerated by AI, according to Boston Consulting Group. That possibility has inspired Amazon, Google and Microsoft to look beyond solar and wind to other non-fossil fuel power sources, including nuclear and geothermal.\nSalesforce: 6 ways policy can support ‘sustainable AI’\nLike many software companies, Salesforce is vocal about ways AI could improve corporate sustainability such as reducing energy and water usage, monitoring biodiversity and planetary conditions, and speeding data collection for environmental, social and governance policy reporting. Its addition of specific concerns for AI is unique, but not surprising, given that it added “climate” to its public policy priorities in 2021.\n“The models that power AI require enormous compute resources to function, resulting in environmental impacts like increased energy demand, carbon emissions, water depletion and resource extraction,” Salesforce said in its brief. “Being mindful of AI’s environmental impact is crucial for ensuring that the technology develops in a way that supports a sustainable future.”\nSalesforce identified six priorities for new regulations and incentive programs, in two categories, summarized below:\nMeasuring and managing environmental impacts\nRequire AI emissions disclosure for “all providers of general-purpose AI models.” Salesforce wants standard metrics for reporting on energy efficiency and carbon footprints, as well as impacts such as the amount of water used by the data centers.\nAdd environmental impact as a risk factor. The amount of computing power AI training requires should be part of broader risk assessments, the company believes.\nEstablish efficiency standards for “high-risk” AI systems. These could include requiring certain hardware or making sure systems are powered by low-carbon grids or clean energy.\nAccelerating climate innovation with AI\nEnhance climate modeling, data analysis and predictions. Salesforce wants more open-source environmental data and forecast databases to be free for use by AI applications.\nEncourage public-private partnerships. The company is urging collaboration between governments, business and academia, so that communities can access AI-enabled services regardless of their resources.\nSpur AI-driven innovation. Salesforce would like to see grants and tax incentives that spur environmental applications.\nSalesforce began disclosing energy and environmental metrics related to its AI development activities in December. It’s working strictly on AI models that pertain to its core software applications, which “results in high-performing models that are smaller and more sustainable, cost-effective and easier to fine-tune,” said Boris Gamazaychikov, senior manager of emissions reductions at Salesforce, in that disclosure.\nThe company is using the most energy-efficient hardware available from Google’s cloud services unit to reduce AI emissions and is running these activities in data centers powered by lower-carbon sources, Gamazaychikov said.\nSalesforce — like Amazon, Google and Microsoft — is funding organizations and startups developing AI applications that could have climate benefits. On Monday, it announced support for five more nonprofits: Climate Collective Foundation, Good360, Groundswell, Ocean Risk and Resilience Action Alliance, and WattTime.\nHeather Clancy specializes in chronicling the leadership strategies enabling corporate climate action and the transition to a clean, inclusive and regenerative economy.\nAn award-winning journalist, she started her journalism career on the business desk of United Press International, and her articles have appeared in Entrepreneur, Fortune, The International Herald Tribune and The New York Times.",
    "favicon": "https://trellis.net/wp-content/uploads/2024/07/cropped-trellis_favicon_180x180.png?w=32"
  },
  {
    "title": "Salesforce debuts Zero Copy Partner Network to ease data integration",
    "link": "https://www.cio.com/article/2095136/salesforce-debuts-zero-copy-partner-network-to-ease-data-integration.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVFSV010T1ZsVWNuQmlTV2syVFJDb0FSaXNBaWdCTWdhaG81SnN0UVk=-w400-h224-p-df-rw",
    "source": "CIO",
    "datetime": "2024-04-25T07:00:00.000Z",
    "time": "Apr 25",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Stock Tanks On Weak Guidance Amid Hopes For Artificial Intelligence Boost",
    "link": "https://www.investors.com/news/technology/salesforce-stock-salesforce-earnings-news-q12024/",
    "source": "Investor's Business Daily",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Agrees to Settle ERISA Lawsuits",
    "link": "https://www.plansponsor.com/salesforce-agrees-to-settle-erisa-lawsuits/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNU5iV05GYjBKSmRsSkZRbWh4VFJDb0FSaXNBaWdCTWdhQklZaXRsUU0=-w400-h224-p-df-rw",
    "source": "PLANSPONSOR",
    "datetime": "2024-05-07T07:00:00.000Z",
    "time": "May 7",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Analyzing the Salesforce-Informatica Acquisition That Never Was",
    "link": "https://www.cxtoday.com/crm/analyzing-the-salesforce-informatica-acquisition-that-never-was/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNVNNMEk0WWtseWEyeFJXV3hmVFJDZkFSaS1BaWdCTWdrSkVJekdFdXhURGdJ=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-05-20T07:00:00.000Z",
    "time": "May 20",
    "articleType": "regular",
    "content": "Some of the most prominent CX analysts in the sector discuss the biggest ‘almost acquisition’ of the year.\nIn one of the biggest CX news stories of the year so far, back in April, it was reported that Salesforce was on the cusp of acquiring cloud data management provider Informatica.Both Bloomberg and The Wall Street Journal confirmed the story at the time, with the former publication actually predicting that it could be completed within days.Salesforce may well have been looking to leverage Informatica’s data integration and management platform, which could have been utilized to enhance the CRM provider’s Data Cloud and Einstein 1 solutions.However, by the following week, it had been reported that the deal was off due to the two tech firms’ inability to agree on terms, with an unnamed Bloomberg source attributing the impasse to a disagreement over price.While neither company has discussed why the proposed deal fell through, it may have been in response to the reaction of the market, with both companies experiencing share price drops after the news broke.While Salesforce has recovered somewhat since its initial 7% decrease, the potential takeover marked the start of a gradual decline for Informatica, with its price having fallen by almost nine dollars and currently at its lowest point since mid-February.Away from the stock market, the deal also garnered criticism from those within the CX sector, with Gaurav Dhillon – Co-Founder of Informatica and current CEO of SnapLogic – one of the more vocal naysayers.Dhillon described the proposed acquisition as a “real step backward” for Salesforce, as well as expressing concerns about the merger’s impact on Informatica’s users – predicting a “rocky road ahead” due to significant overlaps in integration products.The Co-Founder’s primary worry was how Informatica’s technology would coexist with MuleSoft, the integration platform Salesforce acquired for $6.5 billion in 2018 – claiming the issue could take years to resolve:With two disparate platforms, Salesforce now has to navigate merging MuleSoft’s technology with Informatica’s technology – a complex, time-consuming project that will likely take more than five years to complete.The topic was recently re-examined by some of the most prominent CX analysts in the sector during a CX Today Big CX News discussion.So, what did the experts have to say about the ‘almost acquisition’ of the year?The Deal that Never Was\nDespite playing their parts in a week-long will-they-won’t-they that could have rivalled Ross and Rachel in their prime, the potential acquisition looks set to remain a ‘what if’.And while the stock market and the likes of Dhillon suggest that this was for the best, interestingly, our CX analysts were fairly united in their view that the deal made a lot of sense for Salesforce in particular.For Martin Schneider, Head of Research at Annuitas Research, data quality is a long-standing issue within the CRM sector and has been something of an Achilles heel for Salesforce – describing Informatica’s data capabilities as the missing “puzzle piece” needed to complete Salesforce’s end-to-end, AI-driven, nextgen go-to-market story.“One thing that Informatica does incredibly well is data quality…. what it has been doing exceptionally well for a very long time is it kind of cleaning it up,” he said.Because just having a CDP is one thing but unless you actually have the data set right, there’s a lot more to actually making a free-flowing customer data value chain that’s adding value – and Informatica could really help there.Michael Fauscette, Founder, CEO & Chief Analyst at Arion Research, also believes that it would have been a “great acquisition” for Salesforce – outlining the enhancements that Informatica could have made to the backend of Data Cloud as a missed opportunity:“I mean if you think about what they’ve [Salesforce] done over the last couple years too, with Data Cloud, it really does complete that story from the backend, right? The part of how do I get the data prep and make sure the quality is there.”While both Schneider and Fauscette acknowledge that the price may have been too high, particularly when Informatica’s assets include many solutions and innovations that Salesforce already has, Zeus Kerravala – Principal Analyst at ZK Research – was surprised that Salesforce walked away from the deal, stating that:If an acquisition is a good acquisition, you can never pay too much for it.Kerravala expounded on his point, describing Salesforce’s data management as a “mess” and discussing the wider industry issue with data quality among enterprise customers:“The one thing holding them [Salesforce] back from more AI is data quality … Salesforce customers are notorious for putting bad data into Salesforce, and bad data leads to bad output, right?“So, if there’s one thing they needed, it was a company like Informatica to actually help them with that. So I was pretty optimistic they would do this because I thought it would really help them.”You can watch the analysts’ full discussion about the Salesforce-Informatica acquisition that never was, and a range of other topics here.\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Informatica Co-Founder: The Salesforce Acquisition Is \"a Bad Idea\"",
    "link": "https://www.cxtoday.com/crm/informatica-co-founder-the-salesforce-acquisition-is-a-bad-idea/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNDFWSFV3ZGxvNVdsZHFSMVkzVFJDZkFSaS1BaWdCTWdtbEFZaTIwR09EcHdJ=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-04-18T07:00:00.000Z",
    "time": "Apr 18",
    "articleType": "regular",
    "content": "Gaurav Dhillon also suggested that the potential deal is a \"real step backward\" for Salesforce\nSalesforce is on the cusp of acquiring global data integration platform provider Informatica, according to reports in The Wall Street Journal and Bloomberg.Bloomberg – citing “people familiar with the matter” – has even intimated that the two companies might finalize an agreement by the end of the week.While talk of the potential merger has generated a lot of buzz in the CX tech space, not all of it has been positive.After the news broke, Gaurav Dhillon – the Co-Founder of Informatica and current Chief Executive of Software Company SnapLogic – blasted the reported acquisition, describing it as a “real step backward” for Salesforce.Dhillon was also critical of how the merger would impact Informatica’s users, claiming that it would be a “rocky road ahead for Informatica customers due to the significant overlap in integration products.”Dhillon’s major concern with the proposed acquisition appears to be how Informatica’s technology will co-exist alongside MuleSoft, the integration platform that Salesforce purchased for $6.5b in 2018.Indeed, the Co-Founder outlined how he believed the complications affiliated with integrating Informatica could take years to resolve:With two disparate platforms, Salesforce now has to navigate merging MuleSoft’s technology with Informatica’s technology – a complex, time-consuming project that will likely take more than five years to complete.For Dhillon, the proposed acquisition is a “massive validation and an ‘I-told-you-so’ moment for SnapLogic, a company that was founded on the premise that one unified platform is needed for application and data integration.”While one could argue that Dhillon’s criticism of the potential merger may contain a degree of bias, especially considering he is using it to champion his current company, he is not the only industry voice who is skeptical about the deal.Guggenheim Securities Analyst John DiFucci also highlighted the issue of Salesforce having to navigate multiple tech platforms, stating that “Informatica competes directly with MuleSoft.”In addition, the tech advisor cast doubts over Salesforce’s ability to oversee a successful merger, describing the company as having a “mixed M&A integration track record.”Lastly, DiFucci pointed out that the merger could alienate some of Informatica’s existing customers as it would result in the company losing its ‘Switzerland’ status.How Has the Stock Market Reacted?Perhaps more worrying for Salesforce and Informatic than the opinions of two industry professionals is the fact that the market appears to agree with them.Following the reports, both companies have seen drops in share prices.\nAt the time of writing, Salesforce is currently 7.9 percent down in the past week, and Informatica has seen an 8.5 percent decrease, with its share price dropping by almost four dollars a share.This news is particularly problematic for Informatica, who will undoubtedly want to go through with the acquisition when its share price is at its healthiest.With the wider industry clearly skeptical, what benefits could Salesforce reap from the acquisition?Informatica’s Selling PointsAs the race to integrate and maximize AI solutions continues to hot up, the ability of Informatica’s data integration and management platform to support AI deployments will clearly be a major selling point.With the power to facilitate the organization, refinement, and utilization of customer data for businesses, Informatica’s platform holds the potential to enhance Salesforce’s Data Cloud, which powers the AI models of its Einstein 1 Platform.Moreover, Informatica could improve the metadata layer within the Einstein 1 platform, ensuring seamless data integration across various Salesforce applications and enabling platform updates without disruption.If the deal proceeds, Salesforce is expected to prioritize enhancing Data Cloud and metadata capabilities. This aligns with its strategy of combining AI, data, and CRM to shape the future of customer experience.Salesforce is Keeping BusyAway from the potential acquisition of Informatica, it has still been a busy month for Salesforce.Last week, the cloud-based software company announced the launch of its Public Sector Einstein 1 for Service solution, with the aim to enhance governmental customer service.The solution equips government employees with CRM functionalities, AI capabilities, and improved data tools, enabling the automation of administrative tasks and improving the overall constituent experience.In addition, the company recently debuted the widespread availability of its Unified Conversations service on WhatsApp.The integration empowers businesses to utilize WhatsApp for improved marketing promotions or service requests, fostering dynamic two-way communication.\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Salesforce-Informatica acquisition talks fall through: Report",
    "link": "https://www.cio.com/article/2093946/salesforce-informatica-acquisition-talks-falls-through-report.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXhkMnRIUWpoa0xXWkxSVmd3VFJDM0FSaVVBaWdCTWdhUmNaSUpyUWM=-w400-h224-p-df-rw",
    "source": "CIO",
    "datetime": "2024-04-22T07:00:00.000Z",
    "time": "Apr 22",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce plummets as weak forecast sparks concerns of AI competition",
    "link": "https://www.reuters.com/technology/salesforce-plummets-weak-forecast-sparks-concern-ai-competition-2024-05-30/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXNiMnhSVFhFd2VqUTFOa3BHVFJDM0FSaVRBaWdCTWdZWmNwWUtxUWM=-w400-h224-p-df-rw",
    "source": "Reuters",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce: Your Job’s at Risk If You Sell Less Than $400k a Year",
    "link": "https://www.saastr.com/salesforce-your-jobs-at-risk-if-you-sell-less-than-400k-a-year/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTBkekJYVEUxRFlUUnZNa05PVFJEUUFSanlBU2dCTWdhRkVaSUhGUXM=-w400-h224-p-df-rw",
    "source": "SaaStr",
    "datetime": "2023-12-12T15:57:42.000Z",
    "time": "Dec 12, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce stock just had its worst day in 20 years",
    "link": "https://qz.com/salesforce-stock-just-had-its-worst-day-in-20-years-1851510447",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDFka2xTVEhsNU5IUkplSFUyVFJDM0FSaVRBaWdCTWdZQmNvYnB6UU0=-w400-h224-p-df-rw",
    "source": "Quartz",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Spring ’24 Release Highlights",
    "link": "https://www.forvismazars.us/forsights/2024/02/salesforce-spring-24-release-highlights",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNTVVWGhZU1UxVU5sbDBNRFZEVFJDb0FSaXNBaWdCTWdrRkFZaXR1ZVF0SVFN=-w400-h224-p-df-rw",
    "source": "Forvis Mazars",
    "datetime": "2024-02-05T08:00:00.000Z",
    "time": "Feb 5",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce drops after reports it’s in talks to acquire Informatica",
    "link": "https://www.cnbc.com/2024/04/15/salesforce-drops-after-reports-it-is-in-talks-to-acquire-informatica-.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHRXRGx6TlcxeVkxVlNWM1pWVFJDb0FSaXJBaWdCTWdhZEFvck1qUW8=-w400-h224-p-df-rw",
    "source": "CNBC",
    "datetime": "2024-04-15T07:00:00.000Z",
    "time": "Apr 15",
    "articleType": "regular",
    "content": "TechPublished Mon, Apr 15 202412:29 PM EDTUpdated Mon, Apr 15 20244:03 PM EDTKey PointsSalesforce shares fell 7% on Monday after reports that the company is in talks to buy Informatica.Shares of Informatica dropped 6% Monday following the reports.Informatica, with a market cap of over $10 billion, would be Salesforce’s largest purchase since the company bought Slack for nearly $28 billion in 2021.People pass by the Salesforce Tower and Salesforce.com offices in New York City on March 7, 2019.Brendan McDermid | ReutersSalesforce shares closed down 7% on Monday after reports over the weekend that the cloud software company is in advanced talks to buy data-management firm Informatica.Shares of Informatica, which has a market cap of around $10 billion, closed down 6% following the reports.The price being weighed is below Informatica’s closing stock price on Friday of $38.48, according to The Wall Street Journal, which first reported the talks on Friday. A Reuters article said the deal could be announced soon. Neither publication provided specifics on the size of a potential transaction.Regardless, it would be Salesforce’s largest deal since purchasing Slack for nearly $28 billion in 2021, the company’s largest acquisition to date.Prior to Slack, Salesforce bought data visualization company Tableau for $15.3 billion in 2019, and MuleSoft for $6.5 billion in 2018.Salesforce declined to comment on the reports. Informatica didn’t respond to CNBC’s request for comment.Don’t miss these stories from CNBC PRO: ‘Big bargains’: Morgan Stanley names 3 overlooked global tech stocks, giving one almost 100% upsideA Chinese smartphone maker is breaking into EVs and challenging Tesla. How the stock rates now.Bank of America says this chip stock is ready for its AI moment and to buy it before Thursday’s eventTesla shares have tanked 34% this year. Investors raise doubts over whether the EV maker will return to form",
    "favicon": "https://sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/favicon.ico"
  },
  {
    "title": "Salesforce looks to reinvent itself again with its fledgling AI business",
    "link": "https://www.marketwatch.com/story/salesforce-looks-to-reinvent-itself-again-with-its-fledgling-ai-business-35638ac4",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNDRTRFJ3Ylc5aVJGRTJOR1JwVFJEaEFSamhBU2dCTWdhMVFvb3luUWs=-w400-h224-p-df-rw",
    "source": "MarketWatch",
    "datetime": "2024-03-25T07:00:00.000Z",
    "time": "Mar 25",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "VA and Salesforce help Veterans translate military experience into civilian careers",
    "link": "https://news.va.gov/131307/va-salesforce-translate-military-civilian/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNHdaa3BmVWpnNGIwbHBNVU56VFJDb0FSaXNBaWdCTWdtQk1KQXJIaW91N1FF=-w400-h224-p-df-rw",
    "source": "VA.gov Home | Veterans Affairs",
    "datetime": "2024-05-17T07:00:00.000Z",
    "time": "May 17",
    "articleType": "regular",
    "content": "*Edit, May 5: “The Salesforce fellowship is currently only open to military spouses and transitioning service members.”\nVeterans are up to 38% more likely to be underemployed than the general population, though the unemployment rate for Veterans has improved compared to non-Veterans, at 2.9% and 4.1% respectively. Military spouse unemployment rates have recently increased from 22% to 38%, due in large part to frequent relocations, and 88% of surveyed military spouses agree that the military lifestyle results in underemployment.\nEmployment insecurity can be detrimental to health, and quality employment is an essential condition for health equity. This is why VA’s National Center for Healthcare Advancement and Partnerships (HAP) partners with organizations that support employment and career development to improve the health and well-being of Veterans, their families, caregivers and survivors.\nVA, in a partnership facilitated by HAP, collaborates with Salesforce to provide resources and tools for transitioning service members (TSMs), Veterans and their spouses pursuing careers in technology. Military community members can use Trailhead, Salesforce’s free online learning platform, and Salesforce Military’s free training resources to advance current careers or pursue new career paths outside of the military. They can also access the Trailblazer community to join groups and grow professional networks.\n“Through collaboration with community partners like Salesforce, HAP helps Veterans and their spouses find fulfilling careers outside of the military,” said Christine Eickhoff, HAP health system specialist. “Community partners are a force multiplier that contribute new resources in addition to what VA already provides in the effort to address unemployment and underemployment rates for Veterans and military spouses.”\nTranslating military skills for a civilian workforce\nDue to differences in job classification systems and difficulty translating military experience and job titles, TSMs, Veterans and even civilian employers face challenges during the hiring process. These challenges can lead Veterans to obtain duplicative skills and certifications or facing periods of unemployment or underemployment.\n“Salesforce encourages its employees to ‘be your true self’ at work,’” said Mike Nolan, senior manager, Military Recruiting. “It’s because of our culture that we strongly encourage TSMs, Veterans and spouses to build their personal brands and make connections with other employees from the military community. Leveraging the shared military bond encourages conversations, which lead to friendships that help translate how military experience aligns with the civilian workforce.”\nSalesforce partners with Hiring Our Heroes to provide TSMs and military spouses with paid, hands-on experience through 12-week fellowships.\nShannon Allena, a recent Salesforce Fellow, had a successful career as a consultant before becoming a military spouse. Allena struggled to continue pursuing her career goals due to the frequent moves and finally decided to pursue a Salesforce administrator certification. Through networking, Allena found the Salesforce Fellowship program and was matched with the Military Recruiting Program.\n“The Fellowship program has been a great success,” said Nolan. “We hosted 47 fellows last year, which was also the first year we offered the program internally, and we have plans to host 100 Fellows in 2024. We’re excited to be able to give Shannon a position where she can shine and do things we’ve never done in the Military Recruiting Program.”\nAllena was the first fellow hosted by Salesforce’s Military Recruiting Program, and she recently accepted a full-time position as Military Recruiting Program manager, Marketing and Operations.\nWhen asked about challenges faced in her new role, Allena said, “With the skills I learned during my fellowship I was able to smoothly transition into a full-time position with Salesforce. Knowing the tools, networking with many people in the organization, and learning about the Military Recruiting Program’s future goals allowed me to hit the ground running.”\nThe team values her organizational skills and her background in digital marketing, and Allena will be involved in several future program updates, such as a fellowship mentor initiative and scaling the program beyond the U.S.\n“I’m passionate about the cause of helping military spouses find careers and career advancement,” said Allena. “Even though losing my career as a consultant was devastating, I had to go through that journey to get where I am now. I feel like I’m finally in a place where I belong.”\nAdditional VA and Salesforce resources\nIn addition to helping TSMs, Veterans and their spouses advance their careers, VA and Salesforce make it easy to learn about VA benefits and mental health resiliency resources. The Veteran Mental Health and Resiliency Resources and VA Benefits for Veterans Trailhead modules help Veterans and military spouses quickly learn about and access these benefits.",
    "favicon": "https://news.va.gov/wp-content/uploads/sites/3/2021/07/favicon-32x32-1.png"
  },
  {
    "title": "Access Amazon Redshift data from Salesforce Data Cloud with Zero Copy Data Federation",
    "link": "https://aws.amazon.com/blogs/big-data/access-amazon-redshift-data-from-salesforce-data-cloud-with-zero-copy-data-federation/",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNXRUbTFCTjAxYU9HVkpiVzUzVFJDb0FSaXNBaWdCTWdNQlZRNA=-w400-h224-p-df-rw",
    "source": "AWS Blog",
    "datetime": "2024-06-25T07:00:00.000Z",
    "time": "Jun 25",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce laying off 700 workers in latest tech industry downsizing - WSJ",
    "link": "https://www.reuters.com/technology/salesforce-laying-off-700-workers-latest-tech-industry-downsizing-wsj-2024-01-26/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHpPVVIxUVVGRVRGTlhValZtVFJDNkFSaVBBaWdCTWdhZFVwZ3JJUWs=-w400-h224-p-df-rw",
    "source": "Reuters",
    "datetime": "2024-01-25T08:00:00.000Z",
    "time": "Jan 25",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce to hire 3,300 people after layoffs earlier this year, Bloomberg reports",
    "link": "https://www.reuters.com/technology/salesforce-hire-3300-people-after-layoffs-earlier-this-year-bloomberg-news-2023-09-15/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXdZV015TFhSWlgxQlhlRFZFVFJDM0FSaVRBaWdCTWdhTmxKQ25OUVk=-w400-h224-p-df-rw",
    "source": "Reuters",
    "datetime": "2023-09-14T07:00:00.000Z",
    "time": "Sep 14, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Oracle Vs. Salesforce (2024 Comparison)",
    "link": "https://www.forbes.com/advisor/business/software/oracle-vs-salesforce/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNXFkbEZ4VkVGRWJXMU9SVGxxVFJDb0FSaXJBaWdCTWdraFFZNk1KZWhVa0FF=-w400-h224-p-df-rw",
    "source": "Forbes",
    "datetime": "2024-06-28T07:00:00.000Z",
    "time": "Jun 28",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Reportedly Institutes ‘4 to 5 Days A Week’ RTO Mandate",
    "link": "https://www.uctoday.com/collaboration/salesforce-reportedly-institutes-4-to-5-days-a-week-rto-mandate/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXpOa3RTVm5wQ1ZtVXRjRzlUVFJDZkFSaS1BaWdCTWdZcFVZNlduQWs=-w400-h224-p-df-rw",
    "source": "UC Today",
    "datetime": "2024-07-22T09:49:27.000Z",
    "time": "Jul 22",
    "articleType": "regular",
    "content": "An internal Salesforce memo told employees they must return to their desks by October 1\nSalesforce has reportedly instituted a “four-to-five days a week” Return To Office (RTO) mandate for some employees.In an update of its RTO policy, which previously empowered leaders to make “decisions for their teams about how and where they work”, Salesforce is allegedly mandating many of its employees to return to the office.The San Francisco Standard reported that Salesforce employees received an internal email announcing the shift from remote to in-office and hybrid working will begin this autumn, on October 1.A Salesforce spokesperson told KRON4:Salesforce is a place where connection and relationships drive success. We believe being together in person deepens relationships, sparks innovation, fosters learning, and strengthens culture — ultimately, resulting in better business outcomes.”More Specifics On The New MandateSalesforce will have three hybrid work policies assigned to different departments within the business: “remote”, where employees work primarily from home; “Office-Flex”, where they work in-office three days a week; and “Office-based”, where they work in-office four to five days a week.The memo reported that the sales, workplace services, and data centre engineering departments, as well as the onsite support technicians reporting to the Chief Information Officer, will be mandated to work from the office four to five days a week starting from October 1.The remaining departments, including marketing, legal, and product teams, will be “office-flex” moving forward. Other engineering roles also fall under this category, with the stipulation of at least ten office days each quarter.Full remote work will be an exception rather than the norm, granted only under specific circumstances, such as working from a client’s site. The new guidelines specify that such exemptions will be rare, with one example being engineers dedicated to Salesforce’s Heroku platform.Salesforce will also introduce an internal dashboard next month to encourage in-person attendance. The dashboard will track data from employee badge scans within the US. The business emphasises that employees will have “full visibility” of their attendance data. The initiative intends to align employee attendance with quarterly team goals. Additionally, the dashboard will monitor employees’ average voluntary time off, including time allocated for community service efforts.“We have always had a hybrid approach, which provides flexibility to meet the evolving needs of the business and helps attract and retain world-class, diverse talent,” the Salesforce spokesperson added. “Our hybrid work guidelines focus on in-person connection while recognising the value of work away from the office.”\nThe software company’s headquarters is on Mission Street, within the Salesforce Tower, in the heart of San Francisco, making it the city’s largest employer. However, the new policy applies to Salesforce workers worldwide.The same week that Salesforce established these new in-person work expectations, the company also announced a fresh round of layoffs affecting 300 employees. This compounded the 700 workers laid off earlier this year and the 7,000 roles terminated at the beginning of 2023.The RTO vs Remote Debate Coming To A Head In 2024In 2022, Salesforce CEO Marc Benioff said, “Office mandates are never going to work”. Naturally, that position has been backtracked, as illustrated by this new mandate. However, Salesforce isn’t the only tech giant grappling with what hybrid or RTO policy works best for them while supporting employees.Last week, Amazon reportedly started tracking the hours corporate workers spend in the office. Business Insider said the move is to address the rise of “coffee badging”, the purported trend of employees badging into the office, getting coffee and then leaving shortly after to circumvent Amazon’s in-office three-days-a-week RTO mandate.Meanwhile, in February, Dell imposed a company-wide RTO mandate requiring all employees to work onsite for at least 39 days a quarter.The new hybrid work policy, which averages three days per week in the office, expanded on a return-to-office mandate introduced last year. This previous mandate required employees living within an hour of an office to be onsite at least three days a week.In an echo of Salesforce’s u-turn on remote and hybrid working, this 2023 policy superseded Dell’s 2020 commitment during the pandemic, which promised that 60 percent of its workforce would only need to work on-premises once or twice weekly.The Register also reported that a source close to the situation added that workers below a particular pay grade and level of seniority could choose to work fully remotely, but that decision could negatively impact their career opportunities at the tech giant.Last year, KPMG’s CEO Outlook survey for 2023 highlighted that almost two-thirds of CEOs want to kill hybrid work within three years.The survey, which included responses from 1,325 CEOs of businesses with revenues over $500 million, revealed that 64 percent of CEOs plan to return to a fully on-site working model within the next three years. Additionally, 87 percent of CEOs intend to achieve this goal by linking financial incentives and promotion opportunities to on-site attendance.\nBrands mentioned in this article.",
    "favicon": "https://www.uctoday.com/wp-content/uploads/2023/01/android-icon-192x192-1-150x150.png"
  },
  {
    "title": "SF's Salesforce loses $50 billion in value, worst day in years",
    "link": "https://www.sfgate.com/tech/article/salesforce-worst-stock-market-day-19486484.phpR",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHlUUzFmZHpWM1JqQkhkM0ZhVFJDM0FSaVRBaWdCTWdhTkNJS0hFZ3M=-w400-h224-p-df-rw",
    "source": "SFGATE",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Reports: Salesforce abandons plans to acquire Informatica",
    "link": "https://siliconangle.com/2024/04/22/reports-salesforce-abandons-plans-acquire-informatica/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVlaVlJpV0dwMVNIcGtSbmczVFJDbkFSaXNBaWdCTWdhWlU0aU9wUVk=-w400-h224-p-df-rw",
    "source": "SiliconANGLE News",
    "datetime": "2024-04-22T07:00:00.000Z",
    "time": "Apr 22",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "IQVIA and Salesforce Expand Global Partnership to Accelerate the Development of Life Sciences Cloud",
    "link": "https://www.iqvia.com/newsroom/2024/04/iqvia-and-salesforce-expand-global-partnership-to-accelerate-the-development-of-life-sciences-cloud",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTRMVkJIVDFaUVFsRlNPRk5DVFJEQ0FSaURBaWdCTWdZSm9wYUhPZ2M=-w400-h224-p-df-rw",
    "source": "IQVIA",
    "datetime": "2024-04-08T07:00:00.000Z",
    "time": "Apr 8",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Genesys Innovates with Salesforce and ServiceNow, Leads a New Era of CCaaS-CRM Convergence",
    "link": "https://www.cxtoday.com/contact-centre/genesys-innovates-with-salesforce-and-servicenow-leads-a-new-era-of-ccaas-crm-convergence/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUJOMmN5ZEhGWVpWQjBkWFpEVFJDZkFSaS1BaWdCTWdZQkU0Z0Vtd1k=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-05-24T07:00:00.000Z",
    "time": "May 24",
    "articleType": "regular",
    "content": "Recent collaborations with Salesforce and ServiceNow demonstrate Genesys’ vision for the future of CCaaS\nAt Xperience 24, Genesys and ServiceNow announced a joint offering, which will become generally available later this year.The Unified Experience from Genesys and ServiceNow platform promises to pull the former’s voice, journey orchestration, and workforce engagement management (WEM) capabilities into the ServiceNow Customer Service Management (CSM) solution.In this sense, it’s similar to the CX Cloud from Genesys and Salesforce, which launched in 2023.These offerings aren’t just closer integrations. Instead, they mark a shift from CCaaS and CRM providers “working together” to acting almost as a single entity.Indeed, Genesys set up cross-company co-innovation teams to bring both platforms to life.These co-innovation teams have developed a unified data fabric, a shared no-code orchestration engine, and a single desktop experience within both Salesforce Service Cloud and ServiceNow CSM.Moreover, the joint platforms include synchronized bots and channels. Meanwhile, end-users may pull other AI use cases from both vendors into their chosen solution a la carte.Simon Harrison, Founder & CEO of Actionary, suggested during a recent episode of the Big CX Update, that’s an altogether winning proposition. He said:The sum of the parts here is greater than just bringing these two technologies together. It creates more of an ecosystem that better supports agent and customer experiences.Interestingly, it also allows Salesforce and ServiceNow to close the gap between their CRM platforms and premium CCaaS offerings.While that may be good news for customers, it perhaps raises some tricky questions about the future of the CCaaS space.The Future of CCaaSCRM platform providers are encroaching on the CCaaS space by adding channel routing, agent-assist, and many more core contact center tools to their offerings.That trend may worry many CCaaS vendors, as Harrison noted:\nLook at CRM and customer engagement center solutions. If a CCaaS vendor goes in to pitch to a customer after one of these guys, the customer will be asking, “Where’s the rest of it?That said, the trend is unlikely to make CCaaS platform providers obsolete. After all, CRM vendors like Salesforce and ServiceNow are unlikely to revel in the burden of building out that all-important voice global voice network infrastructure.Indeed, their license margins are healthy. Adding the cost and complexity of supplying a voice capability will reduce those significantly.Moreover, CRM vendors understand the risk that if they acquire a CCaaS vendor, they make an enemy of all the others.As such, it’s unlikely that CRM will swallow up CCaaS providers. Although, some may argue that CCaaS could become marginalized into the field of voice plumbing and plug-ins.Yet, according to Harrison, CCaaS providers have long been wary of this threat – and that’s a significant reason why they’re moving further into the realms of WEM, journey orchestration, and conversational AI: they’re building out the value of what a CCaaS platform does.Now that Genesys has done so, it aims to step ahead of the CRM and CCaaS convergence trend and influence its direction on its own terms. As Harrison summarized:This is a smart move for Genesys in particular.As Genesys continues along this path and perhaps chooses to co-innovate with other CRM leaders, expect to come across the term “XaaS” a lot more.The acronym stands for experience as a service (XaaS), and – as Genesys bridges the gap with CRM platforms – it will likely use this to underline how it is converging the CX ecosystem.Alongside the Unified Experience from Genesys and ServiceNow, Genesys also made several other announcements at Xperience 24. For the full rundown, check out our article: Genesys Releases an Agent Copilot, Teases a Next-Gen Virtual Agent\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Salesforce Crowned King of CRM for the 11th Year Running",
    "link": "https://www.cxtoday.com/crm/salesforce-crowned-king-of-crm-for-the-11th-year-running/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWhhVWh1Y2twaWQyWjZUbXhVVFJDZkFSaS1BaWdCTWdhQkVvd0RFd3M=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-05-02T07:00:00.000Z",
    "time": "May 2",
    "articleType": "regular",
    "content": "Its market share is larger than Microsoft, Oracle, SAP, and Adobe combined.\nSalesforce is the number one CRM provider in the world, according to a recent study conducted by the International Data Corporation (IDC).Celebrating its 11th consecutive year at the top of the charts, Salesforce boasts a record that Ed Sheeran would be proud of.The report revealed that for 2023, Salesforce had a market share of 21.7% – over three times the size of Microsoft (5.9%) in second place, and more than the combined total of its nearest four competitors.Oracle (4.4%), SAP (3.5%), and Adobe (3.4%) all failed to crack the five percent mark, with the graph below highlighting Salesforce’s dominance in the sector:Source: IDC 2024 Worldwide Semiannual Software TrackerIn discussing another successful showing for his company, David Schmaier – President and Chief Product Officer at Salesforce – commented:Salesforce earning the #1 rank globally once again underscores our unwavering commitment to helping our customers connect with their customers in a whole new way.“As we push the boundaries of what’s possible with CRM, AI, data, and trust on the Einstein 1 Platform, Salesforce is well positioned to lead the industry through this AI innovation cycle – delivering far greater productivity, stronger relationships with customers, and optimized daily workflows and processes for companies around the world.”The results form part of IDC’s Worldwide Semiannual Software Tracker, which forecasts the development of software companies across 52 geographies and 79 discrete software market segments.As well as claiming top spot in the worldwide CRM provider category, Salesforce was also named the number one market share leader in North America, Latin America, Western Europe, and Asia-Pacific (including Japan).Other notable triumphs included being ranked first in the following areas: Sales for the 12th year, Customer Service for the 11th year, and Marketing for the fifth year.So, what exactly is the secret to Salesforce’s success? And were there any surprise omissions from the top five?Lessons from the KingAs mentioned in the above comments by Schmaier, Salesforce’s Einstein 1 Platform has been a key factor in the company’s recent success.A relaunch of the original Salesforce Platform, the Einstein 1 was announced in September of last year under the tagline “A Trusted AI Platform for Customer Companies.”The solution consolidates all of the vendor’s CRM and Einstein apps, Data Cloud, and more.\nIn addition, despite being low-code, it is also an open platform – supporting various data, LLM, and independent software vendors.This initiative aims to assist Salesforce in its goal of offering a unified platform for customers to integrate their data seamlessly.Typically, such projects involve multiple applications, creating data lakes, and connecting disparate APIs from various vendors, which often hampers transformation efforts.With Einstein 1 as an open platform however, Salesforce aims to overcome these obstacles.Conspicuous by its AbsenceWhile the results of this year’s IDC report did not contain any major surprises – with the top five market sharers remaining in the same positions and only fluctuating slightly from a year ago – many within the customer service space may have expected HubSpot to make an appearance.Despite the company being less than fifteen years old, HubSpot reached two major milestones earlier this year, having surpassed 100,000 paying customers and breaking $1 billion in annual recurring revenue.A key driver behind HubSpot’s success has been its agility in aligning with market and customer demands.Initially concentrating on inbound methodology and a marketing automation app, it has transformed into a comprehensive CRM platform with 600+ integrations and extensive educational resources.Additionally, a pivotal move toward catering to scaling companies has propelled HubSpot’s ascent in the CRM arena.While these achievements have already led to a 41% share price increase year-on-year, it will be interesting to see whether HubSpot can continue this upward trajectory and threaten the monopoly of the big five CRM providers.What Else is New in the World of Salesforce?Undoubtedly hoping to further enhance the offerings of its Einstein 1 Platform, Salesforce has now announced the general availability of Einstein Copilot, its conversational AI assistant for CRM.Powered by generative AI (GenAI), Einstein Copilot is seamlessly integrated into all Salesforce applications, allowing employees to interact with it to perform various tasks and ask questions using natural language.Salesforce also distinguishes its solution from other AI assistants and chat tools by offering unified capabilities.Moreover, Copilot can access data from Salesforce’s Data Cloud and is compatible with Salesforce metadata. This allows Copilot within one CRM system to utilize data from other Salesforce solutions, facilitating cross-application workflows.\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Salesforce May Acquire Informatica For More Than $11B: Reports",
    "link": "https://www.crn.com/news/cloud/2024/salesforce-may-acquire-informatica-for-more-than-11b-reports",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHlObFpLUW5VM1pUaFNMVTFaVFJEQ0FSaURBaWdCTWdZRmdvNnNyUWM=-w400-h224-p-df-rw",
    "source": "CRN",
    "datetime": "2024-04-15T07:00:00.000Z",
    "time": "Apr 15",
    "articleType": "regular",
    "content": "CloudSalesforce’s biggest acquisition was the $28 billion purchase of Slack in 2021.\nSalesforce reportedly wants to buy artificial intelligence-powered cloud data management vendor Informatica, according to multiple news outlets, not long after its frequent acquisitions put Salesforce in the crosshairs of activist investors.Should Salesforce – a San Francisco-based customer relationship management software vendor – buy its neighbor in Redwood City, Calif., the deal would be among the largest for the CRM software company, according to The Wall Street Journal.Salesforce’s biggest acquisition was the $28 billion purchase of Slack in 2021. An Informatica deal could come within a week, according to Bloomberg. The news comes shortly after reports of Google’s parent company Alphabet looking to buy Salesforce rival HubSpot.[RELATED: Activist Investors Cut Salesforce Some Slack]Salesforce Reportedly Eyes InformaticaCRN has reached out to Salesforce and Informatica for comment.Salesforce has about 12,000 partners, according to the vendor. Informatica has a partner program for systems integrators, resellers and other business models, according to the company.Salesforce has a market capitalization of about $265 billion. Informatica has a market capitalization of about $10 billion. It went public for a second time in 2021, and private equity firm Permira and the Canadian Pension Plan Investment Board (CPPIB) hold a controlling stake of more than 75 percent in the vendor, according to Reuters.Salesforce shares traded at about $275 Monday afternoon, down about 3 percent from market opening. Informatica shares traded at about $35 a share Monday afternoon, down about 7 percent from market opening.Analysts Weigh InAt least three analyst firms have written reports outlying pluses and minuses in a potential Salesforce-Informatica deal.On Monday, William Blair analysts wrote about a potential deal favorably, saying in part that should the deal succeed, Salesforce becomes “more competitive with the data warehouses and data lakes like Snowflake.”“To be clear, we believe Salesforce still has a long way to go to achieve this and it will need to deliver from a product perspective, but we believe we are starting to see the strategy forming,” according to the William Blair report.It continued: “We believe it will ultimately position the company more favorably longer term to capitalize on the upcoming gen AI cycle over the next decade.”A potential deal could “weigh on Salesforce shares in the interim,” according to William Blair, especially after Salesforce’s enthusiasm for acquisitions and lack of attention on margins led to an offensive effort last year from activist investors including Elliott Investment Management and ValueAct Capital Partners.The activists backed down after Salesforce conducted mass layoffs and a multi-year profitable growth framework.Informatica forecasted $1.7 billion in revenue in 2024 with 32 percent operating and unlevered free cash flow margin, not using generally accepted accounting principles (GAAP), according to William Blair.The firm said a potential acquisition could complement Salesforce’s Data Cloud offering, a key part of the vendor’s AI push.“Informatica will help enhance the volume and relevancy of data that is inside Salesforce Data Cloud, which should drive value for customers who are looking to Salesforce to provide more holistic services to help power their gen AI applications,” according to William Blair.It continued: “As Salesforce has telegraphed, its near-term M&A strategy is focused on enhancing Data Cloud and the company’s role in providing its customers the necessary tools to be successful in deploying gen AI. This is clearly the purpose of a potential acquisition of Informatica, which provides data management software to enterprises.”William Blair also said a potential acquisition would be complementary to Salesforce data integration subsidiary MuleSoft, bought in 2018 for about $6.5 billion.Salesforce watchers might question the price tag, which could be around $14 billion, but if “gen AI is the long-term opportunity we believe it to be—and we do believe it is a significant opportunity—the price tag can be justified, especially if Informatica’s data management capabilities can meaningfully improve Salesforce’s positioning of Data Cloud and gen AI,” according to William Blair.Should a deal close, a possible hill in integrating the two businesses is Informatica’s annual recurring revenue (ARR), of which 60 percent or so is on premises, according to William Blair.Only about 5 percent of Informatica’s $1 billion on-premises ARR has migrated to the cloud to date, according to William Blair.A second analyst firm, Bernstein, wrote in a report Sunday that “we believe that investors are not going to be happy and this acquisition could answer for many whether Salesforce can re-accelerate growth on their own.” The firm put the potential price tag for Informatica at more than $11 billion.“Informatica’s gross margin of ~79 percent last year would not present a big issue but their operating margin of 5.9 percent would,” according to Bernstein.Salesforce likely wants Informatica so that it can better compete with Microsoft, Oracle and Snowflake, according to the Bernstein report. “If Salesforce acquires Informatica, it could hurt Snowflakes’s prospects.”In a Monday report from KeyBanc, analysts said that Informatica could “fit nicely” in the holes in Salesforce’s “technological capabilities in the movement and cleansing of data.” The analysts viewed a potential Informatica acquisition “positively from a strategic point of view.”On the plus side, “interest in Informatica may signal that there is more demand for Data Cloud and AI-related workloads than Salesforce can currently handle and getting technology in place sooner rather than building it organically is every bit a capacity calculation as it is a strategic one,” according to KeyBanc.However, the potential acquisition interest may signal “that the current Data Cloud offering is not able to deliver what is needed for the Company to fully realize the goodness from the coming AI trend and an acquisition is a stop-gap,” according to the report.",
    "favicon": ""
  },
  {
    "title": "Five9 Integrates Salesforce’s Einstein into its AI Suite",
    "link": "https://www.cxtoday.com/contact-centre/five9-integrates-salesforces-einstein-into-its-ai-suite/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXBZeko0TXpaUmFXeFhXVWxXVFJDZkFSaS1BaWdCTWdZQklwcnlsQXM=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-06-05T07:00:00.000Z",
    "time": "Jun 5",
    "articleType": "regular",
    "content": "It will be available via the latest release of Five9 for Service Cloud Voice with Partner Telephony\nFive9 has revealed that its latest release of Five9 for Service Cloud Voice with Partner Telephony will include Saleforce’s Einstein.Einstein is a generative AI solution, designed by the CRM giant Salesforce to enhance customer interactions by creating intelligent, customized recommendations to service teams based on extensive datasets.This product partnership represents the latest collaboration between the two customer experience (CX) providers and will strengthen Five9’s existing AI offering.Dan Burkland, President of Five9, listed some of the benefits its customers can enjoy by incorporating Einstein: “Five9 understands the power of elevating the customer experience through innovative technology and seamless integrations. “Our collaboration with Salesforce pushes the boundaries of what is possible.“Infusing Einstein’s AI insights into the contact center and CRM eliminates repetitive tasks while also guiding agents with the next best actions they know will help them be more effective.”Einstein Meets Five9According to Five9, the combination of Einstein and Five9’s own set of AI solutions will help improve CX, increase management understanding of operational health, and assist agents in providing better responses to customer requests.Einstein AI will utilise Five9’s open APIs and Five9 TranscriptStream to find ways to offer agents real-time solutions via ‘Next Best Action’ guidance.The AI solution can create real-time transcriptions of customer conversations check recording accuracy and assess their utility to customer journeys.Through an integration with Salesforce Einstein Conversation insights, it is also able to bolster conversation intelligence.The partnership between Five9 and Salesforce is one of the longest in the CCaaS industry, having been in place for more than 15 years.\nRecently, Five9 made it possible for agents to use its call dispositions from within the Salesforce omnichannel widget and Voice Call page.As a result, organizations can automatically update their call dispositions within the Five9 call database, which will enhance the accuracy of reporting throughout the integration.The updated version of Five9 for Service Cloud Voice with Partner Telephony will be available from June 30th.Sheila McGee-Smith, President & Principal Analyst at McGee-Smith Analytics, shared her assessment of the integration: “Five9’s deeper integration with Salesforce Einstein offers a new level of choice for customers who are looking for AI capabilities that best match their contact center needs and existing technology investments.“When coupled with features like Five9 TranscriptStream – also being announced today – organisations can dramatically reduce an agent’s workload while improving the customer’s overall experience.“This next step in the Salesforce-Five9 relationship shows the commitment each company has to its sizable joint customer base to easily take advantage of the latest AI innovations.” Five9’s latest earnings report shows that the company has achieved 15x growth for AI and automation, including securing one of its biggest ever deals with a prominent US bank, which serves 70 million customers around the world.This will reportedly lead to a gain of $50 in annual recurring revenue (ARR) for Five9.In April, the AI assistant Einstein Copilot became generally available. Powered by generative AI (GenAI), Einstein Copilot is a conversational assistant integrated into every Salesforce application.Through these apps, employees can interact with Copilot to execute diverse workflows and pose inquiries using natural language.\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Salesforce plunges 21% after it reports its first revenue miss since 2006",
    "link": "https://markets.businessinsider.com/news/stocks/salesforce-stock-price-crash-q1-earnings-first-revenue-miss-2006-2024-5",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTFiMUpmVTIxdmJtNXFjM2N3VFJDZkFSaS1BaWdCTWdZZGc1WktNUWM=-w400-h224-p-df-rw",
    "source": "Markets Insider",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "Salesforce stock plunged 21% after the company reported its first revenue miss since 2006.\nThe combination of weak revenues and weak guidance highlighted lingering macro challenges for the company.\nMuch of Wall Street defended the stock, arguing that it could see a boost from generative AI.\nAccess your favorite topics in a personalized feed while you're on the go.\nSalesforce stock plunged as much as 21% on Thursday after the company reported its first revenue miss since 2006.The stock was trading at $214.16 per share as of 11:30 a.m. ET. A combination of weaker-than-expected first-quarter revenue and light second-quarter guidance suggested to investors that macroeconomic challenges continue to linger for enterprise software providers. Here are the key numbers:Q1 Revenue: $9.13 billion, versus analyst estimates of $9.17 billionQ1 Adjusted earnings per share: $2.44, versus analyst estimates of $2.38Q2 Revenue guidance: $9.2 billion to $9.25 billion, versus analyst estimates of $9.37 billion\"Macro headwinds returned with a vengeance,\" analysts at Citi said in a note on Thursday. That sentiment was echoed by analysts at Bank of America, who said \"tough macro catches up to Salesforce.\"An uncertain economic outlook, an ongoing slowdown in the job market, and the prioritization of business spending on generative AI technologies weighed on Salesforce's results. Questions also remain about how Salesforce will monetize opportunities in generative AI.Still, Wall Street is largely defending the software giant after its big earnings miss.Goldman Sachs reiterated its \"Buy\" rating on Salesforce and categorized the weakness in the company's results as \"cyclical headwinds\" that should ultimately dissipate.\"We believe there are both macro and micro reasons for optimism. We note both headwinds from interest rates easing, uncertainty abating after this year's elections, and outsized growth potential from Gen-AI could all serve as growth catalysts,\" Goldman Sachs said, adding that the company has a lot of levers to pull to increase profit margins.Bank of America reiterated its \"Buy\" rating and said it sees \"signs of greenshoots forming\" with the company's stock price sell-off representing an attractive risk/reward profile.\"Commentary suggests very healthy pipelines across a number of growth offerings. Finally, subscription growth in the Sales and Service Clouds was stable, suggesting relative strength in the core business,\" Bank of America said. Citi reiterated its \"Neutral\" rating and took a more cautious view on Salesforce following their results.\"Valuation is undemanding at 20x EPS, 18x EV/FCF (FY25), but with slowing growth, lack of de-risked estimates and more active M&A we are comfortable on the sidelines awaiting improving growth or more evidence of Data Cloud/Gen AI momentum/monetization,\" Citi said. Finally, Wedbush analyst Dan Ives categorized Salesforce's results as a \"small bump in the road\" in a note on Thursday, suggesting that investors should take advantage of the decline to buy shares. \"We would be buyers on weakness this morning as seeing the forest through the trees this is a turnaround in motion for a premier tech stalwart with a massive installed base led by one of the best CEOs in the global tech landscape in our view,\" Ives said.",
    "favicon": "/public/assets/MI/US/favicons/favicon-32x32.png?v=2023-11"
  },
  {
    "title": "CRM Analytics vs. Tableau: What Should I Choose for my Salesforce Use Case?",
    "link": "https://atrium.ai/resources/should-i-choose-tableau-or-crm-analytics-for-my-salesforce-use-case/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNURRbGxSVURCUlRtUkVkM0JIVFJDaUFSaTNBaWdCTWdZQmRZWmowZ00=-w400-h224-p-df-rw",
    "source": "Atrium AI",
    "datetime": "2024-04-23T07:00:00.000Z",
    "time": "Apr 23",
    "articleType": "regular",
    "content": "When Salesforce purchased Tableau in 2019, the speculation began on how that product might complement (or compete with) Salesforce’s existing analytics tool, Einstein Analytics. Five years and two name changes later (it is now CRM Analytics) — plus a somewhat shifting roadmap for the Salesforce analytics suite of products — and we are finding many customers still have questions about which tool is right for them.It should be noted that searching for a one-size-fits-all tool is generally not a recommended approach. As we talked about in a previous blog post, you will frequently need multiple tools. And with Tableau and CRM Analytics (CRMA) being among the best-in-class available options, the odds are good that your organization probably has both.Some of the decision points are straightforward. If you’re dealing with back office data, or your primary use case is deep self-service data analysis within the tool, Tableau is the clear choice. It has significantly more pre-built connectors to data sources of all kinds, and the depth of options when it comes to visualizing data and enabling self-exploration of data is unmatched.But as you examine CRM-based use cases, specifically those leveraging Salesforce as the primary source of data, the decision gets murkier. It’s no accident that Einstein Analytics first became “Tableau CRM,” and now “CRM Analytics.” Salesforce, intentionally or not, was clearly telling us that this is the analytics tool that best fits most needs when working with Salesforce CRM data and use cases.However, since the Tableau acquisition, Salesforce and the Tableau product team have made strides to close the gap between Tableau and CRMA for use cases involving Salesforce. Instead of just assuming that because your use case is in Salesforce, CRMA is going to be the preferred choice, we now need to look a layer deeper.Here we’ll discuss some of the other considerations you won’t find in most other blogs on this topic. To see a more in-depth example of how we apply these principles to an actual use case, read the whitepaper we released last year: A Detailed Comparison: CRM Analytics and Tableau.CRM Analytics vs. Tableau\nComparison #1: Data sync and shapingThe first step in creating an analysis is to set up the data. The process is relatively straightforward in CRMA: set up a data sync and create a recipe to shape and form the data. In Tableau, setting up data can take many forms depending on the availability of data and the other systems involved.CRM AnalyticsOne great advantage of CRMA is that Salesforce has made it so easy to access data that lives in Salesforce. Start by simply setting up a connection to the table(s) and field(s) you need and set a refresh schedule. This process is done with relatively few clicks to gain instant access to your Salesforce objects.\nNearly every dashboard you would want to create in CRMA is going to require a recipe. Recipes are used to join the objects you set up earlier and create any other transformations you may need (e.g., calculations, filtering data, appending data, etc.) to form your dataset.\nTableauSimilar to CRMA, Tableau can connect directly to Salesforce data. It can also connect to 70 other native connectors — something CRMA can’t do.\nWhen setting up data for analysis, there are two main routes: 1. Tableau Prep or 2. Tableau Data Source Creation.Tableau Prep is very similar to CRMA Recipes. You can create joins, calculated fields, aggregate values, and pivot data in Tableau Prep. While Tableau Prep is comparable to CRMA Recipes, Prep is not a necessity for analysis like Recipes are for CRMA. Simple joins and transformations can instead be done in the data source creation pane.The data source creation pane allows for many of your simple transformations, such as creating calculated fields, renaming fields, and creating joins. However, Tableau can utilize joins and an alternative to joins called “Relationships.” Relationships have many advantages over joins including maintaining granularity and improved performance. Relationships work like a dynamic join, allowing you to pull the data you need based on the analysis you are doing instead of pulling all data from a single table.\nKey takeawaysFor static, replicated data (datasets or extracts), both tools provide everything we need. The gap between CRM Analytics Recipes and Tableau Prep is essentially nonexistent, given the updates Tableau has made to Tableau Prep in recent releases.For standard data transformations, there is no clear need for one tool over the other for replicated data, although Tableau has a slight advantage here due to matching CRMA Recipes with Tableau Prep and the addition of Relationships. Live data, however, is a different story, which we’ll cover soon.Comparison #2: Creating the dashboardCreating Visualizations is where visualization tools are really put to the test. While the possibilities around the visualizations are nearly endless, the way you create the visualizations is very different.CRM AnalyticsBuilding a dashboard in CRMA can take multiple routes. Building simple visualizations that come as native chart types are relatively simple to create using the CRMA GUI. However, in order to build more specialized visualizations with custom calculations, you may have to use SAQL, which may be confusing to developers who aren’t used to this variation of SQL.This is not to say that SAQL is bad. In fact, it is extremely helpful because it gives you a lot of freedom to check the logic being done in each step of the code (something Tableau lacks) and offers plenty of freedom in designing exactly what you want.TableauBuilding analytics in Tableau is almost code-free. Most views are created by simply dragging the appropriate fields to rows, columns, filters, and marks cards. The main spots in which you would need code are in calculated fields, which follow a very similar syntax to Excel formulas. The near code-free GUI-heavy environment creates a much smaller learning curve for new developers or people unfamiliar with the tool.Key takeawaysBoth tools offer comparable abilities to create meaningful visualizations. However, more can be done in Tableau using drag and drop functionality than in CRMA. To summarize:CRMA requires more “coding” knowledge for SAQL but is very easy to format and set up.Tableau vizzes can be simpler to build since it has a more powerful visualization layer and more can be done without writing lines of code, but it has more of a learning curve in understanding the formatting panes.Overall, the process of creating a functioning dashboard is simpler on Tableau, solidifying its place as the market leader for visualizations.Comparison #3: Live dataSpeed of data is increasingly important in today’s fast-paced business world. Therefore, it would behoove us to discuss the ability to bring in live data rather than extracted data.CRM AnalyticsOne strong advantage of using CRMA with Salesforce is the ability to write queries directly against Salesforce data. Live data is available through Salesforce Direct queries (point-and-click) or SOQL queries (custom).In most cases, creating standard Salesforce Direct queries is going to give you what you need to do basic aggregations and filtering. These direct queries are different from Recipes. Recipes will still have some degree of lag time, as they have to run on a schedule (up to hourly).TableauTableau has the ability to connect to data sources via Live or Extract connections depending on the connector being used. However, the Tableau Salesforce connector does not yet have the ability to connect to live Salesforce data.The extracts can be set to update hourly, so while it refreshes frequently, there is no real-time data for this specific Salesforce connection. Given live connections exist for other data connections, it seems likely that this capability will find its way to Tableau in the near future.Key takeawaysThere’s only one option at this time to stream data live from Salesforce objects, and it’s CRMA. With the evolution of Data Cloud and the existence of live streams from other Tableau connections, we believe this gap will close. But if you need your Salesforce core objects visualized in real time, CRMA is your choice.Comparison #4: Embedding & pre-filtering the dashboard in SalesforceDashboards are great, but only if users actually navigate to (and use) the information they provide. The best way to make sure dashboards are utilized is to embed them in the direct path of intended users. We’ll analyze the following scenarios for each tool:EmbeddingFiltering to the logged-in userLicensingCRM AnalyticsEmbedding. One of the advantages of using CRMA is that Salesforce has spent the last six years fully integrating CRMA with Salesforce Lightning. As such, the steps to embed your dashboard on a Lightning page are quite straightforward: Edit the Lightning page to include the CRMA Dashboard Component and select the dashboard to show.Filtering on the current user. Filtering on the current user requires a live query checking who the logged-in user is and then another query that applies the filter to the SAQL of the views. These additional queries are relatively simple, (and detailed examples can be found in our whitepaper).License considerations. Access to dashboards can be handled in multiple ways depending on how they are provisioned and who should see which dashboard data. In short, the viewing user must be assigned a CRMA license and permission set. Users without licenses will not be able to view and interact with the dashboard within Salesforce.TableauEmbedding. The process of embedding Tableau on a Lightning Page is very similar to CRMA. Like CRMA, you’ll want to modify a Lightning Page to embed the Tableau dashboard within Salesforce. Recently, Salesforce released native components for Tableau views and Tableau Pulse. Drag the Tableau View component onto the page and configure the settings pane that appears on the right side of the screen:\nThere is another way to make your Tableau dashboards visible to users in Salesforce. Salesforce enabled a feature called “Publish to Salesforce” a few releases ago, which allows Tableau views to be added to CRMA dashboards as component objects.Additionally, you can filter Tableau views with selections on CRMA objects. For an example of this, read one of our recent blogs: Leverage CRM Analytics Parameters to Filter Tableau Views.Filtering on the current user. In order to filter on the current user, Tableau has to either utilize Row-Level Security (RLS) from the database/data source or utilize user filters created on the dashboard. If RLS or user filters aren’t applied, you can still filter based on the record page the dashboard is embedded in.However, Tableau only has the ability to filter the dashboard based on a single record page. So you can filter by the user, but only if the dashboard is being embedded on the user’s profile page. If you’re embedding on an Opportunity page, there is no way to filter based on the user without RLS being set up as part of the data source.License considerations. In Tableau, you will need to make sure that each user in Salesforce has a corresponding Tableau license (viewer at minimum) within our respective Tableau site. Tableau has the ability to leverage SSO through Salesforce so that when a user signs into Salesforce they do not need to reauthenticate to Tableau through another method.It should be noted that there are some restrictions in the SSO method if using Salesforce as your vehicle for authentication (e.g., requires SAML), but in general, this can make for a seamless user experience.Key takeawaysCRMA gets the nod here, since in a CRM system like Salesforce, the most common use case will require insights in the context of the logged-in user — which is simpler to do in CRMA than Tableau. Additionally, there is no configuration for SSO with CRMA since the user is already logged in to both platforms through their Salesforce ID.Comparison #5: ActionabilityThe final item to compare is the ability to trigger Salesforce actions from within the embedded dashboard. When we’re designing visualizations, we’re asking three primary questions: what questions does the user most want to answer, what is the order of importance of those questions, and what actions are they going to take once they have the answers to those questions. If you create a beautiful dashboard but we forget the last piece (enablement of those actions), you’ve missed a big chunk of what takes a dashboard from good to great.CRM AnalyticsAdding actions to dashboards and lenses in CRMA is incredibly easy! There are two ways to configure standard actions on a CRMA dashboard: the first is to configure your actions directly on the widget itself, and the second is to configure actions directly on the dataset. CRMA allows for 15+ prebuilt actions, plus it’s also easy to create new actions, both through configuration and, if something significantly complex is desired, through code.TableauTableau offers many of the same actionable features CRMA offers, such as creating “go to URL actions” and activating “workflows” directly from Tableau workbooks (e.g., going to the opportunity page and launching a Salesforce Flow, respectively).Actions such as navigating to a URL are just as easy as they are in CRMA. However, updating/creating Salesforce records requires a few extra steps. Tableau requires the use of auto-launched Salesforce Flows, which must be configured inside of Salesforce before adding the functionality to the dashboard. More detail on some of the advances in Salesforce Actionability can be found on Tableau’s help portal.Key takeawaysLike the process of embedding, actionability is just a bit easier and more natively part of CRMA than it is with Tableau. However, with a little extra effort, you can accomplish similar results in Tableau, most specifically through the recent enhancement to allow external actions on a Tableau dashboard.While enabling Salesforce Flows requires having someone on hand who knows how to create Flows (vs. some of the standard actions in Salesforce), in general, the gap between the products is relatively small.What did we learn?Compared to where things were at the time of the Tableau acquisition, several areas where Tableau lagged behind CRMA have been reduced. The most significant differentiating factor at the moment is access to real-time data and querying the Salesforce objects directly. CRMA can do it; Tableau cannot.However, with the launch of Data Cloud and some of the focus on Tableau’s role with that product, that gap may be closed swiftly. In the other areas that we compared, there were no significant holes in either tool.Tableau won for ease of creating complex visualizations, while CRMA won in some cases because of its more tightly-coupled integration with Salesforce around embedding, filtering, and interacting with insights.So which should you choose? As we stated at the beginning, it is rarely a “one tool fits all” situation for the vast majority of organizations. You should select the right product based on your specific use case, and for use cases within Salesforce, both tools have scenarios where they can be argued to be the preferred choice.In general, CRMA is a purpose-built tool for use cases in Salesforce, and with the exception of requiring additional code to build some dashboard features that can be done in Tableau with clicks, it is the safest choice for maximum functionality for those Salesforce use cases. But if your use case is outside of Salesforce, Tableau is likely the preferred option.At Atrium, we live and breathe this stuff. If you need help determining the best approach for your organization or use case, contact us!",
    "favicon": "https://atrium.ai/wp-content/uploads/2021/07/cropped-atrium_site_icon-32x32.png"
  },
  {
    "title": "Salesforce investors reject plan to add extra $20M to Benioff's total pay",
    "link": "https://www.theregister.com/2024/07/02/salesforce_benioff_20m/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNUhRMDlQWVcxdVQzWXRiRUppVFJDM0FSaVRBaWdCTWdtUmNZeG5yaVkxVUFF=-w400-h224-p-df-rw",
    "source": "The Register",
    "datetime": "2024-07-02T07:00:00.000Z",
    "time": "Jul 2",
    "articleType": "regular",
    "content": "Investors have turned down billionaire Marc Benioff's bid for greater compensation from Salesforce, the SaaS company he helped found 25 years ago, a proxy statement filed on Monday reveals.\nInvestors voted down a tweak in executive compensation that included a bid to give Benioff a second long-term equity top-up worth $20 million in fiscal 2024, on the grounds that they should be \"wary\" of such an award.\nThe board's compensation committee decided on giving Benioff that secondary package of $20 million in equity and stock options in January. The committee said adding a little extra to the CEO's package would \"close the gap between the $15 million value\" of Benioff's initial fiscal 2024 equity award and what they considered \"an appropriately competitive equity opportunity\" that would recognize the company's \"successful transformation actions and strong financial performance in the fiscal year.\"\nThe January pay bump was part of the plan voted down in a non-binding action. The board said it would \"consider the outcome of this vote when making future executive compensation decisions.\"\nBenioff's total pay for fiscal 2024 is $39.6 million, a figure that climbed significantly compared to the $29.9 million for 2023.\nOn top of a \"basic\" salary of $1.55 million, he receives additional stock and option awards and nonequity incentive plan compensation, according to the proxy statement.\n\"This has been a remarkable year of transformation for our company – restructuring our business for the short and long term; increasing productivity, profitability, and operational excellence across the board; doubling down on innovation and making our core products even better; and strengthening our relationships with all of you – our stockholders. Our transformation is reflected in the strong results you saw throughout fiscal year 2024,\" Benioff said in the recent shareholder document.\nSalesforce flipflops from 'you're fired' to 'you're hired' in six short months\nHalf of Dell US staff reportedly opted for remote work\nOpenAI meltdown: How could Microsoft have let this happen after betting so many billions?\nCome work at HQ... or find a new job, Roblox CEO tells staff\nHowever, according to a CNBC report, two companies that offer advice to shareholders, Glass Lewis and Institutional Shareholder Services, were against the additional $20 million award in January. The former suggested \"shareholders may reasonably be wary of the substantial discretionary equity grants\" owing to a \"lack of a fully convincing rationale.\"\nWith a $6 billion stake in Salesforce, Benioff is one of its biggest shareholders. Glass Lewis pointed out that this should mean his interests, and those of other shareholders, should already be aligned.\nThe latest regulatory filing shows shareholders agreed with the advice, voting 339.3 million in favor and 404.8 million against the additional award.\nSalesforce has had a bumpy ride in the last couple of years.\nIn January 2023, activist investors circled, demanding more operational discipline and higher margins in line with other large software companies such as Oracle and Microsoft. At the time it announced it would lay off 7,000 following criticism it struggled to integrate the Slack comms platform after the merger. However, by September, it started recruiting more roles again and activist investors said they would not seek a board role. ®",
    "favicon": "/design_picker/13249a2e80709c7ff2e57dd3d49801cd534f2094/graphics/favicons/favicon.ico"
  },
  {
    "title": "Salesforce stock plunges by 20%, erasing over $50 billion in value",
    "link": "https://www.sfchronicle.com/bayarea/article/salesforce-stock-plunges-20-erasing-50-billion-19487120.php",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNTRWakJvUkhBd05VeEVXbFZZVFJDM0FSaVRBaWdCTWdZeE5ZeXZHUW8=-w400-h224-p-df-rw",
    "source": "San Francisco Chronicle",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Odaseva raises $54M to secure Salesforce users",
    "link": "https://techcrunch.com/2024/06/27/odasevas-founder-once-solved-a-security-gap-for-saleforces-biggest-customer-now-hes-raised-54m-to-secure-all-of-its-users/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWhibXB0U1hCNFpteGtTMFV4VFJEQ0FSaURBaWdCTWdhaGxKU01OUWM=-w400-h224-p-df-rw",
    "source": "TechCrunch",
    "datetime": "2024-06-27T07:00:00.000Z",
    "time": "Jun 27",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Stock Dropped More Than 20% In One Day, What’s Next?",
    "link": "https://www.forbes.com/sites/greatspeculations/2024/06/03/salesforce-stock-dropped-more-than-20-in-one-day-whats-next/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUpYeTFTV1VwalZEQmtYekZWVFJDM0FSaVRBaWdCTWdZbGRZQ01xUWM=-w400-h224-p-df-rw",
    "source": "Forbes",
    "datetime": "2024-06-03T07:00:00.000Z",
    "time": "Jun 3",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce and Slack to pause all hiring in technology and product",
    "link": "https://fortune.com/2024/01/10/salesforce-slack-pause-hiring-product-tech-leaked-memo/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWxUWEJPT0hKRk5FaFpVMWxvVFJDM0FSaVRBaWdCTWdhdGRKQ3VMUWM=-w400-h224-p-df-rw",
    "source": "Fortune",
    "datetime": "2024-01-10T08:00:00.000Z",
    "time": "Jan 10",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce Executive Leads With a Beginner’s Mind",
    "link": "https://www.nytimes.com/2024/03/07/business/clara-shih-salesforce-artificial-intelligence.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNU1kbE56UXpkaVFsUlZOVFJqVFJDM0FSaVRBaWdCTWdZcFJwanNJUWs=-w400-h224-p-df-rw",
    "source": "The New York Times",
    "datetime": "2024-03-07T08:00:00.000Z",
    "time": "Mar 7",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Bring your own AI using Amazon SageMaker with Salesforce Data Cloud",
    "link": "https://aws.amazon.com/blogs/machine-learning/bring-your-own-ai-using-amazon-sagemaker-with-salesforce-data-cloud/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNHlaMWcwYmxOcGIwUnpiMFl0VFJDb0FSaXNBaWdCTWdhQmRvNG11Z1k=-w400-h224-p-df-rw",
    "source": "AWS Blog",
    "datetime": "2023-08-04T07:00:00.000Z",
    "time": "Aug 4, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce, Informatica reportedly can’t agree to deal terms",
    "link": "https://www.marketwatch.com/story/salesforce-informatica-reportedly-cant-agree-to-deal-terms-dd68a198",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVhkVE5wY0VjelJHSlFaVFJtVFJEaEFSamhBU2dCTWdhUm9wQklOUVk=-w400-h224-p-df-rw",
    "source": "MarketWatch",
    "datetime": "2024-04-22T07:00:00.000Z",
    "time": "Apr 22",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Economist explains how Salesforce's return-to-office policy could benefit San Francisco as a whole",
    "link": "https://abc7news.com/post/salesforces-return-office-policy-expected-boon-san-francisco/15065774/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVZXV05wYTBSM2NqaFNhVjlLVFJDb0FSaXJBaWdCTWdZQlk0NXZxUVU=-w400-h224-p-df-rw",
    "source": "KGO-TV",
    "datetime": "2024-07-17T07:00:00.000Z",
    "time": "Jul 17",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce to open first AI centre in London",
    "link": "https://www.reuters.com/technology/salesforce-open-first-ai-centre-london-2024-06-06/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXZNMHA1VUZRMExXeFdlRGRNVFJDM0FSaVRBaWdCTWdZUmdaVG9NQWM=-w400-h224-p-df-rw",
    "source": "Reuters",
    "datetime": "2024-06-06T07:00:00.000Z",
    "time": "Jun 6",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce turns to 'boomerangs,' luring back former execs to help reignite growth",
    "link": "https://www.cnbc.com/2023/09/18/salesforce-is-luring-boomerangs-to-reaccelerate-growth.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNXFaV1JZUVZKU1JIbDRORVYxVFJDb0FSaXNBaWdCTWdZQkVwUXJGUW8=-w400-h224-p-df-rw",
    "source": "CNBC",
    "datetime": "2023-09-18T07:00:00.000Z",
    "time": "Sep 18, 2023",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce open to large acquisitions, but analysts have concerns",
    "link": "https://finance.yahoo.com/news/salesforce-open-to-large-acquisitions-but-analysts-have-concerns-100213959.html",
    "source": "Yahoo Finance",
    "datetime": "2024-05-31T07:00:00.000Z",
    "time": "May 31",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Here's Why I Just Loaded Up on Salesforce Stock",
    "link": "https://www.fool.com/investing/2024/06/27/heres-why-i-just-loaded-up-on-salesforce-stock/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVlTRVZPV0MxTWQzTTBkMEpWVFJDM0FSaVRBaWdCTWdhZFJvSktIZ2s=-w400-h224-p-df-rw",
    "source": "The Motley Fool",
    "datetime": "2024-06-27T07:00:00.000Z",
    "time": "Jun 27",
    "articleType": "regular",
    "content": "Salesforce's stock is just too cheap to ignore.\nI recently started a position in Salesforce (CRM 0.34%) because the price the market is giving investors is too good to ignore. Timing can be everything when investing, and there has seldom been a better time to purchase the stock in the last few years.\nIn a market where some stocks are incredibly expensive, Salesforce is refreshing. If you have a holding period of at least three to five years in mind, there are few better stocks available.\nThe company is a leader in customer relationship management (CRM). This software helps a company market its services or products to potential buyers, make the actual sale, retain and serve the customer post-purchase, and drive additional purchases.\nToday's Change (0.34%) $0.87 Current Price $258.80 Arrow-Thin-Down\nLike everyone else, it seems, Salesforce has also been heavily integrating generative artificial intelligence (AI) into its product line. It calls its model Einstein, and it can be used both internally and externally by a company.\nSalesforce is by far the market leader in CRM software, and its new AI tools further solidify that position. When investing in a company that is already the market leader in a fairly mature industry, growth rates and the purchase price are very important, which is why now is an excellent time to buy.\nSalesforce used to be barely profitable, although it flipped the switch last year.\nCRM profit margin (quarterly); data by YCharts.\nHowever, compared to other software-as-a-service companies, it has a way to go. The industry standard in this space is Adobe, which has achieved a 30% profit margin for many years.\nWhile it's unknown if Salesforce will reach that level, there is potential. So the company's profits will grow much faster than revenue over the next few years, because its profit margin should be ticking up. This is good; its revenue growth isn't lightning-quick.\nFor fiscal year 2025 (ending Jan. 31, 2025), Salesforce maintained its full-year revenue guidance of 8% to 9% growth. However, the stock was heavily sold off following the earnings release because management issued guidance for 7% to 8% growth in the second quarter, which was below expectations.\nIf you can broaden your time horizon from one quarter to one year, this 20% sell-off makes no sense, so I took advantage of it and bought the stock. After the sell-off, it now trades for a fairly cheap valuation.\nSalesforce hasn't been this cheap from a price-to-sales (P/S) basis in about nine months. And 6.7 times sales for a software company is pretty cheap, especially compared to industry giants like Adobe (11.9 times sales) or Autodesk (9.3 times sales).\nCRM PS ratio; data by YCharts.\nFrom a forward price-to-earnings (P/E) perspective, Salesforce trades at 24.8 times earnings. Considering that the broader market (measured by the S&P 500) trades at 22.3 times earnings, it barely holds a premium to the market.\nConsidering the company's long-term success, this seems like a great price to pay for the stock. Salesforce has been on my radar for a while, but the latest sell-off finally gave me a reason to take a position in it. I'm confident that this discounted price will allow me to beat the market over the next three to five years.\nShould you invest $1,000 in Salesforce right now?\nBefore you buy stock in Salesforce, consider this:\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $635,614!*\nNow, it’s worth noting Stock Advisor’s total average return is 694% — a market-crushing outperformance compared to 159% for the S&P 500. Don’t miss out on the latest top 10 list.\n*Stock Advisor returns as of July 29, 2024\nKeithen Drury has positions in Adobe, Autodesk, and Salesforce. The Motley Fool has positions in and recommends Adobe, Autodesk, and Salesforce. The Motley Fool has a disclosure policy.",
    "favicon": "https://g.foolcdn.com/misc-assets/logo-tmf-primary-favicon.ico"
  },
  {
    "title": "Filing shows Salesforce paid $419M to buy Spiff in February",
    "link": "https://techcrunch.com/2024/05/30/filing-salesforce-paid-419m-to-buy-spiff-in-feb/R",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWlaakZZYVVOdlFVSm9hMWhpVFJDM0FSaVRBaWdCTWdhcEZJcU9sUW8=-w400-h224-p-df-rw",
    "source": "TechCrunch",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Graduate School selects Salesforce as graduate records management solution",
    "link": "https://www.purdue.edu/newsroom/purduetoday/releases/2024/Q2/graduate-school-selects-salesforce-as-graduate-records-management-solution.html",
    "source": "Purdue University",
    "datetime": "2024-04-23T07:00:00.000Z",
    "time": "Apr 23",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce’s stock suffers its biggest drop in two decades",
    "link": "https://www.marketwatch.com/story/salesforces-increasingly-visible-weakness-could-spur-a-stock-drop-not-seen-in-years-8122984c",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWpVRmQwVlZGblRGOUdWVzh0VFJEaEFSamhBU2dCTWdaQk1KNTBuQWs=-w400-h224-p-df-rw",
    "source": "MarketWatch",
    "datetime": "2024-05-30T07:00:00.000Z",
    "time": "May 30",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Is Salesforce Stock in Trouble?",
    "link": "https://www.fool.com/investing/2024/06/07/is-salesforce-stock-in-trouble/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUVZMlJCTXpSUGF5MW1TVEpVVFJDMEFSaVlBaWdCTWdZbFJvN3NKUWM=-w400-h224-p-df-rw",
    "source": "The Motley Fool",
    "datetime": "2024-06-07T07:00:00.000Z",
    "time": "Jun 7",
    "articleType": "regular",
    "content": "After last week's sell-off, Salesforce's stock is now down 10% in 2024.\nShare prices of Salesforce (CRM 0.34%) plunged last week after the company released its latest quarterly results. While the business is still growing, it didn't provide analysts and investors with the level of growth they were expecting. For a stock that trades at a relatively high valuation, that could put it in a dangerous position.\nSalesforce is still a dominant name in the tech world, and its customer relationship management (CRM) platform fulfills crucial needs for many businesses. But there are clearly some issues it's going through.\nShould investors consider buying the tech stock after its recent pullback to take advantage of what might just be a short-term issue? Or does Salesforce have bigger problems on its hands and now's the time to get out or avoid buying?\nToday's Change (0.34%) $0.87 Current Price $258.80 Arrow-Thin-Down\nWhat went wrong for Salesforce?\nSalesforce stock had its worst day in decades after posting its first-quarter numbers in the last week of May. What was particularly noteworthy was that the business fell short of analyst expectations for the first time since 2006. Salesforce has typically satisfied investors and analysts with its results, but not this time.\nFor the first quarter of fiscal 2025, which ended on April 30, the company's revenue totaled $9.13 billion and rose by 11% year over year. But analysts were expecting $9.17 billion in revenue. Furthermore, the company's forecast for the current quarter was also underwhelming, with management projecting a range between $9.20 billion and $9.25 billion in revenue. Analysts were expecting as much as $9.37 billion in sales.\nExpectations are high for an expensive stock\nSalesforce has enhanced its CRM platform with artificial intelligence (AI), which it calls Salesforce Einstein. Einstein can help anticipate sales opportunities, proactively resolve cases, and \"embed intelligence everywhere.\" The company brands its platform as \"the #1 AI CRM\" and says that it's \"well positioned to help companies realize the promise of AI over the next decade.\"\nThe problem with those kinds of claims is that if you want to convince investors that you have new AI-powered products, then there should be some evidence of that in the way of a higher growth rate. But that isn't the case. In fact, Salesforce's growth rate has been slowing down for several quarters.\nCRM Revenue (Quarterly YoY Growth) data by YCharts\nThat's not the type of growth I would expect from a company that's hyping up its AI-related growth opportunities.\nSalesforce's stock trades at more than 40 times its trailing earnings. And that's after factoring in last week's sell-off. It's a high valuation for a business that is expecting just single-digit growth for the current quarter, between 7% and 8%.\nAt a high earnings multiple, investors are going to be expecting much better results than what Salesforce delivered in its most recent quarter, as well as in future quarters. And with the stock still not exactly cheap, there's room for shares of Salesforce to slide further down. Even though the stock has fallen sharply of late, it's still well above its 52-week low of $193.68.\nIs Salesforce stock a buy?\nSalesforce's business isn't broken, nor is it in bad shape. The company still grew its operations last quarter, and it did so while posting a profit. The business itself isn't in trouble, but high expectations can put immense pressure on the company to perform at a high level -- and Salesforce isn't delivering.\nThat's why this isn't a stock I'd buy today, as there could be more losses ahead due to its high valuation. While Salesforce's platform may be enhanced due to AI, the results aren't there to back up management's optimism about future growth. And until that changes, I would hold off on investing in the company, as there are better growth stocks to consider.\nShould you invest $1,000 in Salesforce right now?\nBefore you buy stock in Salesforce, consider this:\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $635,614!*\nNow, it’s worth noting Stock Advisor’s total average return is 694% — a market-crushing outperformance compared to 159% for the S&P 500. Don’t miss out on the latest top 10 list.\n*Stock Advisor returns as of July 29, 2024\nDavid Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Salesforce. The Motley Fool has a disclosure policy.",
    "favicon": "https://g.foolcdn.com/misc-assets/logo-tmf-primary-favicon.ico"
  },
  {
    "title": "Salesforce and Workday CEOs explain their new joint AI venture",
    "link": "https://www.cnbc.com/2024/07/24/salesforce-and-workday-ceos-explain-their-new-joint-ai-venture-.html",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNVZSa2xvYzFCbk4wTjRRMFI1VFJDb0FSaXNBaWdCTWdZZFFwQ09wUWM=-w400-h224-p-df-rw",
    "source": "CNBC",
    "datetime": "2024-07-24T22:59:37.000Z",
    "time": "Jul 25",
    "articleType": "regular",
    "content": "",
    "favicon": "https://sc.cnbcfm.com/applications/cnbc.com/staticcontent/img/favicon.ico"
  },
  {
    "title": "Vonage Leverages Salesforce Einstein to Boost its Service Cloud Voice Solution",
    "link": "https://www.cxtoday.com/contact-centre/vonage-leverages-salesforce-einstein-to-boost-its-service-cloud-voice-solution/",
    "image": "https://news.google.com/api/attachments/CC8iL0NnNUNlSFYwTmtkZldETTJZMkpuVFJDZkFSaS1BaWdCTWdtRk1JamtVaU11YUFJ=-w400-h224-p-df-rw",
    "source": "CX Today",
    "datetime": "2024-05-14T07:00:00.000Z",
    "time": "May 14",
    "articleType": "regular",
    "content": "What can customers expect from these AI-powered integrations?\nVonage has announced that its Premier for Service Cloud Voice solution will now include Salesforce Einstein Conversation Insights integration.The increased capabilities of Vonage’s tool will make the company one of the few contact centers providers to offer full integration with AI-powered Einstein Conversation Analytics, trends, and data.As well as enhancing customer engagement, Vonage claims that the AI-powered advancements will help boost agent and customer experience by providing “intelligent, global calling capabilities.”Savinay Berry, EVP of Product and Engineering at Vonage, discussed the benefits of the company’s partnership with Salesforce and his desire to continue expanding Vonage’s Premier for Service Cloud Voice customer offering:“As one of the first Contact Center as-a-Service providers to offer this integration to Service Cloud Voice users, we are meeting a real and growing demand for advanced speech analytics.With these AI-based insights, our customers can make improvements and adjustments in how they connect and interact with customers with actionable data that will ultimately drive better customer experiences and higher engagement.Let’s take a closer look at how the integration of Salesforce’s solution will impact users.Integration Ins and OutsOne of the key features of the integration is Salesforce’s Einstein Conversation Insights tool, which will allow Vonage Premier for Service Cloud Voice sales and service customers to access real-time conversational data, such as voice transcripts and caller sentiment.This feature enables post-call analysis, where agents and supervisors can review and identify keywords and areas of interest, leading to improved coaching and follow-up actions.The solution will also enable customers to listen to recorded conversations and uncover mentions of competitors, products, custom keywords, and discussions about pricing.Sales and service leaders can then analyze conversation trends from voice and video calls, enabling them to make informed decisions to acquire and retain valuable customer relationships.The company believes that its real-time transcription, integrated with Salesforce’s conversation intelligence, can enhance customer experience by prompting next best actions, supervisor alerts, and post-call quality management and coaching.Donna Fluss, President of DMG Consulting, also discussed Vonage’s integration of Salesforce’s AI-powered tools, describing it as a growing trend.\n“This new integration for the Vonage Contact Center solution, which leverages deeper analytics in Salesforce, highlights a key and growing trend in the contact centre technology market,” said Fluss.Given the rapid pace of innovation for AI and analytics, technology partnerships are a highly effective method to quickly bring new and advanced capabilities to market, giving clients increased flexibility in the solutions they use to deliver an enhanced customer and employee experience.Collaborative and Non-Collaborative News from Vonage and SalesforceWhile the enhancement of Vonage’s Premier for Service Cloud Voice solution was the latest byproduct of the two companies’ relationship, it certainly wasn’t the first.In September of last year, Vonage launched ‘Conversations for Salesforce’, an omnichannel messaging app integrating the Salesforce platform with Vonage Contact Center (VCC).The solution allows businesses to seamlessly serve customers through Salesforce, incorporating bot and VCC agent interactions. It also provides scalable SMS, MMS, and WhatsApp messaging from Salesforce, enabling businesses to create customized workflows effortlessly.The enterprise-grade cloud communications solutions provider also recently sealed another partnership with Amazon Web Services (AWS) to enhance the accessibility of its anti-fraud tools through distribution across AWS Marketplace.This collaboration leverages Vonage’s communication and network APIs, along with AWS’s influence, to offer developers a comprehensive suite of networking solutions aimed at enhancing user safety, anti-fraud protection, and customer experience innovation.By integrating Vonage’s CSP networks, Ericsson’s 5G capabilities, and AWS services, the collaboration promises developers a wide array of valuable tools and innovations.Salesforce has also been making moves outside of its partnership with Vonage.Last week, the company unveiled its Unified Knowledge Solution aimed at enhancing personalization and efficiency.The tool consolidates knowledge resources from diverse third-party systems, integrating them into Salesforce for easy access by service agents, ultimately improving customer case-handling times.Unified Knowledge complements Salesforce’s Data Cloud, enhancing its generative AI (GenAI) capabilities, with the aim of delivering faster and more personalized customer experiences.\nBrands mentioned in this article.",
    "favicon": "https://www.cxtoday.com/wp-content/uploads/2021/07/cropped-cxtoday-3000x3000-1-32x32.png"
  },
  {
    "title": "Better Cloud Stock: Salesforce vs. ServiceNow",
    "link": "https://www.fool.com/investing/2024/06/11/better-cloud-stock-salesforce-vs-servicenow/",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNWtSVmM1ZEVWTFRrTjZVMEpUVFJDM0FSaVRBaWdCTWdhcE5KTHRHUW8=-w400-h224-p-df-rw",
    "source": "The Motley Fool",
    "datetime": "2024-06-11T07:00:00.000Z",
    "time": "Jun 11",
    "articleType": "regular",
    "content": "Salesforce (CRM 0.34%) and ServiceNow (NOW 1.95%) both help large companies streamline operations with their cloud-based services. Salesforce is the world's largest provider of cloud-based customer relationship management (CRM) services, while ServiceNow is the market leader in cloud-based digital workflow offerings.\nSalesforce and ServiceNow aren't usually considered direct competitors. However, Salesforce also provides digital workflow tools via its Service Cloud, and it's been expanding its ecosystem with more marketing, analytics, and collaboration services.\nSalesforce generated nearly 4 times as much revenue as ServiceNow in its latest fiscal year. But the larger company is also growing at a slower clip and impressing fewer investors. Over the past 12 months, ServiceNow's stock has rallied more than 30%, while Salesforce shares only rose 12%. Let's dig deeper and see whether that trend will continue.\nFrom fiscal 2018 to fiscal 2023 (which ended in January 2023), Salesforce's revenue increased at a compound annual growth rate (CAGR) of 24%. That was partly driven by its massive acquisitions of Mulesoft, Tableau, and Slack.\nToday's Change (0.34%) $0.87 Current Price $258.80 Arrow-Thin-Down\nBut in fiscal 2024, Salesforce's revenue only rose 11%. That deceleration was caused by three major challenges. First, macro headwinds drove many companies to rein in cloud spending. Second, it faced stiff competition from smaller CRM competitors like Microsoft Dynamics. Finally, activist investors pressured Salesforce to cut costs, buy back more shares, and pause its big acquisitions.\nFor fiscal 2025, analysts expect Salesforce's revenue to only climb 9%. That slowdown coincides with the rise of generative AI platforms over the past year, which raises a red flag because it suggests that some of its offerings might be displaced by new AI services. Salesforce has been rolling out its own generative AI tools to keep pace with that shift, but those efforts aren't meaningfully boosting its revenue yet.\nOn the bright side, Salesforce's adjusted EPS rose 57% in fiscal 2024 as it executed several rounds of layoffs, aggressively cut costs, and plowed its cash into big buybacks. Those profit-boosting moves appeased its activist investors, and the company even initiated its first dividend earlier this year. Analysts expect its adjusted EPS to jump 20% in fiscal 2025.\nSalesforce is still growing, but its business is maturing. Its stock might seem reasonably valued at 24 times forward earnings and 6 times this year's sales, but it probably won't command a higher valuation unless its top-line growth accelerates again.\nServiceNow is still firing on all cylinders\nFrom 2017 to 2022, ServiceNow's revenue increased at a CAGR of 30%. Most of that growth was organic, and it didn't make any multibillion-dollar acquisitions like Salesforce. It also hasn't been executing any big layoffs.\nToday's Change (1.95%) $15.59 Current Price $814.39 Arrow-Thin-Down\nIn 2023, ServiceNow's revenue climbed 24%. Macroeconomic headwinds throttled growth as the company struggled to lock customers into longer contracts and higher-value deals, but it suffered a milder slowdown than Salesforce and many of its other industry peers. ServiceNow is growing at a faster clip because many companies are still optimizing and automating their digital workflows to cut costs in a more challenging environment.\nFor 2024, ServiceNow forecasts subscription revenue (which accounts for most of its top line) to increase 21.5% on a constant currency basis. Analysts expect its reported revenue and adjusted EPS to grow 21% and 25%, respectively.\nLooking ahead, ServiceNow believes its near-term growth will be driven by the federal sector and its Now Assist AI platform, which uses generative AI tools to optimize its digital workflows. During a recent conference call, CEO Bill McDermott declared that \"ServiceNow's strategic relevance as the AI platform for business transformation has never been higher.\"\nServiceNow projects to generate at least $15 billion in revenue in 2026, which would represent a CAGR of more than 20% from 2023. That's a rosy outlook, but its stock isn't cheap at 52 times forward earnings and 13 times this year's sales. The company launched its first stock buyback plan last year, but it doesn't pay a dividend.\nSalesforce might be the cheaper stock, but ServiceNow remains the better overall investment because it is growing faster, faces fewer near-term headwinds, and has a clearer plan for the generative AI market. It also runs a tighter business, isn't heavily dependent on acquisitions, and doesn't face any pressure from activist investors.\nShould you invest $1,000 in Salesforce right now?\nBefore you buy stock in Salesforce, consider this:\nConsider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $635,614!*\nNow, it’s worth noting Stock Advisor’s total average return is 694% — a market-crushing outperformance compared to 159% for the S&P 500. Don’t miss out on the latest top 10 list.\n*Stock Advisor returns as of July 29, 2024\nLeo Sun has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft, Salesforce, and ServiceNow. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.",
    "favicon": "https://g.foolcdn.com/misc-assets/logo-tmf-primary-favicon.ico"
  },
  {
    "title": "What Salesforce learned after saving 50,000 hours of work using AI",
    "link": "https://www.fastcompany.com/91137938/what-salesforce-learned-after-saving-50000-hours-of-work-using-ai",
    "image": "https://news.google.com/api/attachments/CC8iJ0NnNDFiR1JhT1UxakxVeFpSbFZJVFJDb0FSaXNBaWdCTWdPVlVoSQ=-w400-h224-p-df-rw",
    "source": "Fast Company",
    "datetime": "2024-06-09T07:00:00.000Z",
    "time": "Jun 9",
    "articleType": "regular",
    "content": "",
    "favicon": ""
  },
  {
    "title": "Salesforce AI Push Comes With Partner Program Investment, Says Channel Chief",
    "link": "https://www.crn.com/news/cloud/2024/salesforce-ai-push-comes-with-partner-program-investment-says-channel-chief",
    "image": "https://news.google.com/api/attachments/CC8iK0NnNUNhVVEwVWxKZlgzSXhhRkIzVFJEQ0FSaURBaWdCTWdZcFpZeXRMUVk=-w400-h224-p-df-rw",
    "source": "CRN",
    "datetime": "2024-04-16T07:00:00.000Z",
    "time": "Apr 16",
    "articleType": "regular",
    "content": "Steve Corfield, capping off his first year as Salesforce channel chief, is at work on what he calls “a next-generation partner experience platform” that aims to help the vendor’s solution providers as they help expand adoption of artificial intelligence products and other offerings in the Salesforce portfolio.The San Francisco-based CRM software vendor has about 12,000 partners, Corfield told CRN, with about half of them providing consulting services.Salesforce’s reseller business grew 60 percent year over year in 2023, Corfield said. Its outsourced service provider business grew 89 percent. And for $1 of annual contract value (ACV) for Salesforce, partners can get $6 when factoring in services and work beyond transacting the license. For a vendor that reported in March that it brought in $31.4 billion in revenue during its 2023 fiscal year—up 22 percent year over year ignoring foreign exchange—that is a lot of opportunity for partners, he said.“When you think about how much of [our revenue] is actually managed on a day-to-day [basis] by the partners, they’re massive custodians of the brand and customer success and lifetime value,” Corfield said. “We’ve always orientated ourselves to ACV … what’s actually in the marketplace and in our broader economy is as important.”[RELATED: Salesforce May Acquire Informatica For More Than $11B: Reports]Salesforce Invests In Channel ProgramTim Harris, chief strategy officer with Plano, Texas-based Argano, called Salesforce a “top-tier” partner of the MSP in an interview with CRN. Argano even saw six times the bookings in December and January year over year. About 75 percent of its customers have some form of Salesforce licensing.“We have big growth goals for Salesforce over the next couple of years,” Harris said. “Owning AI is such a driver for Salesforce. I mean, no one owns more customer data than Salesforce. So how do you not take advantage of that?”Maximilian Schroeck, Deloitte’s global chief commercial officer for the London-based consulting giant’s Salesforce alliance, told CRN that Salesforce is a top-three alliance for the firm, with 18,000 consultants worldwide delivering more than 1,000 projects a year.About 15,000 of those consultants hold a total of about 50,000 credentials, Schroeck said. That sort of manpower is needed for Salesforce’s data and AI offerings to land and expand with customers.He said Salesforce’s leadership has worked with Deloitte to improve its partner engagement model. “Much has happened there to Salesforce’s credit, but also, not to sound self-serving, a little bit to our credit as well. There’s much goodness there.”Harry Datwani, Deloitte Consulting principal and U.S. Salesforce alliance leader, told CRN that Deloitte has been busy over the last quarter signing three- to five-year-long contracts to increase return on investment in Salesforce spending plus building out Data Cloud use cases with customers to take more action on the digital information they amass.“We were very early in getting a number of our teams globally certified and co-creating and building Data Cloud plus … our own assets and accelerators. Data Cloud plus the rest of the ecosystem. We’ve built a number of accelerators with Data Cloud and Amazon, Data Cloud and Google, as an example.”Much of the work for Corfield and his team has been on bringing dormant partners back into the action and providing them with more resources, said Corfield, who succeeded former channel chief Tyler Prince in April 2023. Prince is now channel chief of Salesforce rival Snowflake.Corfield—whose formal title is executive vice president and general manager of global alliances, channels and emerging products—has previously served as Salesforce’s executive vice president of industry sales and CRO for global commerce since February 2021, according to his LinkedIn account. He has been with Salesforce for about nine years, starting in 2015 as senior area vice president and head of sales for Europe, the Middle East and Africa (EMEA) for Commerce Cloud.The vendor’s investments in AI and packaging products for smaller enterprises has created more opportunities for partners, Corfield said.And Salesforce has invested in more enablement and training for partners to sell products throughout the vendor’s portfolio, which includes data visualization platform Tableau and integration platform MuleSoft.A sign of Salesforce resources catching on with partners and partner excitement around AI is 17,000 AI credentials issued across 1,400 partners, Corfield said. There have been 180,000 certifications issued on Salesforce’s Trailhead online learning platform, with 225,000 credentialed individuals.“You talk about opportunity, we’re going to get to $50 billion [in revenue] fairly quickly,” Corfield said. “We need half a million credentialed consultants because we know we’re going to be working in a $2 trillion economy with some 11 million people globally that will touch the Salesforce platform. That’s the magnitude of the opportunity. That’s what I want people excited about.”Here’s more of what Corfield had to say to CRN.",
    "favicon": ""
  }
]